<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Struct id="_1871" name="xcb_fill_poly_request_t" context="_1" mangled="23xcb_fill_poly_request_t" demangled="xcb_fill_poly_request_t" location="f0:3080" file="f0" line="3080" artificial="1" size="128" align="32" members="_5078 _5079 _5080 _5081 _5082 _5083 _5084 _5085 _5086 _5087 _5088 _5089 " bases=""/>
  <Typedef id="_1872" name="xcb_fill_poly_request_t" type="_1871" context="_1" location="f0:3089" file="f0" line="3089"/>
  <Function id="_1873" name="xcb_gcontext_end" returns="_751" context="_1" location="f0:4661" file="f0" line="4661" extern="1">
    <Argument name="i" type="_1866" location="f0:4661" file="f0" line="4661"/>
  </Function>
  <Typedef id="_1874" name="xcb_keysym_t" type="_699" context="_1" location="f0:159" file="f0" line="159"/>
  <Function id="_1875" name="pthread_mutexattr_setprotocol" returns="_184" throw="" context="_1" location="f4:831" file="f4" line="831" extern="1" attributes="__nonnull__()">
    <Argument name="__attr" type="_2814" location="f4:831" file="f4" line="831"/>
    <Argument name="__protocol" type="_184" location="f4:831" file="f4" line="831"/>
  </Function>
  <Function id="_1876" name="xcb_get_selection_owner_reply" returns="_5090" context="_1" location="f0:7609" file="f0" line="7609" extern="1">
    <Argument name="c" type="_1939" location="f0:7609" file="f0" line="7609"/>
    <Argument name="cookie" type="_1171" location="f0:7609" file="f0" line="7609"/>
    <Argument name="e" type="_2200" location="f0:7609" file="f0" line="7609"/>
  </Function>
  <Struct id="_1877" name="xcb_set_access_control_request_t" context="_1" mangled="32xcb_set_access_control_request_t" demangled="xcb_set_access_control_request_t" location="f0:4185" file="f0" line="4185" artificial="1" size="32" align="16" members="_5091 _5092 _5093 _5094 _5095 _5096 _5097 " bases=""/>
  <Typedef id="_1878" name="xcb_set_access_control_request_t" type="_1877" context="_1" location="f0:4189" file="f0" line="4189"/>
  <Struct id="_1879" name="xcb_visualtype_t" context="_1" mangled="16xcb_visualtype_t" demangled="xcb_visualtype_t" location="f0:280" file="f0" line="280" artificial="1" size="192" align="32" members="_5098 _5099 _5100 _5101 _5102 _5103 _5104 _5105 _5106 _5107 _5108 _5109 " bases=""/>
  <Typedef id="_1880" name="xcb_visualtype_t" type="_1879" context="_1" location="f0:289" file="f0" line="289"/>
  <Function id="_1881" name="pthread_mutexattr_gettype" returns="_184" throw="" context="_1" location="f4:812" file="f4" line="812" extern="1" attributes="__nonnull__(,)">
    <Argument name="__attr" type="_1949r" location="f4:812" file="f4" line="812"/>
    <Argument name="__kind" type="_1934r" location="f4:812" file="f4" line="812"/>
  </Function>
  <Function id="_1882" name="xcb_get_atom_name_reply" returns="_5110" context="_1" location="f0:7079" file="f0" line="7079" extern="1">
    <Argument name="c" type="_1939" location="f0:7079" file="f0" line="7079"/>
    <Argument name="cookie" type="_1618" location="f0:7079" file="f0" line="7079"/>
    <Argument name="e" type="_2200" location="f0:7079" file="f0" line="7079"/>
  </Function>
  <Typedef id="_1883" name="__int32_t" type="_184" context="_1" location="f10:41" file="f10" line="41"/>
  <Struct id="_1884" name="xcb_font_iterator_t" context="_1" mangled="19xcb_font_iterator_t" demangled="xcb_font_iterator_t" location="f0:76" file="f0" line="76" artificial="1" size="128" align="64" members="_5111 _5112 _5113 _5114 _5115 _5116 _5117 " bases=""/>
  <Typedef id="_1885" name="xcb_font_iterator_t" type="_1884" context="_1" location="f0:80" file="f0" line="80"/>
  <Struct id="_1886" name="xcb_extension_t" context="_1" incomplete="1" mangled="15xcb_extension_t" demangled="xcb_extension_t" location="f14:345" file="f14" line="345" artificial="1" align="8"/>
  <Typedef id="_1887" name="xcb_extension_t" type="_1886" context="_1" location="f14:345" file="f14" line="345"/>
  <Function id="_1888" name="xcb_poly_line_checked" returns="_1012" context="_1" location="f0:10935" file="f0" line="10935" extern="1">
    <Argument name="c" type="_1939" location="f0:10935" file="f0" line="10935"/>
    <Argument name="coordinate_mode" type="_1478" location="f0:10935" file="f0" line="10935"/>
    <Argument name="drawable" type="_878" location="f0:10935" file="f0" line="10935"/>
    <Argument name="gc" type="_1792" location="f0:10935" file="f0" line="10935"/>
    <Argument name="points_len" type="_699" location="f0:10935" file="f0" line="10935"/>
    <Argument name="points" type="_3025" location="f0:10935" file="f0" line="10935"/>
  </Function>
  <Function id="_1889" name="xcb_free_colors_checked" returns="_1012" context="_1" location="f0:12853" file="f0" line="12853" extern="1">
    <Argument name="c" type="_1939" location="f0:12853" file="f0" line="12853"/>
    <Argument name="cmap" type="_720" location="f0:12853" file="f0" line="12853"/>
    <Argument name="plane_mask" type="_699" location="f0:12853" file="f0" line="12853"/>
    <Argument name="pixels_len" type="_699" location="f0:12853" file="f0" line="12853"/>
    <Argument name="pixels" type="_1948" location="f0:12853" file="f0" line="12853"/>
  </Function>
  <Function id="_1890" name="xcb_grab_pointer_unchecked" returns="_739" context="_1" location="f0:7812" file="f0" line="7812" extern="1">
    <Argument name="c" type="_1939" location="f0:7812" file="f0" line="7812"/>
    <Argument name="owner_events" type="_1478" location="f0:7812" file="f0" line="7812"/>
    <Argument name="grab_window" type="_680" location="f0:7812" file="f0" line="7812"/>
    <Argument name="event_mask" type="_1399" location="f0:7812" file="f0" line="7812"/>
    <Argument name="pointer_mode" type="_1478" location="f0:7812" file="f0" line="7812"/>
    <Argument name="keyboard_mode" type="_1478" location="f0:7812" file="f0" line="7812"/>
    <Argument name="confine_to" type="_680" location="f0:7812" file="f0" line="7812"/>
    <Argument name="cursor" type="_1059" location="f0:7812" file="f0" line="7812"/>
    <Argument name="time" type="_1260" location="f0:7812" file="f0" line="7812"/>
  </Function>
  <Typedef id="_1891" name="__caddr_t" type="_1121" context="_1" location="f10:186" file="f10" line="186"/>
  <Field id="_1892" name="data" type="_5118" offset="0" context="_3" access="public" location="f0:3541" file="f0" line="3541"/>
  <Field id="_1893" name="rem" type="_184" offset="64" context="_3" access="public" location="f0:3542" file="f0" line="3542"/>
  <Field id="_1894" name="index" type="_184" offset="96" context="_3" access="public" location="f0:3543" file="f0" line="3543"/>
  <Destructor id="_1895" name="xcb_coloritem_iterator_t" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_tD1Ev *INTERNAL* " demangled="xcb_coloritem_iterator_t::~xcb_coloritem_iterator_t()" location="f0:3540" file="f0" line="3540" endline="3540" inline="1">
  </Destructor>
  <OperatorMethod id="_1896" name="=" returns="_5119" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_taSERKS_" demangled="xcb_coloritem_iterator_t::operator=(xcb_coloritem_iterator_t const&amp;)" location="f0:3540" file="f0" line="3540" endline="3540" inline="1">
    <Argument type="_5120" location="f0:3540" file="f0" line="3540"/>
  </OperatorMethod>
  <Constructor id="_1897" name="xcb_coloritem_iterator_t" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_coloritem_iterator_t::xcb_coloritem_iterator_t(xcb_coloritem_iterator_t const&amp;)" location="f0:3540" file="f0" line="3540" endline="3540" inline="1">
    <Argument type="_5120" location="f0:3540" file="f0" line="3540"/>
  </Constructor>
  <Constructor id="_1898" name="xcb_coloritem_iterator_t" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_tC1Ev *INTERNAL* " demangled="xcb_coloritem_iterator_t::xcb_coloritem_iterator_t()" location="f0:3540" file="f0" line="3540" inline="1"/>
  <Field id="_1899" name="it_interval" type="_776" offset="0" context="_5" access="public" location="f1:163" file="f1" line="163"/>
  <Field id="_1900" name="it_value" type="_776" offset="128" context="_5" access="public" location="f1:164" file="f1" line="164"/>
  <Destructor id="_1901" name="itimerspec" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecD1Ev *INTERNAL* " demangled="itimerspec::~itimerspec()" location="f1:162" file="f1" line="162" endline="162" inline="1">
  </Destructor>
  <OperatorMethod id="_1902" name="=" returns="_5121" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecaSERKS_" demangled="itimerspec::operator=(itimerspec const&amp;)" location="f1:162" file="f1" line="162" endline="162" inline="1">
    <Argument type="_5122" location="f1:162" file="f1" line="162"/>
  </OperatorMethod>
  <Constructor id="_1903" name="itimerspec" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecC1ERKS_ *INTERNAL* " demangled="itimerspec::itimerspec(itimerspec const&amp;)" location="f1:162" file="f1" line="162" endline="162" inline="1">
    <Argument type="_5122" location="f1:162" file="f1" line="162"/>
  </Constructor>
  <Constructor id="_1904" name="itimerspec" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecC1Ev *INTERNAL* " demangled="itimerspec::itimerspec()" location="f1:162" file="f1" line="162" inline="1"/>
  <Field id="_1905" name="response_type" type="_1478" offset="0" context="_8" access="public" location="f0:1657" file="f0" line="1657"/>
  <Field id="_1906" name="pad0" type="_1478" offset="8" context="_8" access="public" location="f0:1658" file="f0" line="1658"/>
  <Field id="_1907" name="sequence" type="_1399" offset="16" context="_8" access="public" location="f0:1659" file="f0" line="1659"/>
  <Field id="_1908" name="length" type="_699" offset="32" context="_8" access="public" location="f0:1660" file="f0" line="1660"/>
  <Field id="_1909" name="root" type="_680" offset="64" context="_8" access="public" location="f0:1661" file="f0" line="1661"/>
  <Field id="_1910" name="parent" type="_680" offset="96" context="_8" access="public" location="f0:1662" file="f0" line="1662"/>
  <Field id="_1911" name="children_len" type="_1399" offset="128" context="_8" access="public" location="f0:1663" file="f0" line="1663"/>
  <Field id="_1912" name="pad1" type="_5123" offset="144" context="_8" access="public" location="f0:1664" file="f0" line="1664"/>
  <Destructor id="_1913" name="xcb_query_tree_reply_t" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_tD1Ev *INTERNAL* " demangled="xcb_query_tree_reply_t::~xcb_query_tree_reply_t()" location="f0:1656" file="f0" line="1656" endline="1656" inline="1">
  </Destructor>
  <OperatorMethod id="_1914" name="=" returns="_5124" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_taSERKS_" demangled="xcb_query_tree_reply_t::operator=(xcb_query_tree_reply_t const&amp;)" location="f0:1656" file="f0" line="1656" endline="1656" inline="1">
    <Argument type="_5125" location="f0:1656" file="f0" line="1656"/>
  </OperatorMethod>
  <Constructor id="_1915" name="xcb_query_tree_reply_t" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_tree_reply_t::xcb_query_tree_reply_t(xcb_query_tree_reply_t const&amp;)" location="f0:1656" file="f0" line="1656" endline="1656" inline="1">
    <Argument type="_5125" location="f0:1656" file="f0" line="1656"/>
  </Constructor>
  <Constructor id="_1916" name="xcb_query_tree_reply_t" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_tC1Ev *INTERNAL* " demangled="xcb_query_tree_reply_t::xcb_query_tree_reply_t()" location="f0:1656" file="f0" line="1656" inline="1"/>
  <FundamentalType id="_1917" name="double" size="64" align="64"/>
  <PointerType id="_1918" type="_4033c" size="64" align="64"/>
  <FundamentalType id="_1919" name="void" align="8"/>
  <PointerType id="_1920" type="_612" size="64" align="64"/>
  <Field id="_1921" name="major_opcode" type="_1478" offset="0" context="_12" access="public" location="f0:3160" file="f0" line="3160"/>
  <Field id="_1922" name="format" type="_1478" offset="8" context="_12" access="public" location="f0:3161" file="f0" line="3161"/>
  <Field id="_1923" name="length" type="_1399" offset="16" context="_12" access="public" location="f0:3162" file="f0" line="3162"/>
  <Field id="_1924" name="drawable" type="_878" offset="32" context="_12" access="public" location="f0:3163" file="f0" line="3163"/>
  <Field id="_1925" name="x" type="_883" offset="64" context="_12" access="public" location="f0:3164" file="f0" line="3164"/>
  <Field id="_1926" name="y" type="_883" offset="80" context="_12" access="public" location="f0:3165" file="f0" line="3165"/>
  <Field id="_1927" name="width" type="_1399" offset="96" context="_12" access="public" location="f0:3166" file="f0" line="3166"/>
  <Field id="_1928" name="height" type="_1399" offset="112" context="_12" access="public" location="f0:3167" file="f0" line="3167"/>
  <Field id="_1929" name="plane_mask" type="_699" offset="128" context="_12" access="public" location="f0:3168" file="f0" line="3168"/>
  <Destructor id="_1930" name="xcb_get_image_request_t" artificial="1" throw="" context="_12" access="public" mangled="_ZN23xcb_get_image_request_tD1Ev *INTERNAL* " demangled="xcb_get_image_request_t::~xcb_get_image_request_t()" location="f0:3159" file="f0" line="3159" endline="3159" inline="1">
  </Destructor>
  <OperatorMethod id="_1931" name="=" returns="_5127" artificial="1" throw="" context="_12" access="public" mangled="_ZN23xcb_get_image_request_taSERKS_" demangled="xcb_get_image_request_t::operator=(xcb_get_image_request_t const&amp;)" location="f0:3159" file="f0" line="3159" endline="3159" inline="1">
    <Argument type="_5128" location="f0:3159" file="f0" line="3159"/>
  </OperatorMethod>
  <Constructor id="_1932" name="xcb_get_image_request_t" artificial="1" throw="" context="_12" access="public" mangled="_ZN23xcb_get_image_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_image_request_t::xcb_get_image_request_t(xcb_get_image_request_t const&amp;)" location="f0:3159" file="f0" line="3159" endline="3159" inline="1">
    <Argument type="_5128" location="f0:3159" file="f0" line="3159"/>
  </Constructor>
  <Constructor id="_1933" name="xcb_get_image_request_t" artificial="1" throw="" context="_12" access="public" mangled="_ZN23xcb_get_image_request_tC1Ev *INTERNAL* " demangled="xcb_get_image_request_t::xcb_get_image_request_t()" location="f0:3159" file="f0" line="3159" inline="1"/>
  <PointerType id="_1934" type="_184" size="64" align="64"/>
  <CvQualifiedType id="_1934r" type="_1934" restrict="1"/>
  <PointerType id="_1936" type="_645" size="64" align="64"/>
  <CvQualifiedType id="_1936r" type="_1936" restrict="1"/>
  <FundamentalType id="_1938" name="float" size="32" align="32"/>
  <PointerType id="_1939" type="_1487" size="64" align="64"/>
  <FundamentalType id="_1940" name="long double" size="128" align="128"/>
  <PointerType id="_1941" type="_1919c" size="64" align="64"/>
  <Field id="_1942" name="tv_sec" type="_1053" offset="0" context="_19" access="public" location="f5:33" file="f5" line="33"/>
  <Field id="_1943" name="tv_usec" type="_201" offset="64" context="_19" access="public" location="f5:34" file="f5" line="34"/>
  <Destructor id="_1944" name="timeval" artificial="1" throw="" context="_19" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f5:32" file="f5" line="32" endline="32" inline="1">
  </Destructor>
  <OperatorMethod id="_1945" name="=" returns="_5130" artificial="1" throw="" context="_19" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f5:32" file="f5" line="32" endline="32" inline="1">
    <Argument type="_5131" location="f5:32" file="f5" line="32"/>
  </OperatorMethod>
  <Constructor id="_1946" name="timeval" artificial="1" throw="" context="_19" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f5:32" file="f5" line="32" endline="32" inline="1">
    <Argument type="_5131" location="f5:32" file="f5" line="32"/>
  </Constructor>
  <Constructor id="_1947" name="timeval" artificial="1" throw="" context="_19" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f5:32" file="f5" line="32" inline="1"/>
  <PointerType id="_1948" type="_699c" size="64" align="64"/>
  <PointerType id="_1949" type="_346c" size="64" align="64"/>
  <CvQualifiedType id="_1949r" type="_1949" restrict="1"/>
  <Field id="_1951" name="tm_sec" type="_184" offset="0" context="_28" access="public" location="f1:135" file="f1" line="135"/>
  <Field id="_1952" name="tm_min" type="_184" offset="32" context="_28" access="public" location="f1:136" file="f1" line="136"/>
  <Field id="_1953" name="tm_hour" type="_184" offset="64" context="_28" access="public" location="f1:137" file="f1" line="137"/>
  <Field id="_1954" name="tm_mday" type="_184" offset="96" context="_28" access="public" location="f1:138" file="f1" line="138"/>
  <Field id="_1955" name="tm_mon" type="_184" offset="128" context="_28" access="public" location="f1:139" file="f1" line="139"/>
  <Field id="_1956" name="tm_year" type="_184" offset="160" context="_28" access="public" location="f1:140" file="f1" line="140"/>
  <Field id="_1957" name="tm_wday" type="_184" offset="192" context="_28" access="public" location="f1:141" file="f1" line="141"/>
  <Field id="_1958" name="tm_yday" type="_184" offset="224" context="_28" access="public" location="f1:142" file="f1" line="142"/>
  <Field id="_1959" name="tm_isdst" type="_184" offset="256" context="_28" access="public" location="f1:143" file="f1" line="143"/>
  <Field id="_1960" name="tm_gmtoff" type="_32" offset="320" context="_28" access="public" location="f1:146" file="f1" line="146"/>
  <Field id="_1961" name="tm_zone" type="_1918" offset="384" context="_28" access="public" location="f1:147" file="f1" line="147"/>
  <Destructor id="_1962" name="tm" artificial="1" throw="" context="_28" access="public" mangled="_ZN2tmD1Ev *INTERNAL* " demangled="tm::~tm()" location="f1:134" file="f1" line="134" endline="134" inline="1">
  </Destructor>
  <OperatorMethod id="_1963" name="=" returns="_5134" artificial="1" throw="" context="_28" access="public" mangled="_ZN2tmaSERKS_" demangled="tm::operator=(tm const&amp;)" location="f1:134" file="f1" line="134" endline="134" inline="1">
    <Argument type="_5135" location="f1:134" file="f1" line="134"/>
  </OperatorMethod>
  <Constructor id="_1964" name="tm" artificial="1" throw="" context="_28" access="public" mangled="_ZN2tmC1ERKS_ *INTERNAL* " demangled="tm::tm(tm const&amp;)" location="f1:134" file="f1" line="134" endline="134" inline="1">
    <Argument type="_5135" location="f1:134" file="f1" line="134"/>
  </Constructor>
  <Constructor id="_1965" name="tm" artificial="1" throw="" context="_28" access="public" mangled="_ZN2tmC1Ev *INTERNAL* " demangled="tm::tm()" location="f1:134" file="f1" line="134" inline="1"/>
  <FundamentalType id="_1966" name="bool" size="8" align="8"/>
  <Field id="_1967" name="response_type" type="_1478" offset="0" context="_30" access="public" location="f0:1202" file="f0" line="1202"/>
  <Field id="_1968" name="error_code" type="_1478" offset="8" context="_30" access="public" location="f0:1203" file="f0" line="1203"/>
  <Field id="_1969" name="sequence" type="_1399" offset="16" context="_30" access="public" location="f0:1204" file="f0" line="1204"/>
  <Field id="_1970" name="bad_value" type="_699" offset="32" context="_30" access="public" location="f0:1205" file="f0" line="1205"/>
  <Field id="_1971" name="minor_opcode" type="_1399" offset="64" context="_30" access="public" location="f0:1206" file="f0" line="1206"/>
  <Field id="_1972" name="major_opcode" type="_1478" offset="80" context="_30" access="public" location="f0:1207" file="f0" line="1207"/>
  <Field id="_1973" name="pad0" type="_1478" offset="88" context="_30" access="public" location="f0:1208" file="f0" line="1208"/>
  <Destructor id="_1974" name="xcb_request_error_t" artificial="1" throw="" context="_30" access="public" mangled="_ZN19xcb_request_error_tD1Ev *INTERNAL* " demangled="xcb_request_error_t::~xcb_request_error_t()" location="f0:1201" file="f0" line="1201" endline="1201" inline="1">
  </Destructor>
  <OperatorMethod id="_1975" name="=" returns="_5136" artificial="1" throw="" context="_30" access="public" mangled="_ZN19xcb_request_error_taSERKS_" demangled="xcb_request_error_t::operator=(xcb_request_error_t const&amp;)" location="f0:1201" file="f0" line="1201" endline="1201" inline="1">
    <Argument type="_5137" location="f0:1201" file="f0" line="1201"/>
  </OperatorMethod>
  <Constructor id="_1976" name="xcb_request_error_t" artificial="1" throw="" context="_30" access="public" mangled="_ZN19xcb_request_error_tC1ERKS_ *INTERNAL* " demangled="xcb_request_error_t::xcb_request_error_t(xcb_request_error_t const&amp;)" location="f0:1201" file="f0" line="1201" endline="1201" inline="1">
    <Argument type="_5137" location="f0:1201" file="f0" line="1201"/>
  </Constructor>
  <Constructor id="_1977" name="xcb_request_error_t" artificial="1" throw="" context="_30" access="public" mangled="_ZN19xcb_request_error_tC1Ev *INTERNAL* " demangled="xcb_request_error_t::xcb_request_error_t()" location="f0:1201" file="f0" line="1201" inline="1"/>
  <Field id="_1978" name="major_opcode" type="_1478" offset="0" context="_36" access="public" location="f0:1787" file="f0" line="1787"/>
  <Field id="_1979" name="_delete" type="_1478" offset="8" context="_36" access="public" location="f0:1788" file="f0" line="1788"/>
  <Field id="_1980" name="length" type="_1399" offset="16" context="_36" access="public" location="f0:1789" file="f0" line="1789"/>
  <Field id="_1981" name="window" type="_680" offset="32" context="_36" access="public" location="f0:1790" file="f0" line="1790"/>
  <Field id="_1982" name="property" type="_1679" offset="64" context="_36" access="public" location="f0:1791" file="f0" line="1791"/>
  <Field id="_1983" name="type" type="_1679" offset="96" context="_36" access="public" location="f0:1792" file="f0" line="1792"/>
  <Field id="_1984" name="long_offset" type="_699" offset="128" context="_36" access="public" location="f0:1793" file="f0" line="1793"/>
  <Field id="_1985" name="long_length" type="_699" offset="160" context="_36" access="public" location="f0:1794" file="f0" line="1794"/>
  <Destructor id="_1986" name="xcb_get_property_request_t" artificial="1" throw="" context="_36" access="public" mangled="_ZN26xcb_get_property_request_tD1Ev *INTERNAL* " demangled="xcb_get_property_request_t::~xcb_get_property_request_t()" location="f0:1786" file="f0" line="1786" endline="1786" inline="1">
  </Destructor>
  <OperatorMethod id="_1987" name="=" returns="_5138" artificial="1" throw="" context="_36" access="public" mangled="_ZN26xcb_get_property_request_taSERKS_" demangled="xcb_get_property_request_t::operator=(xcb_get_property_request_t const&amp;)" location="f0:1786" file="f0" line="1786" endline="1786" inline="1">
    <Argument type="_5139" location="f0:1786" file="f0" line="1786"/>
  </OperatorMethod>
  <Constructor id="_1988" name="xcb_get_property_request_t" artificial="1" throw="" context="_36" access="public" mangled="_ZN26xcb_get_property_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_property_request_t::xcb_get_property_request_t(xcb_get_property_request_t const&amp;)" location="f0:1786" file="f0" line="1786" endline="1786" inline="1">
    <Argument type="_5139" location="f0:1786" file="f0" line="1786"/>
  </Constructor>
  <Constructor id="_1989" name="xcb_get_property_request_t" artificial="1" throw="" context="_36" access="public" mangled="_ZN26xcb_get_property_request_tC1Ev *INTERNAL* " demangled="xcb_get_property_request_t::xcb_get_property_request_t()" location="f0:1786" file="f0" line="1786" inline="1"/>
  <Field id="_1990" name="data" type="_5140" offset="0" context="_40" access="public" location="f0:3021" file="f0" line="3021"/>
  <Field id="_1991" name="rem" type="_184" offset="64" context="_40" access="public" location="f0:3022" file="f0" line="3022"/>
  <Field id="_1992" name="index" type="_184" offset="96" context="_40" access="public" location="f0:3023" file="f0" line="3023"/>
  <Destructor id="_1993" name="xcb_segment_iterator_t" artificial="1" throw="" context="_40" access="public" mangled="_ZN22xcb_segment_iterator_tD1Ev *INTERNAL* " demangled="xcb_segment_iterator_t::~xcb_segment_iterator_t()" location="f0:3020" file="f0" line="3020" endline="3020" inline="1">
  </Destructor>
  <OperatorMethod id="_1994" name="=" returns="_5141" artificial="1" throw="" context="_40" access="public" mangled="_ZN22xcb_segment_iterator_taSERKS_" demangled="xcb_segment_iterator_t::operator=(xcb_segment_iterator_t const&amp;)" location="f0:3020" file="f0" line="3020" endline="3020" inline="1">
    <Argument type="_5142" location="f0:3020" file="f0" line="3020"/>
  </OperatorMethod>
  <Constructor id="_1995" name="xcb_segment_iterator_t" artificial="1" throw="" context="_40" access="public" mangled="_ZN22xcb_segment_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_segment_iterator_t::xcb_segment_iterator_t(xcb_segment_iterator_t const&amp;)" location="f0:3020" file="f0" line="3020" endline="3020" inline="1">
    <Argument type="_5142" location="f0:3020" file="f0" line="3020"/>
  </Constructor>
  <Constructor id="_1996" name="xcb_segment_iterator_t" artificial="1" throw="" context="_40" access="public" mangled="_ZN22xcb_segment_iterator_tC1Ev *INTERNAL* " demangled="xcb_segment_iterator_t::xcb_segment_iterator_t()" location="f0:3020" file="f0" line="3020" inline="1"/>
  <PointerType id="_1997" type="_1057" size="64" align="64"/>
  <FundamentalType id="_1998" name="long long int" size="64" align="64"/>
  <FundamentalType id="_1999" name="complex float" size="64" align="32"/>
  <FundamentalType id="_2000" name="complex long double" size="256" align="128"/>
  <Field id="_2001" name="data" type="_5143" offset="0" context="_52" access="public" location="f0:204" file="f0" line="204"/>
  <Field id="_2002" name="rem" type="_184" offset="64" context="_52" access="public" location="f0:205" file="f0" line="205"/>
  <Field id="_2003" name="index" type="_184" offset="96" context="_52" access="public" location="f0:206" file="f0" line="206"/>
  <Destructor id="_2004" name="xcb_point_iterator_t" artificial="1" throw="" context="_52" access="public" mangled="_ZN20xcb_point_iterator_tD1Ev *INTERNAL* " demangled="xcb_point_iterator_t::~xcb_point_iterator_t()" location="f0:203" file="f0" line="203" endline="203" inline="1">
  </Destructor>
  <OperatorMethod id="_2005" name="=" returns="_5144" artificial="1" throw="" context="_52" access="public" mangled="_ZN20xcb_point_iterator_taSERKS_" demangled="xcb_point_iterator_t::operator=(xcb_point_iterator_t const&amp;)" location="f0:203" file="f0" line="203" endline="203" inline="1">
    <Argument type="_5145" location="f0:203" file="f0" line="203"/>
  </OperatorMethod>
  <Constructor id="_2006" name="xcb_point_iterator_t" artificial="1" throw="" context="_52" access="public" mangled="_ZN20xcb_point_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_point_iterator_t::xcb_point_iterator_t(xcb_point_iterator_t const&amp;)" location="f0:203" file="f0" line="203" endline="203" inline="1">
    <Argument type="_5145" location="f0:203" file="f0" line="203"/>
  </Constructor>
  <Constructor id="_2007" name="xcb_point_iterator_t" artificial="1" throw="" context="_52" access="public" mangled="_ZN20xcb_point_iterator_tC1Ev *INTERNAL* " demangled="xcb_point_iterator_t::xcb_point_iterator_t()" location="f0:203" file="f0" line="203" inline="1"/>
  <Field id="_2008" name="major_opcode" type="_1478" offset="0" context="_56" access="public" location="f0:3479" file="f0" line="3479"/>
  <Field id="_2009" name="contiguous" type="_1478" offset="8" context="_56" access="public" location="f0:3480" file="f0" line="3480"/>
  <Field id="_2010" name="length" type="_1399" offset="16" context="_56" access="public" location="f0:3481" file="f0" line="3481"/>
  <Field id="_2011" name="cmap" type="_720" offset="32" context="_56" access="public" location="f0:3482" file="f0" line="3482"/>
  <Field id="_2012" name="colors" type="_1399" offset="64" context="_56" access="public" location="f0:3483" file="f0" line="3483"/>
  <Field id="_2013" name="reds" type="_1399" offset="80" context="_56" access="public" location="f0:3484" file="f0" line="3484"/>
  <Field id="_2014" name="greens" type="_1399" offset="96" context="_56" access="public" location="f0:3485" file="f0" line="3485"/>
  <Field id="_2015" name="blues" type="_1399" offset="112" context="_56" access="public" location="f0:3486" file="f0" line="3486"/>
  <Destructor id="_2016" name="xcb_alloc_color_planes_request_t" artificial="1" throw="" context="_56" access="public" mangled="_ZN32xcb_alloc_color_planes_request_tD1Ev *INTERNAL* " demangled="xcb_alloc_color_planes_request_t::~xcb_alloc_color_planes_request_t()" location="f0:3478" file="f0" line="3478" endline="3478" inline="1">
  </Destructor>
  <OperatorMethod id="_2017" name="=" returns="_5146" artificial="1" throw="" context="_56" access="public" mangled="_ZN32xcb_alloc_color_planes_request_taSERKS_" demangled="xcb_alloc_color_planes_request_t::operator=(xcb_alloc_color_planes_request_t const&amp;)" location="f0:3478" file="f0" line="3478" endline="3478" inline="1">
    <Argument type="_5147" location="f0:3478" file="f0" line="3478"/>
  </OperatorMethod>
  <Constructor id="_2018" name="xcb_alloc_color_planes_request_t" artificial="1" throw="" context="_56" access="public" mangled="_ZN32xcb_alloc_color_planes_request_tC1ERKS_ *INTERNAL* " demangled="xcb_alloc_color_planes_request_t::xcb_alloc_color_planes_request_t(xcb_alloc_color_planes_request_t const&amp;)" location="f0:3478" file="f0" line="3478" endline="3478" inline="1">
    <Argument type="_5147" location="f0:3478" file="f0" line="3478"/>
  </Constructor>
  <Constructor id="_2019" name="xcb_alloc_color_planes_request_t" artificial="1" throw="" context="_56" access="public" mangled="_ZN32xcb_alloc_color_planes_request_tC1Ev *INTERNAL* " demangled="xcb_alloc_color_planes_request_t::xcb_alloc_color_planes_request_t()" location="f0:3478" file="f0" line="3478" inline="1"/>
  <Field id="_2020" name="__size" type="_5148" offset="0" context="_61" access="public" location="f9:134" file="f9" line="134"/>
  <Field id="_2021" name="__align" type="_184" offset="0" context="_61" access="public" location="f9:135" file="f9" line="135"/>
  <Destructor id="_2022" name="._8" artificial="1" throw="" context="_61" access="public" mangled="_ZN18pthread_condattr_tD1Ev *INTERNAL* " demangled="pthread_condattr_t::~pthread_condattr_t()" location="f9:136" file="f9" line="136" endline="136" inline="1">
  </Destructor>
  <OperatorMethod id="_2023" name="=" returns="_5149" artificial="1" throw="" context="_61" access="public" mangled="_ZN18pthread_condattr_taSERKS_" demangled="pthread_condattr_t::operator=(pthread_condattr_t const&amp;)" location="f9:136" file="f9" line="136" endline="136" inline="1">
    <Argument type="_5150" location="f9:133" file="f9" line="133"/>
  </OperatorMethod>
  <Constructor id="_2024" name="._8" artificial="1" throw="" context="_61" access="public" mangled="_ZN18pthread_condattr_tC1ERKS_ *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t(pthread_condattr_t const&amp;)" location="f9:136" file="f9" line="136" endline="136" inline="1">
    <Argument type="_5150" location="f9:133" file="f9" line="133"/>
  </Constructor>
  <Constructor id="_2025" name="._8" artificial="1" throw="" context="_61" access="public" mangled="_ZN18pthread_condattr_tC1Ev *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t()" location="f9:136" file="f9" line="136" inline="1"/>
  <PointerType id="_2026" type="_705c" size="64" align="64"/>
  <PointerType id="_2027" type="_1478" size="64" align="64"/>
  <PointerType id="_2028" type="_1870c" size="64" align="64"/>
  <Field id="_2029" name="sequence" type="_151" offset="0" context="_64" access="public" location="f0:2487" file="f0" line="2487"/>
  <Destructor id="_2030" name="xcb_query_font_cookie_t" artificial="1" throw="" context="_64" access="public" mangled="_ZN23xcb_query_font_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_font_cookie_t::~xcb_query_font_cookie_t()" location="f0:2486" file="f0" line="2486" endline="2486" inline="1">
  </Destructor>
  <OperatorMethod id="_2031" name="=" returns="_5153" artificial="1" throw="" context="_64" access="public" mangled="_ZN23xcb_query_font_cookie_taSERKS_" demangled="xcb_query_font_cookie_t::operator=(xcb_query_font_cookie_t const&amp;)" location="f0:2486" file="f0" line="2486" endline="2486" inline="1">
    <Argument type="_5154" location="f0:2486" file="f0" line="2486"/>
  </OperatorMethod>
  <Constructor id="_2032" name="xcb_query_font_cookie_t" artificial="1" throw="" context="_64" access="public" mangled="_ZN23xcb_query_font_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_font_cookie_t::xcb_query_font_cookie_t(xcb_query_font_cookie_t const&amp;)" location="f0:2486" file="f0" line="2486" endline="2486" inline="1">
    <Argument type="_5154" location="f0:2486" file="f0" line="2486"/>
  </Constructor>
  <Constructor id="_2033" name="xcb_query_font_cookie_t" artificial="1" throw="" context="_64" access="public" mangled="_ZN23xcb_query_font_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_font_cookie_t::xcb_query_font_cookie_t()" location="f0:2486" file="f0" line="2486" inline="1"/>
  <PointerType id="_2034" type="_905c" size="64" align="64"/>
  <Field id="_2035" name="major_opcode" type="_1478" offset="0" context="_69" access="public" location="f0:3640" file="f0" line="3640"/>
  <Field id="_2036" name="pad0" type="_1478" offset="8" context="_69" access="public" location="f0:3641" file="f0" line="3641"/>
  <Field id="_2037" name="length" type="_1399" offset="16" context="_69" access="public" location="f0:3642" file="f0" line="3642"/>
  <Field id="_2038" name="cmap" type="_720" offset="32" context="_69" access="public" location="f0:3643" file="f0" line="3643"/>
  <Field id="_2039" name="name_len" type="_1399" offset="64" context="_69" access="public" location="f0:3644" file="f0" line="3644"/>
  <Field id="_2040" name="pad1" type="_5156" offset="80" context="_69" access="public" location="f0:3645" file="f0" line="3645"/>
  <Destructor id="_2041" name="xcb_lookup_color_request_t" artificial="1" throw="" context="_69" access="public" mangled="_ZN26xcb_lookup_color_request_tD1Ev *INTERNAL* " demangled="xcb_lookup_color_request_t::~xcb_lookup_color_request_t()" location="f0:3639" file="f0" line="3639" endline="3639" inline="1">
  </Destructor>
  <OperatorMethod id="_2042" name="=" returns="_5157" artificial="1" throw="" context="_69" access="public" mangled="_ZN26xcb_lookup_color_request_taSERKS_" demangled="xcb_lookup_color_request_t::operator=(xcb_lookup_color_request_t const&amp;)" location="f0:3639" file="f0" line="3639" endline="3639" inline="1">
    <Argument type="_5158" location="f0:3639" file="f0" line="3639"/>
  </OperatorMethod>
  <Constructor id="_2043" name="xcb_lookup_color_request_t" artificial="1" throw="" context="_69" access="public" mangled="_ZN26xcb_lookup_color_request_tC1ERKS_ *INTERNAL* " demangled="xcb_lookup_color_request_t::xcb_lookup_color_request_t(xcb_lookup_color_request_t const&amp;)" location="f0:3639" file="f0" line="3639" endline="3639" inline="1">
    <Argument type="_5158" location="f0:3639" file="f0" line="3639"/>
  </Constructor>
  <Constructor id="_2044" name="xcb_lookup_color_request_t" artificial="1" throw="" context="_69" access="public" mangled="_ZN26xcb_lookup_color_request_tC1Ev *INTERNAL* " demangled="xcb_lookup_color_request_t::xcb_lookup_color_request_t()" location="f0:3639" file="f0" line="3639" inline="1"/>
  <Field id="_2045" name="major_opcode" type="_1478" offset="0" context="_71" access="public" location="f0:1471" file="f0" line="1471"/>
  <Field id="_2046" name="mode" type="_1478" offset="8" context="_71" access="public" location="f0:1472" file="f0" line="1472"/>
  <Field id="_2047" name="length" type="_1399" offset="16" context="_71" access="public" location="f0:1473" file="f0" line="1473"/>
  <Field id="_2048" name="window" type="_680" offset="32" context="_71" access="public" location="f0:1474" file="f0" line="1474"/>
  <Destructor id="_2049" name="xcb_change_save_set_request_t" artificial="1" throw="" context="_71" access="public" mangled="_ZN29xcb_change_save_set_request_tD1Ev *INTERNAL* " demangled="xcb_change_save_set_request_t::~xcb_change_save_set_request_t()" location="f0:1470" file="f0" line="1470" endline="1470" inline="1">
  </Destructor>
  <OperatorMethod id="_2050" name="=" returns="_5159" artificial="1" throw="" context="_71" access="public" mangled="_ZN29xcb_change_save_set_request_taSERKS_" demangled="xcb_change_save_set_request_t::operator=(xcb_change_save_set_request_t const&amp;)" location="f0:1470" file="f0" line="1470" endline="1470" inline="1">
    <Argument type="_5160" location="f0:1470" file="f0" line="1470"/>
  </OperatorMethod>
  <Constructor id="_2051" name="xcb_change_save_set_request_t" artificial="1" throw="" context="_71" access="public" mangled="_ZN29xcb_change_save_set_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_save_set_request_t::xcb_change_save_set_request_t(xcb_change_save_set_request_t const&amp;)" location="f0:1470" file="f0" line="1470" endline="1470" inline="1">
    <Argument type="_5160" location="f0:1470" file="f0" line="1470"/>
  </Constructor>
  <Constructor id="_2052" name="xcb_change_save_set_request_t" artificial="1" throw="" context="_71" access="public" mangled="_ZN29xcb_change_save_set_request_tC1Ev *INTERNAL* " demangled="xcb_change_save_set_request_t::xcb_change_save_set_request_t()" location="f0:1470" file="f0" line="1470" inline="1"/>
  <PointerType id="_2053" type="_1478c" size="64" align="64"/>
  <Field id="_2054" name="response_type" type="_1478" offset="0" context="_75" access="public" location="f0:806" file="f0" line="806"/>
  <Field id="_2055" name="pad0" type="_1478" offset="8" context="_75" access="public" location="f0:807" file="f0" line="807"/>
  <Field id="_2056" name="sequence" type="_1399" offset="16" context="_75" access="public" location="f0:808" file="f0" line="808"/>
  <Field id="_2057" name="event" type="_680" offset="32" context="_75" access="public" location="f0:809" file="f0" line="809"/>
  <Field id="_2058" name="window" type="_680" offset="64" context="_75" access="public" location="f0:810" file="f0" line="810"/>
  <Field id="_2059" name="from_configure" type="_1478" offset="96" context="_75" access="public" location="f0:811" file="f0" line="811"/>
  <Field id="_2060" name="pad1" type="_5162" offset="104" context="_75" access="public" location="f0:812" file="f0" line="812"/>
  <Destructor id="_2061" name="xcb_unmap_notify_event_t" artificial="1" throw="" context="_75" access="public" mangled="_ZN24xcb_unmap_notify_event_tD1Ev *INTERNAL* " demangled="xcb_unmap_notify_event_t::~xcb_unmap_notify_event_t()" location="f0:805" file="f0" line="805" endline="805" inline="1">
  </Destructor>
  <OperatorMethod id="_2062" name="=" returns="_5163" artificial="1" throw="" context="_75" access="public" mangled="_ZN24xcb_unmap_notify_event_taSERKS_" demangled="xcb_unmap_notify_event_t::operator=(xcb_unmap_notify_event_t const&amp;)" location="f0:805" file="f0" line="805" endline="805" inline="1">
    <Argument type="_5164" location="f0:805" file="f0" line="805"/>
  </OperatorMethod>
  <Constructor id="_2063" name="xcb_unmap_notify_event_t" artificial="1" throw="" context="_75" access="public" mangled="_ZN24xcb_unmap_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_unmap_notify_event_t::xcb_unmap_notify_event_t(xcb_unmap_notify_event_t const&amp;)" location="f0:805" file="f0" line="805" endline="805" inline="1">
    <Argument type="_5164" location="f0:805" file="f0" line="805"/>
  </Constructor>
  <Constructor id="_2064" name="xcb_unmap_notify_event_t" artificial="1" throw="" context="_75" access="public" mangled="_ZN24xcb_unmap_notify_event_tC1Ev *INTERNAL* " demangled="xcb_unmap_notify_event_t::xcb_unmap_notify_event_t()" location="f0:805" file="f0" line="805" inline="1"/>
  <PointerType id="_2065" type="_699" size="64" align="64"/>
  <PointerType id="_2066" type="_1335c" size="64" align="64"/>
  <PointerType id="_2067" type="_528" size="64" align="64"/>
  <PointerType id="_2068" type="_1035" size="64" align="64"/>
  <PointerType id="_2069" type="_157" size="64" align="64"/>
  <Field id="_2070" name="response_type" type="_1478" offset="0" context="_86" access="public" location="f0:524" file="f0" line="524"/>
  <Field id="_2071" name="detail" type="_905" offset="8" context="_86" access="public" location="f0:525" file="f0" line="525"/>
  <Field id="_2072" name="sequence" type="_1399" offset="16" context="_86" access="public" location="f0:526" file="f0" line="526"/>
  <Field id="_2073" name="time" type="_1260" offset="32" context="_86" access="public" location="f0:527" file="f0" line="527"/>
  <Field id="_2074" name="root" type="_680" offset="64" context="_86" access="public" location="f0:528" file="f0" line="528"/>
  <Field id="_2075" name="event" type="_680" offset="96" context="_86" access="public" location="f0:529" file="f0" line="529"/>
  <Field id="_2076" name="child" type="_680" offset="128" context="_86" access="public" location="f0:530" file="f0" line="530"/>
  <Field id="_2077" name="root_x" type="_883" offset="160" context="_86" access="public" location="f0:531" file="f0" line="531"/>
  <Field id="_2078" name="root_y" type="_883" offset="176" context="_86" access="public" location="f0:532" file="f0" line="532"/>
  <Field id="_2079" name="event_x" type="_883" offset="192" context="_86" access="public" location="f0:533" file="f0" line="533"/>
  <Field id="_2080" name="event_y" type="_883" offset="208" context="_86" access="public" location="f0:534" file="f0" line="534"/>
  <Field id="_2081" name="state" type="_1399" offset="224" context="_86" access="public" location="f0:535" file="f0" line="535"/>
  <Field id="_2082" name="same_screen" type="_1478" offset="240" context="_86" access="public" location="f0:536" file="f0" line="536"/>
  <Field id="_2083" name="pad0" type="_1478" offset="248" context="_86" access="public" location="f0:537" file="f0" line="537"/>
  <Destructor id="_2084" name="xcb_key_press_event_t" artificial="1" throw="" context="_86" access="public" mangled="_ZN21xcb_key_press_event_tD1Ev *INTERNAL* " demangled="xcb_key_press_event_t::~xcb_key_press_event_t()" location="f0:523" file="f0" line="523" endline="523" inline="1">
  </Destructor>
  <OperatorMethod id="_2085" name="=" returns="_5166" artificial="1" throw="" context="_86" access="public" mangled="_ZN21xcb_key_press_event_taSERKS_" demangled="xcb_key_press_event_t::operator=(xcb_key_press_event_t const&amp;)" location="f0:523" file="f0" line="523" endline="523" inline="1">
    <Argument type="_5167" location="f0:523" file="f0" line="523"/>
  </OperatorMethod>
  <Constructor id="_2086" name="xcb_key_press_event_t" artificial="1" throw="" context="_86" access="public" mangled="_ZN21xcb_key_press_event_tC1ERKS_ *INTERNAL* " demangled="xcb_key_press_event_t::xcb_key_press_event_t(xcb_key_press_event_t const&amp;)" location="f0:523" file="f0" line="523" endline="523" inline="1">
    <Argument type="_5167" location="f0:523" file="f0" line="523"/>
  </Constructor>
  <Constructor id="_2087" name="xcb_key_press_event_t" artificial="1" throw="" context="_86" access="public" mangled="_ZN21xcb_key_press_event_tC1Ev *INTERNAL* " demangled="xcb_key_press_event_t::xcb_key_press_event_t()" location="f0:523" file="f0" line="523" inline="1"/>
  <Field id="_2088" name="response_type" type="_1478" offset="0" context="_88" access="public" location="f0:2081" file="f0" line="2081"/>
  <Field id="_2089" name="status" type="_1478" offset="8" context="_88" access="public" location="f0:2082" file="f0" line="2082"/>
  <Field id="_2090" name="sequence" type="_1399" offset="16" context="_88" access="public" location="f0:2083" file="f0" line="2083"/>
  <Field id="_2091" name="length" type="_699" offset="32" context="_88" access="public" location="f0:2084" file="f0" line="2084"/>
  <Destructor id="_2092" name="xcb_grab_keyboard_reply_t" artificial="1" throw="" context="_88" access="public" mangled="_ZN25xcb_grab_keyboard_reply_tD1Ev *INTERNAL* " demangled="xcb_grab_keyboard_reply_t::~xcb_grab_keyboard_reply_t()" location="f0:2080" file="f0" line="2080" endline="2080" inline="1">
  </Destructor>
  <OperatorMethod id="_2093" name="=" returns="_5168" artificial="1" throw="" context="_88" access="public" mangled="_ZN25xcb_grab_keyboard_reply_taSERKS_" demangled="xcb_grab_keyboard_reply_t::operator=(xcb_grab_keyboard_reply_t const&amp;)" location="f0:2080" file="f0" line="2080" endline="2080" inline="1">
    <Argument type="_5169" location="f0:2080" file="f0" line="2080"/>
  </OperatorMethod>
  <Constructor id="_2094" name="xcb_grab_keyboard_reply_t" artificial="1" throw="" context="_88" access="public" mangled="_ZN25xcb_grab_keyboard_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_grab_keyboard_reply_t::xcb_grab_keyboard_reply_t(xcb_grab_keyboard_reply_t const&amp;)" location="f0:2080" file="f0" line="2080" endline="2080" inline="1">
    <Argument type="_5169" location="f0:2080" file="f0" line="2080"/>
  </Constructor>
  <Constructor id="_2095" name="xcb_grab_keyboard_reply_t" artificial="1" throw="" context="_88" access="public" mangled="_ZN25xcb_grab_keyboard_reply_tC1Ev *INTERNAL* " demangled="xcb_grab_keyboard_reply_t::xcb_grab_keyboard_reply_t()" location="f0:2080" file="f0" line="2080" inline="1"/>
  <PointerType id="_2096" type="_689c" size="64" align="64"/>
  <Field id="_2097" name="sequence" type="_151" offset="0" context="_92" access="public" location="f0:2678" file="f0" line="2678"/>
  <Destructor id="_2098" name="xcb_get_font_path_cookie_t" artificial="1" throw="" context="_92" access="public" mangled="_ZN26xcb_get_font_path_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_font_path_cookie_t::~xcb_get_font_path_cookie_t()" location="f0:2677" file="f0" line="2677" endline="2677" inline="1">
  </Destructor>
  <OperatorMethod id="_2099" name="=" returns="_5171" artificial="1" throw="" context="_92" access="public" mangled="_ZN26xcb_get_font_path_cookie_taSERKS_" demangled="xcb_get_font_path_cookie_t::operator=(xcb_get_font_path_cookie_t const&amp;)" location="f0:2677" file="f0" line="2677" endline="2677" inline="1">
    <Argument type="_5172" location="f0:2677" file="f0" line="2677"/>
  </OperatorMethod>
  <Constructor id="_2100" name="xcb_get_font_path_cookie_t" artificial="1" throw="" context="_92" access="public" mangled="_ZN26xcb_get_font_path_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_font_path_cookie_t::xcb_get_font_path_cookie_t(xcb_get_font_path_cookie_t const&amp;)" location="f0:2677" file="f0" line="2677" endline="2677" inline="1">
    <Argument type="_5172" location="f0:2677" file="f0" line="2677"/>
  </Constructor>
  <Constructor id="_2101" name="xcb_get_font_path_cookie_t" artificial="1" throw="" context="_92" access="public" mangled="_ZN26xcb_get_font_path_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_font_path_cookie_t::xcb_get_font_path_cookie_t()" location="f0:2677" file="f0" line="2677" inline="1"/>
  <PointerType id="_2102" type="_1885" size="64" align="64"/>
  <Field id="_2103" name="response_type" type="_1478" offset="0" context="_97" access="public" location="f0:2697" file="f0" line="2697"/>
  <Field id="_2104" name="pad0" type="_1478" offset="8" context="_97" access="public" location="f0:2698" file="f0" line="2698"/>
  <Field id="_2105" name="sequence" type="_1399" offset="16" context="_97" access="public" location="f0:2699" file="f0" line="2699"/>
  <Field id="_2106" name="length" type="_699" offset="32" context="_97" access="public" location="f0:2700" file="f0" line="2700"/>
  <Field id="_2107" name="path_len" type="_1399" offset="64" context="_97" access="public" location="f0:2701" file="f0" line="2701"/>
  <Field id="_2108" name="pad1" type="_5173" offset="80" context="_97" access="public" location="f0:2702" file="f0" line="2702"/>
  <Destructor id="_2109" name="xcb_get_font_path_reply_t" artificial="1" throw="" context="_97" access="public" mangled="_ZN25xcb_get_font_path_reply_tD1Ev *INTERNAL* " demangled="xcb_get_font_path_reply_t::~xcb_get_font_path_reply_t()" location="f0:2696" file="f0" line="2696" endline="2696" inline="1">
  </Destructor>
  <OperatorMethod id="_2110" name="=" returns="_5174" artificial="1" throw="" context="_97" access="public" mangled="_ZN25xcb_get_font_path_reply_taSERKS_" demangled="xcb_get_font_path_reply_t::operator=(xcb_get_font_path_reply_t const&amp;)" location="f0:2696" file="f0" line="2696" endline="2696" inline="1">
    <Argument type="_5175" location="f0:2696" file="f0" line="2696"/>
  </OperatorMethod>
  <Constructor id="_2111" name="xcb_get_font_path_reply_t" artificial="1" throw="" context="_97" access="public" mangled="_ZN25xcb_get_font_path_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_font_path_reply_t::xcb_get_font_path_reply_t(xcb_get_font_path_reply_t const&amp;)" location="f0:2696" file="f0" line="2696" endline="2696" inline="1">
    <Argument type="_5175" location="f0:2696" file="f0" line="2696"/>
  </Constructor>
  <Constructor id="_2112" name="xcb_get_font_path_reply_t" artificial="1" throw="" context="_97" access="public" mangled="_ZN25xcb_get_font_path_reply_tC1Ev *INTERNAL* " demangled="xcb_get_font_path_reply_t::xcb_get_font_path_reply_t()" location="f0:2696" file="f0" line="2696" inline="1"/>
  <Field id="_2113" name="major_opcode" type="_1478" offset="0" context="_101" access="public" location="f0:2959" file="f0" line="2959"/>
  <Field id="_2114" name="pad0" type="_1478" offset="8" context="_101" access="public" location="f0:2960" file="f0" line="2960"/>
  <Field id="_2115" name="length" type="_1399" offset="16" context="_101" access="public" location="f0:2961" file="f0" line="2961"/>
  <Field id="_2116" name="src_drawable" type="_878" offset="32" context="_101" access="public" location="f0:2962" file="f0" line="2962"/>
  <Field id="_2117" name="dst_drawable" type="_878" offset="64" context="_101" access="public" location="f0:2963" file="f0" line="2963"/>
  <Field id="_2118" name="gc" type="_1792" offset="96" context="_101" access="public" location="f0:2964" file="f0" line="2964"/>
  <Field id="_2119" name="src_x" type="_883" offset="128" context="_101" access="public" location="f0:2965" file="f0" line="2965"/>
  <Field id="_2120" name="src_y" type="_883" offset="144" context="_101" access="public" location="f0:2966" file="f0" line="2966"/>
  <Field id="_2121" name="dst_x" type="_883" offset="160" context="_101" access="public" location="f0:2967" file="f0" line="2967"/>
  <Field id="_2122" name="dst_y" type="_883" offset="176" context="_101" access="public" location="f0:2968" file="f0" line="2968"/>
  <Field id="_2123" name="width" type="_1399" offset="192" context="_101" access="public" location="f0:2969" file="f0" line="2969"/>
  <Field id="_2124" name="height" type="_1399" offset="208" context="_101" access="public" location="f0:2970" file="f0" line="2970"/>
  <Field id="_2125" name="bit_plane" type="_699" offset="224" context="_101" access="public" location="f0:2971" file="f0" line="2971"/>
  <Destructor id="_2126" name="xcb_copy_plane_request_t" artificial="1" throw="" context="_101" access="public" mangled="_ZN24xcb_copy_plane_request_tD1Ev *INTERNAL* " demangled="xcb_copy_plane_request_t::~xcb_copy_plane_request_t()" location="f0:2958" file="f0" line="2958" endline="2958" inline="1">
  </Destructor>
  <OperatorMethod id="_2127" name="=" returns="_5176" artificial="1" throw="" context="_101" access="public" mangled="_ZN24xcb_copy_plane_request_taSERKS_" demangled="xcb_copy_plane_request_t::operator=(xcb_copy_plane_request_t const&amp;)" location="f0:2958" file="f0" line="2958" endline="2958" inline="1">
    <Argument type="_5177" location="f0:2958" file="f0" line="2958"/>
  </OperatorMethod>
  <Constructor id="_2128" name="xcb_copy_plane_request_t" artificial="1" throw="" context="_101" access="public" mangled="_ZN24xcb_copy_plane_request_tC1ERKS_ *INTERNAL* " demangled="xcb_copy_plane_request_t::xcb_copy_plane_request_t(xcb_copy_plane_request_t const&amp;)" location="f0:2958" file="f0" line="2958" endline="2958" inline="1">
    <Argument type="_5177" location="f0:2958" file="f0" line="2958"/>
  </Constructor>
  <Constructor id="_2129" name="xcb_copy_plane_request_t" artificial="1" throw="" context="_101" access="public" mangled="_ZN24xcb_copy_plane_request_tC1Ev *INTERNAL* " demangled="xcb_copy_plane_request_t::xcb_copy_plane_request_t()" location="f0:2958" file="f0" line="2958" inline="1"/>
  <Field id="_2130" name="major_opcode" type="_1478" offset="0" context="_104" access="public" location="f0:2921" file="f0" line="2921"/>
  <Field id="_2131" name="exposures" type="_1478" offset="8" context="_104" access="public" location="f0:2922" file="f0" line="2922"/>
  <Field id="_2132" name="length" type="_1399" offset="16" context="_104" access="public" location="f0:2923" file="f0" line="2923"/>
  <Field id="_2133" name="window" type="_680" offset="32" context="_104" access="public" location="f0:2924" file="f0" line="2924"/>
  <Field id="_2134" name="x" type="_883" offset="64" context="_104" access="public" location="f0:2925" file="f0" line="2925"/>
  <Field id="_2135" name="y" type="_883" offset="80" context="_104" access="public" location="f0:2926" file="f0" line="2926"/>
  <Field id="_2136" name="width" type="_1399" offset="96" context="_104" access="public" location="f0:2927" file="f0" line="2927"/>
  <Field id="_2137" name="height" type="_1399" offset="112" context="_104" access="public" location="f0:2928" file="f0" line="2928"/>
  <Destructor id="_2138" name="xcb_clear_area_request_t" artificial="1" throw="" context="_104" access="public" mangled="_ZN24xcb_clear_area_request_tD1Ev *INTERNAL* " demangled="xcb_clear_area_request_t::~xcb_clear_area_request_t()" location="f0:2920" file="f0" line="2920" endline="2920" inline="1">
  </Destructor>
  <OperatorMethod id="_2139" name="=" returns="_5178" artificial="1" throw="" context="_104" access="public" mangled="_ZN24xcb_clear_area_request_taSERKS_" demangled="xcb_clear_area_request_t::operator=(xcb_clear_area_request_t const&amp;)" location="f0:2920" file="f0" line="2920" endline="2920" inline="1">
    <Argument type="_5179" location="f0:2920" file="f0" line="2920"/>
  </OperatorMethod>
  <Constructor id="_2140" name="xcb_clear_area_request_t" artificial="1" throw="" context="_104" access="public" mangled="_ZN24xcb_clear_area_request_tC1ERKS_ *INTERNAL* " demangled="xcb_clear_area_request_t::xcb_clear_area_request_t(xcb_clear_area_request_t const&amp;)" location="f0:2920" file="f0" line="2920" endline="2920" inline="1">
    <Argument type="_5179" location="f0:2920" file="f0" line="2920"/>
  </Constructor>
  <Constructor id="_2141" name="xcb_clear_area_request_t" artificial="1" throw="" context="_104" access="public" mangled="_ZN24xcb_clear_area_request_tC1Ev *INTERNAL* " demangled="xcb_clear_area_request_t::xcb_clear_area_request_t()" location="f0:2920" file="f0" line="2920" inline="1"/>
  <Field id="_2142" name="major_opcode" type="_1478" offset="0" context="_110" access="public" location="f0:3675" file="f0" line="3675"/>
  <Field id="_2143" name="pad0" type="_1478" offset="8" context="_110" access="public" location="f0:3676" file="f0" line="3676"/>
  <Field id="_2144" name="length" type="_1399" offset="16" context="_110" access="public" location="f0:3677" file="f0" line="3677"/>
  <Field id="_2145" name="cid" type="_1059" offset="32" context="_110" access="public" location="f0:3678" file="f0" line="3678"/>
  <Field id="_2146" name="source" type="_1761" offset="64" context="_110" access="public" location="f0:3679" file="f0" line="3679"/>
  <Field id="_2147" name="mask" type="_1761" offset="96" context="_110" access="public" location="f0:3680" file="f0" line="3680"/>
  <Field id="_2148" name="fore_red" type="_1399" offset="128" context="_110" access="public" location="f0:3681" file="f0" line="3681"/>
  <Field id="_2149" name="fore_green" type="_1399" offset="144" context="_110" access="public" location="f0:3682" file="f0" line="3682"/>
  <Field id="_2150" name="fore_blue" type="_1399" offset="160" context="_110" access="public" location="f0:3683" file="f0" line="3683"/>
  <Field id="_2151" name="back_red" type="_1399" offset="176" context="_110" access="public" location="f0:3684" file="f0" line="3684"/>
  <Field id="_2152" name="back_green" type="_1399" offset="192" context="_110" access="public" location="f0:3685" file="f0" line="3685"/>
  <Field id="_2153" name="back_blue" type="_1399" offset="208" context="_110" access="public" location="f0:3686" file="f0" line="3686"/>
  <Field id="_2154" name="x" type="_1399" offset="224" context="_110" access="public" location="f0:3687" file="f0" line="3687"/>
  <Field id="_2155" name="y" type="_1399" offset="240" context="_110" access="public" location="f0:3688" file="f0" line="3688"/>
  <Destructor id="_2156" name="xcb_create_cursor_request_t" artificial="1" throw="" context="_110" access="public" mangled="_ZN27xcb_create_cursor_request_tD1Ev *INTERNAL* " demangled="xcb_create_cursor_request_t::~xcb_create_cursor_request_t()" location="f0:3674" file="f0" line="3674" endline="3674" inline="1">
  </Destructor>
  <OperatorMethod id="_2157" name="=" returns="_5180" artificial="1" throw="" context="_110" access="public" mangled="_ZN27xcb_create_cursor_request_taSERKS_" demangled="xcb_create_cursor_request_t::operator=(xcb_create_cursor_request_t const&amp;)" location="f0:3674" file="f0" line="3674" endline="3674" inline="1">
    <Argument type="_5181" location="f0:3674" file="f0" line="3674"/>
  </OperatorMethod>
  <Constructor id="_2158" name="xcb_create_cursor_request_t" artificial="1" throw="" context="_110" access="public" mangled="_ZN27xcb_create_cursor_request_tC1ERKS_ *INTERNAL* " demangled="xcb_create_cursor_request_t::xcb_create_cursor_request_t(xcb_create_cursor_request_t const&amp;)" location="f0:3674" file="f0" line="3674" endline="3674" inline="1">
    <Argument type="_5181" location="f0:3674" file="f0" line="3674"/>
  </Constructor>
  <Constructor id="_2159" name="xcb_create_cursor_request_t" artificial="1" throw="" context="_110" access="public" mangled="_ZN27xcb_create_cursor_request_tC1Ev *INTERNAL* " demangled="xcb_create_cursor_request_t::xcb_create_cursor_request_t()" location="f0:3674" file="f0" line="3674" inline="1"/>
  <PointerType id="_2160" type="_1816" size="64" align="64"/>
  <Field id="_2161" name="response_type" type="_1478" offset="0" context="_118" access="public" location="f0:1086" file="f0" line="1086"/>
  <Field id="_2162" name="pad0" type="_1478" offset="8" context="_118" access="public" location="f0:1087" file="f0" line="1087"/>
  <Field id="_2163" name="sequence" type="_1399" offset="16" context="_118" access="public" location="f0:1088" file="f0" line="1088"/>
  <Field id="_2164" name="time" type="_1260" offset="32" context="_118" access="public" location="f0:1089" file="f0" line="1089"/>
  <Field id="_2165" name="owner" type="_680" offset="64" context="_118" access="public" location="f0:1090" file="f0" line="1090"/>
  <Field id="_2166" name="requestor" type="_680" offset="96" context="_118" access="public" location="f0:1091" file="f0" line="1091"/>
  <Field id="_2167" name="selection" type="_1679" offset="128" context="_118" access="public" location="f0:1092" file="f0" line="1092"/>
  <Field id="_2168" name="target" type="_1679" offset="160" context="_118" access="public" location="f0:1093" file="f0" line="1093"/>
  <Field id="_2169" name="property" type="_1679" offset="192" context="_118" access="public" location="f0:1094" file="f0" line="1094"/>
  <Destructor id="_2170" name="xcb_selection_request_event_t" artificial="1" throw="" context="_118" access="public" mangled="_ZN29xcb_selection_request_event_tD1Ev *INTERNAL* " demangled="xcb_selection_request_event_t::~xcb_selection_request_event_t()" location="f0:1085" file="f0" line="1085" endline="1085" inline="1">
  </Destructor>
  <OperatorMethod id="_2171" name="=" returns="_5182" artificial="1" throw="" context="_118" access="public" mangled="_ZN29xcb_selection_request_event_taSERKS_" demangled="xcb_selection_request_event_t::operator=(xcb_selection_request_event_t const&amp;)" location="f0:1085" file="f0" line="1085" endline="1085" inline="1">
    <Argument type="_5183" location="f0:1085" file="f0" line="1085"/>
  </OperatorMethod>
  <Constructor id="_2172" name="xcb_selection_request_event_t" artificial="1" throw="" context="_118" access="public" mangled="_ZN29xcb_selection_request_event_tC1ERKS_ *INTERNAL* " demangled="xcb_selection_request_event_t::xcb_selection_request_event_t(xcb_selection_request_event_t const&amp;)" location="f0:1085" file="f0" line="1085" endline="1085" inline="1">
    <Argument type="_5183" location="f0:1085" file="f0" line="1085"/>
  </Constructor>
  <Constructor id="_2173" name="xcb_selection_request_event_t" artificial="1" throw="" context="_118" access="public" mangled="_ZN29xcb_selection_request_event_tC1Ev *INTERNAL* " demangled="xcb_selection_request_event_t::xcb_selection_request_event_t()" location="f0:1085" file="f0" line="1085" inline="1"/>
  <PointerType id="_2174" type="_564c" size="64" align="64"/>
  <Field id="_2175" name="major_opcode" type="_1478" offset="0" context="_123" access="public" location="f0:2728" file="f0" line="2728"/>
  <Field id="_2176" name="pad0" type="_1478" offset="8" context="_123" access="public" location="f0:2729" file="f0" line="2729"/>
  <Field id="_2177" name="length" type="_1399" offset="16" context="_123" access="public" location="f0:2730" file="f0" line="2730"/>
  <Field id="_2178" name="pixmap" type="_1761" offset="32" context="_123" access="public" location="f0:2731" file="f0" line="2731"/>
  <Destructor id="_2179" name="xcb_free_pixmap_request_t" artificial="1" throw="" context="_123" access="public" mangled="_ZN25xcb_free_pixmap_request_tD1Ev *INTERNAL* " demangled="xcb_free_pixmap_request_t::~xcb_free_pixmap_request_t()" location="f0:2727" file="f0" line="2727" endline="2727" inline="1">
  </Destructor>
  <OperatorMethod id="_2180" name="=" returns="_5185" artificial="1" throw="" context="_123" access="public" mangled="_ZN25xcb_free_pixmap_request_taSERKS_" demangled="xcb_free_pixmap_request_t::operator=(xcb_free_pixmap_request_t const&amp;)" location="f0:2727" file="f0" line="2727" endline="2727" inline="1">
    <Argument type="_5186" location="f0:2727" file="f0" line="2727"/>
  </OperatorMethod>
  <Constructor id="_2181" name="xcb_free_pixmap_request_t" artificial="1" throw="" context="_123" access="public" mangled="_ZN25xcb_free_pixmap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_free_pixmap_request_t::xcb_free_pixmap_request_t(xcb_free_pixmap_request_t const&amp;)" location="f0:2727" file="f0" line="2727" endline="2727" inline="1">
    <Argument type="_5186" location="f0:2727" file="f0" line="2727"/>
  </Constructor>
  <Constructor id="_2182" name="xcb_free_pixmap_request_t" artificial="1" throw="" context="_123" access="public" mangled="_ZN25xcb_free_pixmap_request_tC1Ev *INTERNAL* " demangled="xcb_free_pixmap_request_t::xcb_free_pixmap_request_t()" location="f0:2727" file="f0" line="2727" inline="1"/>
  <Field id="_2183" name="response_type" type="_1478" offset="0" context="_126" access="public" location="f0:822" file="f0" line="822"/>
  <Field id="_2184" name="pad0" type="_1478" offset="8" context="_126" access="public" location="f0:823" file="f0" line="823"/>
  <Field id="_2185" name="sequence" type="_1399" offset="16" context="_126" access="public" location="f0:824" file="f0" line="824"/>
  <Field id="_2186" name="event" type="_680" offset="32" context="_126" access="public" location="f0:825" file="f0" line="825"/>
  <Field id="_2187" name="window" type="_680" offset="64" context="_126" access="public" location="f0:826" file="f0" line="826"/>
  <Field id="_2188" name="override_redirect" type="_1478" offset="96" context="_126" access="public" location="f0:827" file="f0" line="827"/>
  <Field id="_2189" name="pad1" type="_5162" offset="104" context="_126" access="public" location="f0:828" file="f0" line="828"/>
  <Destructor id="_2190" name="xcb_map_notify_event_t" artificial="1" throw="" context="_126" access="public" mangled="_ZN22xcb_map_notify_event_tD1Ev *INTERNAL* " demangled="xcb_map_notify_event_t::~xcb_map_notify_event_t()" location="f0:821" file="f0" line="821" endline="821" inline="1">
  </Destructor>
  <OperatorMethod id="_2191" name="=" returns="_5187" artificial="1" throw="" context="_126" access="public" mangled="_ZN22xcb_map_notify_event_taSERKS_" demangled="xcb_map_notify_event_t::operator=(xcb_map_notify_event_t const&amp;)" location="f0:821" file="f0" line="821" endline="821" inline="1">
    <Argument type="_5188" location="f0:821" file="f0" line="821"/>
  </OperatorMethod>
  <Constructor id="_2192" name="xcb_map_notify_event_t" artificial="1" throw="" context="_126" access="public" mangled="_ZN22xcb_map_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_map_notify_event_t::xcb_map_notify_event_t(xcb_map_notify_event_t const&amp;)" location="f0:821" file="f0" line="821" endline="821" inline="1">
    <Argument type="_5188" location="f0:821" file="f0" line="821"/>
  </Constructor>
  <Constructor id="_2193" name="xcb_map_notify_event_t" artificial="1" throw="" context="_126" access="public" mangled="_ZN22xcb_map_notify_event_tC1Ev *INTERNAL* " demangled="xcb_map_notify_event_t::xcb_map_notify_event_t()" location="f0:821" file="f0" line="821" inline="1"/>
  <Field id="_2194" name="__val" type="_5189" offset="0" context="_128" access="public" location="f11:31" file="f11" line="31"/>
  <Destructor id="_2195" name="._1" artificial="1" throw="" context="_128" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f11:32" file="f11" line="32" endline="32" inline="1">
  </Destructor>
  <OperatorMethod id="_2196" name="=" returns="_5190" artificial="1" throw="" context="_128" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f11:32" file="f11" line="32" endline="32" inline="1">
    <Argument type="_5191" location="f11:30" file="f11" line="30"/>
  </OperatorMethod>
  <Constructor id="_2197" name="._1" artificial="1" throw="" context="_128" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f11:32" file="f11" line="32" endline="32" inline="1">
    <Argument type="_5191" location="f11:30" file="f11" line="30"/>
  </Constructor>
  <Constructor id="_2198" name="._1" artificial="1" throw="" context="_128" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f11:32" file="f11" line="32" inline="1"/>
  <PointerType id="_2199" type="_1041" size="64" align="64"/>
  <PointerType id="_2200" type="_4026" size="64" align="64"/>
  <Field id="_2201" name="response_type" type="_1478" offset="0" context="_139" access="public" location="f0:1218" file="f0" line="1218"/>
  <Field id="_2202" name="error_code" type="_1478" offset="8" context="_139" access="public" location="f0:1219" file="f0" line="1219"/>
  <Field id="_2203" name="sequence" type="_1399" offset="16" context="_139" access="public" location="f0:1220" file="f0" line="1220"/>
  <Field id="_2204" name="bad_value" type="_699" offset="32" context="_139" access="public" location="f0:1221" file="f0" line="1221"/>
  <Field id="_2205" name="minor_opcode" type="_1399" offset="64" context="_139" access="public" location="f0:1222" file="f0" line="1222"/>
  <Field id="_2206" name="major_opcode" type="_1478" offset="80" context="_139" access="public" location="f0:1223" file="f0" line="1223"/>
  <Field id="_2207" name="pad0" type="_1478" offset="88" context="_139" access="public" location="f0:1224" file="f0" line="1224"/>
  <Destructor id="_2208" name="xcb_value_error_t" artificial="1" throw="" context="_139" access="public" mangled="_ZN17xcb_value_error_tD1Ev *INTERNAL* " demangled="xcb_value_error_t::~xcb_value_error_t()" location="f0:1217" file="f0" line="1217" endline="1217" inline="1">
  </Destructor>
  <OperatorMethod id="_2209" name="=" returns="_5192" artificial="1" throw="" context="_139" access="public" mangled="_ZN17xcb_value_error_taSERKS_" demangled="xcb_value_error_t::operator=(xcb_value_error_t const&amp;)" location="f0:1217" file="f0" line="1217" endline="1217" inline="1">
    <Argument type="_5193" location="f0:1217" file="f0" line="1217"/>
  </OperatorMethod>
  <Constructor id="_2210" name="xcb_value_error_t" artificial="1" throw="" context="_139" access="public" mangled="_ZN17xcb_value_error_tC1ERKS_ *INTERNAL* " demangled="xcb_value_error_t::xcb_value_error_t(xcb_value_error_t const&amp;)" location="f0:1217" file="f0" line="1217" endline="1217" inline="1">
    <Argument type="_5193" location="f0:1217" file="f0" line="1217"/>
  </Constructor>
  <Constructor id="_2211" name="xcb_value_error_t" artificial="1" throw="" context="_139" access="public" mangled="_ZN17xcb_value_error_tC1Ev *INTERNAL* " demangled="xcb_value_error_t::xcb_value_error_t()" location="f0:1217" file="f0" line="1217" inline="1"/>
  <Field id="_2212" name="major_opcode" type="_1478" offset="0" context="_141" access="public" location="f0:3931" file="f0" line="3931"/>
  <Field id="_2213" name="pad0" type="_1478" offset="8" context="_141" access="public" location="f0:3932" file="f0" line="3932"/>
  <Field id="_2214" name="length" type="_1399" offset="16" context="_141" access="public" location="f0:3933" file="f0" line="3933"/>
  <Field id="_2215" name="value_mask" type="_699" offset="32" context="_141" access="public" location="f0:3934" file="f0" line="3934"/>
  <Destructor id="_2216" name="xcb_change_keyboard_control_request_t" artificial="1" throw="" context="_141" access="public" mangled="_ZN37xcb_change_keyboard_control_request_tD1Ev *INTERNAL* " demangled="xcb_change_keyboard_control_request_t::~xcb_change_keyboard_control_request_t()" location="f0:3930" file="f0" line="3930" endline="3930" inline="1">
  </Destructor>
  <OperatorMethod id="_2217" name="=" returns="_5194" artificial="1" throw="" context="_141" access="public" mangled="_ZN37xcb_change_keyboard_control_request_taSERKS_" demangled="xcb_change_keyboard_control_request_t::operator=(xcb_change_keyboard_control_request_t const&amp;)" location="f0:3930" file="f0" line="3930" endline="3930" inline="1">
    <Argument type="_5195" location="f0:3930" file="f0" line="3930"/>
  </OperatorMethod>
  <Constructor id="_2218" name="xcb_change_keyboard_control_request_t" artificial="1" throw="" context="_141" access="public" mangled="_ZN37xcb_change_keyboard_control_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_keyboard_control_request_t::xcb_change_keyboard_control_request_t(xcb_change_keyboard_control_request_t const&amp;)" location="f0:3930" file="f0" line="3930" endline="3930" inline="1">
    <Argument type="_5195" location="f0:3930" file="f0" line="3930"/>
  </Constructor>
  <Constructor id="_2219" name="xcb_change_keyboard_control_request_t" artificial="1" throw="" context="_141" access="public" mangled="_ZN37xcb_change_keyboard_control_request_tC1Ev *INTERNAL* " demangled="xcb_change_keyboard_control_request_t::xcb_change_keyboard_control_request_t()" location="f0:3930" file="f0" line="3930" inline="1"/>
  <FundamentalType id="_2220" name="complex double" size="128" align="64"/>
  <PointerType id="_2221" type="_465" size="64" align="64"/>
  <Field id="_2222" name="data" type="_5196" offset="0" context="_156" access="public" location="f0:2576" file="f0" line="2576"/>
  <Field id="_2223" name="rem" type="_184" offset="64" context="_156" access="public" location="f0:2577" file="f0" line="2577"/>
  <Field id="_2224" name="index" type="_184" offset="96" context="_156" access="public" location="f0:2578" file="f0" line="2578"/>
  <Destructor id="_2225" name="xcb_str_iterator_t" artificial="1" throw="" context="_156" access="public" mangled="_ZN18xcb_str_iterator_tD1Ev *INTERNAL* " demangled="xcb_str_iterator_t::~xcb_str_iterator_t()" location="f0:2575" file="f0" line="2575" endline="2575" inline="1">
  </Destructor>
  <OperatorMethod id="_2226" name="=" returns="_5197" artificial="1" throw="" context="_156" access="public" mangled="_ZN18xcb_str_iterator_taSERKS_" demangled="xcb_str_iterator_t::operator=(xcb_str_iterator_t const&amp;)" location="f0:2575" file="f0" line="2575" endline="2575" inline="1">
    <Argument type="_5198" location="f0:2575" file="f0" line="2575"/>
  </OperatorMethod>
  <Constructor id="_2227" name="xcb_str_iterator_t" artificial="1" throw="" context="_156" access="public" mangled="_ZN18xcb_str_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_str_iterator_t::xcb_str_iterator_t(xcb_str_iterator_t const&amp;)" location="f0:2575" file="f0" line="2575" endline="2575" inline="1">
    <Argument type="_5198" location="f0:2575" file="f0" line="2575"/>
  </Constructor>
  <Constructor id="_2228" name="xcb_str_iterator_t" artificial="1" throw="" context="_156" access="public" mangled="_ZN18xcb_str_iterator_tC1Ev *INTERNAL* " demangled="xcb_str_iterator_t::xcb_str_iterator_t()" location="f0:2575" file="f0" line="2575" inline="1"/>
  <PointerType id="_2229" type="_339c" size="64" align="64"/>
  <PointerType id="_2230" type="_1679c" size="64" align="64"/>
  <Field id="_2231" name="major_opcode" type="_1478" offset="0" context="_161" access="public" location="f0:2842" file="f0" line="2842"/>
  <Field id="_2232" name="pad0" type="_1478" offset="8" context="_161" access="public" location="f0:2843" file="f0" line="2843"/>
  <Field id="_2233" name="length" type="_1399" offset="16" context="_161" access="public" location="f0:2844" file="f0" line="2844"/>
  <Field id="_2234" name="gc" type="_1792" offset="32" context="_161" access="public" location="f0:2845" file="f0" line="2845"/>
  <Field id="_2235" name="value_mask" type="_699" offset="64" context="_161" access="public" location="f0:2846" file="f0" line="2846"/>
  <Destructor id="_2236" name="xcb_change_gc_request_t" artificial="1" throw="" context="_161" access="public" mangled="_ZN23xcb_change_gc_request_tD1Ev *INTERNAL* " demangled="xcb_change_gc_request_t::~xcb_change_gc_request_t()" location="f0:2841" file="f0" line="2841" endline="2841" inline="1">
  </Destructor>
  <OperatorMethod id="_2237" name="=" returns="_5201" artificial="1" throw="" context="_161" access="public" mangled="_ZN23xcb_change_gc_request_taSERKS_" demangled="xcb_change_gc_request_t::operator=(xcb_change_gc_request_t const&amp;)" location="f0:2841" file="f0" line="2841" endline="2841" inline="1">
    <Argument type="_5202" location="f0:2841" file="f0" line="2841"/>
  </OperatorMethod>
  <Constructor id="_2238" name="xcb_change_gc_request_t" artificial="1" throw="" context="_161" access="public" mangled="_ZN23xcb_change_gc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_gc_request_t::xcb_change_gc_request_t(xcb_change_gc_request_t const&amp;)" location="f0:2841" file="f0" line="2841" endline="2841" inline="1">
    <Argument type="_5202" location="f0:2841" file="f0" line="2841"/>
  </Constructor>
  <Constructor id="_2239" name="xcb_change_gc_request_t" artificial="1" throw="" context="_161" access="public" mangled="_ZN23xcb_change_gc_request_tC1Ev *INTERNAL* " demangled="xcb_change_gc_request_t::xcb_change_gc_request_t()" location="f0:2841" file="f0" line="2841" inline="1"/>
  <PointerType id="_2240" type="_680" size="64" align="64"/>
  <PointerType id="_2241" type="_339" size="64" align="64"/>
  <PointerType id="_2242" type="_364" size="64" align="64"/>
  <PointerType id="_2243" type="_1313c" size="64" align="64"/>
  <Field id="_2244" name="sequence" type="_151" offset="0" context="_172" access="public" location="f0:2386" file="f0" line="2386"/>
  <Destructor id="_2245" name="xcb_query_keymap_cookie_t" artificial="1" throw="" context="_172" access="public" mangled="_ZN25xcb_query_keymap_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_keymap_cookie_t::~xcb_query_keymap_cookie_t()" location="f0:2385" file="f0" line="2385" endline="2385" inline="1">
  </Destructor>
  <OperatorMethod id="_2246" name="=" returns="_5204" artificial="1" throw="" context="_172" access="public" mangled="_ZN25xcb_query_keymap_cookie_taSERKS_" demangled="xcb_query_keymap_cookie_t::operator=(xcb_query_keymap_cookie_t const&amp;)" location="f0:2385" file="f0" line="2385" endline="2385" inline="1">
    <Argument type="_5205" location="f0:2385" file="f0" line="2385"/>
  </OperatorMethod>
  <Constructor id="_2247" name="xcb_query_keymap_cookie_t" artificial="1" throw="" context="_172" access="public" mangled="_ZN25xcb_query_keymap_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_keymap_cookie_t::xcb_query_keymap_cookie_t(xcb_query_keymap_cookie_t const&amp;)" location="f0:2385" file="f0" line="2385" endline="2385" inline="1">
    <Argument type="_5205" location="f0:2385" file="f0" line="2385"/>
  </Constructor>
  <Constructor id="_2248" name="xcb_query_keymap_cookie_t" artificial="1" throw="" context="_172" access="public" mangled="_ZN25xcb_query_keymap_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_keymap_cookie_t::xcb_query_keymap_cookie_t()" location="f0:2385" file="f0" line="2385" inline="1"/>
  <PointerType id="_2249" type="_725" size="64" align="64"/>
  <Field id="_2250" name="response_type" type="_1478" offset="0" context="_175" access="public" location="f0:713" file="f0" line="713"/>
  <Field id="_2251" name="pad0" type="_1478" offset="8" context="_175" access="public" location="f0:714" file="f0" line="714"/>
  <Field id="_2252" name="sequence" type="_1399" offset="16" context="_175" access="public" location="f0:715" file="f0" line="715"/>
  <Field id="_2253" name="drawable" type="_878" offset="32" context="_175" access="public" location="f0:716" file="f0" line="716"/>
  <Field id="_2254" name="x" type="_1399" offset="64" context="_175" access="public" location="f0:717" file="f0" line="717"/>
  <Field id="_2255" name="y" type="_1399" offset="80" context="_175" access="public" location="f0:718" file="f0" line="718"/>
  <Field id="_2256" name="width" type="_1399" offset="96" context="_175" access="public" location="f0:719" file="f0" line="719"/>
  <Field id="_2257" name="height" type="_1399" offset="112" context="_175" access="public" location="f0:720" file="f0" line="720"/>
  <Field id="_2258" name="minor_opcode" type="_1399" offset="128" context="_175" access="public" location="f0:721" file="f0" line="721"/>
  <Field id="_2259" name="count" type="_1399" offset="144" context="_175" access="public" location="f0:722" file="f0" line="722"/>
  <Field id="_2260" name="major_opcode" type="_1478" offset="160" context="_175" access="public" location="f0:723" file="f0" line="723"/>
  <Field id="_2261" name="pad1" type="_5162" offset="168" context="_175" access="public" location="f0:724" file="f0" line="724"/>
  <Destructor id="_2262" name="xcb_graphics_exposure_event_t" artificial="1" throw="" context="_175" access="public" mangled="_ZN29xcb_graphics_exposure_event_tD1Ev *INTERNAL* " demangled="xcb_graphics_exposure_event_t::~xcb_graphics_exposure_event_t()" location="f0:712" file="f0" line="712" endline="712" inline="1">
  </Destructor>
  <OperatorMethod id="_2263" name="=" returns="_5206" artificial="1" throw="" context="_175" access="public" mangled="_ZN29xcb_graphics_exposure_event_taSERKS_" demangled="xcb_graphics_exposure_event_t::operator=(xcb_graphics_exposure_event_t const&amp;)" location="f0:712" file="f0" line="712" endline="712" inline="1">
    <Argument type="_5207" location="f0:712" file="f0" line="712"/>
  </OperatorMethod>
  <Constructor id="_2264" name="xcb_graphics_exposure_event_t" artificial="1" throw="" context="_175" access="public" mangled="_ZN29xcb_graphics_exposure_event_tC1ERKS_ *INTERNAL* " demangled="xcb_graphics_exposure_event_t::xcb_graphics_exposure_event_t(xcb_graphics_exposure_event_t const&amp;)" location="f0:712" file="f0" line="712" endline="712" inline="1">
    <Argument type="_5207" location="f0:712" file="f0" line="712"/>
  </Constructor>
  <Constructor id="_2265" name="xcb_graphics_exposure_event_t" artificial="1" throw="" context="_175" access="public" mangled="_ZN29xcb_graphics_exposure_event_tC1Ev *INTERNAL* " demangled="xcb_graphics_exposure_event_t::xcb_graphics_exposure_event_t()" location="f0:712" file="f0" line="712" inline="1"/>
  <Field id="_2266" name="sequence" type="_151" offset="0" context="_178" access="public" location="f0:2585" file="f0" line="2585"/>
  <Destructor id="_2267" name="xcb_list_fonts_cookie_t" artificial="1" throw="" context="_178" access="public" mangled="_ZN23xcb_list_fonts_cookie_tD1Ev *INTERNAL* " demangled="xcb_list_fonts_cookie_t::~xcb_list_fonts_cookie_t()" location="f0:2584" file="f0" line="2584" endline="2584" inline="1">
  </Destructor>
  <OperatorMethod id="_2268" name="=" returns="_5208" artificial="1" throw="" context="_178" access="public" mangled="_ZN23xcb_list_fonts_cookie_taSERKS_" demangled="xcb_list_fonts_cookie_t::operator=(xcb_list_fonts_cookie_t const&amp;)" location="f0:2584" file="f0" line="2584" endline="2584" inline="1">
    <Argument type="_5209" location="f0:2584" file="f0" line="2584"/>
  </OperatorMethod>
  <Constructor id="_2269" name="xcb_list_fonts_cookie_t" artificial="1" throw="" context="_178" access="public" mangled="_ZN23xcb_list_fonts_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_list_fonts_cookie_t::xcb_list_fonts_cookie_t(xcb_list_fonts_cookie_t const&amp;)" location="f0:2584" file="f0" line="2584" endline="2584" inline="1">
    <Argument type="_5209" location="f0:2584" file="f0" line="2584"/>
  </Constructor>
  <Constructor id="_2270" name="xcb_list_fonts_cookie_t" artificial="1" throw="" context="_178" access="public" mangled="_ZN23xcb_list_fonts_cookie_tC1Ev *INTERNAL* " demangled="xcb_list_fonts_cookie_t::xcb_list_fonts_cookie_t()" location="f0:2584" file="f0" line="2584" inline="1"/>
  <PointerType id="_2271" type="_61" size="64" align="64"/>
  <PointerType id="_2272" type="_1769" size="64" align="64"/>
  <CvQualifiedType id="_2272r" type="_2272" restrict="1"/>
  <PointerType id="_2274" type="_364c" size="64" align="64"/>
  <CvQualifiedType id="_2274r" type="_2274" restrict="1"/>
  <PointerType id="_2276" type="_5211" size="64" align="64"/>
  <CvQualifiedType id="_503r" type="_503" restrict="1"/>
  <Field id="_2278" name="response_type" type="_1478" offset="0" context="_192" access="public" location="f0:4166" file="f0" line="4166"/>
  <Field id="_2279" name="mode" type="_1478" offset="8" context="_192" access="public" location="f0:4167" file="f0" line="4167"/>
  <Field id="_2280" name="sequence" type="_1399" offset="16" context="_192" access="public" location="f0:4168" file="f0" line="4168"/>
  <Field id="_2281" name="length" type="_699" offset="32" context="_192" access="public" location="f0:4169" file="f0" line="4169"/>
  <Field id="_2282" name="hosts_len" type="_1399" offset="64" context="_192" access="public" location="f0:4170" file="f0" line="4170"/>
  <Field id="_2283" name="pad0" type="_5173" offset="80" context="_192" access="public" location="f0:4171" file="f0" line="4171"/>
  <Destructor id="_2284" name="xcb_list_hosts_reply_t" artificial="1" throw="" context="_192" access="public" mangled="_ZN22xcb_list_hosts_reply_tD1Ev *INTERNAL* " demangled="xcb_list_hosts_reply_t::~xcb_list_hosts_reply_t()" location="f0:4165" file="f0" line="4165" endline="4165" inline="1">
  </Destructor>
  <OperatorMethod id="_2285" name="=" returns="_5212" artificial="1" throw="" context="_192" access="public" mangled="_ZN22xcb_list_hosts_reply_taSERKS_" demangled="xcb_list_hosts_reply_t::operator=(xcb_list_hosts_reply_t const&amp;)" location="f0:4165" file="f0" line="4165" endline="4165" inline="1">
    <Argument type="_5213" location="f0:4165" file="f0" line="4165"/>
  </OperatorMethod>
  <Constructor id="_2286" name="xcb_list_hosts_reply_t" artificial="1" throw="" context="_192" access="public" mangled="_ZN22xcb_list_hosts_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_list_hosts_reply_t::xcb_list_hosts_reply_t(xcb_list_hosts_reply_t const&amp;)" location="f0:4165" file="f0" line="4165" endline="4165" inline="1">
    <Argument type="_5213" location="f0:4165" file="f0" line="4165"/>
  </Constructor>
  <Constructor id="_2287" name="xcb_list_hosts_reply_t" artificial="1" throw="" context="_192" access="public" mangled="_ZN22xcb_list_hosts_reply_tC1Ev *INTERNAL* " demangled="xcb_list_hosts_reply_t::xcb_list_hosts_reply_t()" location="f0:4165" file="f0" line="4165" inline="1"/>
  <Field id="_2288" name="atoms_len" type="_699" offset="0" context="_195" access="public" location="f3:980" file="f3" line="980"/>
  <Field id="_2289" name="atoms" type="_2373" offset="64" context="_195" access="public" location="f3:982" file="f3" line="982"/>
  <Field id="_2290" name="_reply" type="_2241" offset="128" context="_195" access="public" location="f3:985" file="f3" line="985"/>
  <Destructor id="_2291" name="._41" artificial="1" throw="" context="_195" access="public" mangled="_ZN34xcb_icccm_get_wm_protocols_reply_tD1Ev *INTERNAL* " demangled="xcb_icccm_get_wm_protocols_reply_t::~xcb_icccm_get_wm_protocols_reply_t()" location="f3:986" file="f3" line="986" endline="986" inline="1">
  </Destructor>
  <OperatorMethod id="_2292" name="=" returns="_5214" artificial="1" throw="" context="_195" access="public" mangled="_ZN34xcb_icccm_get_wm_protocols_reply_taSERKS_" demangled="xcb_icccm_get_wm_protocols_reply_t::operator=(xcb_icccm_get_wm_protocols_reply_t const&amp;)" location="f3:986" file="f3" line="986" endline="986" inline="1">
    <Argument type="_5215" location="f3:978" file="f3" line="978"/>
  </OperatorMethod>
  <Constructor id="_2293" name="._41" artificial="1" throw="" context="_195" access="public" mangled="_ZN34xcb_icccm_get_wm_protocols_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_icccm_get_wm_protocols_reply_t::xcb_icccm_get_wm_protocols_reply_t(xcb_icccm_get_wm_protocols_reply_t const&amp;)" location="f3:986" file="f3" line="986" endline="986" inline="1">
    <Argument type="_5215" location="f3:978" file="f3" line="978"/>
  </Constructor>
  <Constructor id="_2294" name="._41" artificial="1" throw="" context="_195" access="public" mangled="_ZN34xcb_icccm_get_wm_protocols_reply_tC1Ev *INTERNAL* " demangled="xcb_icccm_get_wm_protocols_reply_t::xcb_icccm_get_wm_protocols_reply_t()" location="f3:986" file="f3" line="986" inline="1"/>
  <Field id="_2295" name="response_type" type="_1478" offset="0" context="_198" access="public" location="f0:771" file="f0" line="771"/>
  <Field id="_2296" name="pad0" type="_1478" offset="8" context="_198" access="public" location="f0:772" file="f0" line="772"/>
  <Field id="_2297" name="sequence" type="_1399" offset="16" context="_198" access="public" location="f0:773" file="f0" line="773"/>
  <Field id="_2298" name="parent" type="_680" offset="32" context="_198" access="public" location="f0:774" file="f0" line="774"/>
  <Field id="_2299" name="window" type="_680" offset="64" context="_198" access="public" location="f0:775" file="f0" line="775"/>
  <Field id="_2300" name="x" type="_883" offset="96" context="_198" access="public" location="f0:776" file="f0" line="776"/>
  <Field id="_2301" name="y" type="_883" offset="112" context="_198" access="public" location="f0:777" file="f0" line="777"/>
  <Field id="_2302" name="width" type="_1399" offset="128" context="_198" access="public" location="f0:778" file="f0" line="778"/>
  <Field id="_2303" name="height" type="_1399" offset="144" context="_198" access="public" location="f0:779" file="f0" line="779"/>
  <Field id="_2304" name="border_width" type="_1399" offset="160" context="_198" access="public" location="f0:780" file="f0" line="780"/>
  <Field id="_2305" name="override_redirect" type="_1478" offset="176" context="_198" access="public" location="f0:781" file="f0" line="781"/>
  <Field id="_2306" name="pad1" type="_1478" offset="184" context="_198" access="public" location="f0:782" file="f0" line="782"/>
  <Destructor id="_2307" name="xcb_create_notify_event_t" artificial="1" throw="" context="_198" access="public" mangled="_ZN25xcb_create_notify_event_tD1Ev *INTERNAL* " demangled="xcb_create_notify_event_t::~xcb_create_notify_event_t()" location="f0:770" file="f0" line="770" endline="770" inline="1">
  </Destructor>
  <OperatorMethod id="_2308" name="=" returns="_5216" artificial="1" throw="" context="_198" access="public" mangled="_ZN25xcb_create_notify_event_taSERKS_" demangled="xcb_create_notify_event_t::operator=(xcb_create_notify_event_t const&amp;)" location="f0:770" file="f0" line="770" endline="770" inline="1">
    <Argument type="_5217" location="f0:770" file="f0" line="770"/>
  </OperatorMethod>
  <Constructor id="_2309" name="xcb_create_notify_event_t" artificial="1" throw="" context="_198" access="public" mangled="_ZN25xcb_create_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_create_notify_event_t::xcb_create_notify_event_t(xcb_create_notify_event_t const&amp;)" location="f0:770" file="f0" line="770" endline="770" inline="1">
    <Argument type="_5217" location="f0:770" file="f0" line="770"/>
  </Constructor>
  <Constructor id="_2310" name="xcb_create_notify_event_t" artificial="1" throw="" context="_198" access="public" mangled="_ZN25xcb_create_notify_event_tC1Ev *INTERNAL* " demangled="xcb_create_notify_event_t::xcb_create_notify_event_t()" location="f0:770" file="f0" line="770" inline="1"/>
  <PointerType id="_2311" type="_61c" size="64" align="64"/>
  <CvQualifiedType id="_2311r" type="_2311" restrict="1"/>
  <PointerType id="_2313" type="_1172" size="64" align="64"/>
  <CvQualifiedType id="_2313r" type="_2313" restrict="1"/>
  <Field id="_2315" name="response_type" type="_1478" offset="0" context="_204" access="public" location="f0:4287" file="f0" line="4287"/>
  <Field id="_2316" name="status" type="_1478" offset="8" context="_204" access="public" location="f0:4288" file="f0" line="4288"/>
  <Field id="_2317" name="sequence" type="_1399" offset="16" context="_204" access="public" location="f0:4289" file="f0" line="4289"/>
  <Field id="_2318" name="length" type="_699" offset="32" context="_204" access="public" location="f0:4290" file="f0" line="4290"/>
  <Destructor id="_2319" name="xcb_set_pointer_mapping_reply_t" artificial="1" throw="" context="_204" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_tD1Ev *INTERNAL* " demangled="xcb_set_pointer_mapping_reply_t::~xcb_set_pointer_mapping_reply_t()" location="f0:4286" file="f0" line="4286" endline="4286" inline="1">
  </Destructor>
  <OperatorMethod id="_2320" name="=" returns="_5219" artificial="1" throw="" context="_204" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_taSERKS_" demangled="xcb_set_pointer_mapping_reply_t::operator=(xcb_set_pointer_mapping_reply_t const&amp;)" location="f0:4286" file="f0" line="4286" endline="4286" inline="1">
    <Argument type="_5220" location="f0:4286" file="f0" line="4286"/>
  </OperatorMethod>
  <Constructor id="_2321" name="xcb_set_pointer_mapping_reply_t" artificial="1" throw="" context="_204" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_set_pointer_mapping_reply_t::xcb_set_pointer_mapping_reply_t(xcb_set_pointer_mapping_reply_t const&amp;)" location="f0:4286" file="f0" line="4286" endline="4286" inline="1">
    <Argument type="_5220" location="f0:4286" file="f0" line="4286"/>
  </Constructor>
  <Constructor id="_2322" name="xcb_set_pointer_mapping_reply_t" artificial="1" throw="" context="_204" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_tC1Ev *INTERNAL* " demangled="xcb_set_pointer_mapping_reply_t::xcb_set_pointer_mapping_reply_t()" location="f0:4286" file="f0" line="4286" inline="1"/>
  <PointerType id="_2323" type="_385c" size="64" align="64"/>
  <Field id="_2324" name="data" type="_2240" offset="0" context="_213" access="public" location="f0:44" file="f0" line="44"/>
  <Field id="_2325" name="rem" type="_184" offset="64" context="_213" access="public" location="f0:45" file="f0" line="45"/>
  <Field id="_2326" name="index" type="_184" offset="96" context="_213" access="public" location="f0:46" file="f0" line="46"/>
  <Destructor id="_2327" name="xcb_window_iterator_t" artificial="1" throw="" context="_213" access="public" mangled="_ZN21xcb_window_iterator_tD1Ev *INTERNAL* " demangled="xcb_window_iterator_t::~xcb_window_iterator_t()" location="f0:43" file="f0" line="43" endline="43" inline="1">
  </Destructor>
  <OperatorMethod id="_2328" name="=" returns="_5222" artificial="1" throw="" context="_213" access="public" mangled="_ZN21xcb_window_iterator_taSERKS_" demangled="xcb_window_iterator_t::operator=(xcb_window_iterator_t const&amp;)" location="f0:43" file="f0" line="43" endline="43" inline="1">
    <Argument type="_5223" location="f0:43" file="f0" line="43"/>
  </OperatorMethod>
  <Constructor id="_2329" name="xcb_window_iterator_t" artificial="1" throw="" context="_213" access="public" mangled="_ZN21xcb_window_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_window_iterator_t::xcb_window_iterator_t(xcb_window_iterator_t const&amp;)" location="f0:43" file="f0" line="43" endline="43" inline="1">
    <Argument type="_5223" location="f0:43" file="f0" line="43"/>
  </Constructor>
  <Constructor id="_2330" name="xcb_window_iterator_t" artificial="1" throw="" context="_213" access="public" mangled="_ZN21xcb_window_iterator_tC1Ev *INTERNAL* " demangled="xcb_window_iterator_t::xcb_window_iterator_t()" location="f0:43" file="f0" line="43" inline="1"/>
  <Field id="_2331" name="response_type" type="_1478" offset="0" context="_215" access="public" location="f0:1835" file="f0" line="1835"/>
  <Field id="_2332" name="pad0" type="_1478" offset="8" context="_215" access="public" location="f0:1836" file="f0" line="1836"/>
  <Field id="_2333" name="sequence" type="_1399" offset="16" context="_215" access="public" location="f0:1837" file="f0" line="1837"/>
  <Field id="_2334" name="length" type="_699" offset="32" context="_215" access="public" location="f0:1838" file="f0" line="1838"/>
  <Field id="_2335" name="atoms_len" type="_1399" offset="64" context="_215" access="public" location="f0:1839" file="f0" line="1839"/>
  <Field id="_2336" name="pad1" type="_5173" offset="80" context="_215" access="public" location="f0:1840" file="f0" line="1840"/>
  <Destructor id="_2337" name="xcb_list_properties_reply_t" artificial="1" throw="" context="_215" access="public" mangled="_ZN27xcb_list_properties_reply_tD1Ev *INTERNAL* " demangled="xcb_list_properties_reply_t::~xcb_list_properties_reply_t()" location="f0:1834" file="f0" line="1834" endline="1834" inline="1">
  </Destructor>
  <OperatorMethod id="_2338" name="=" returns="_5224" artificial="1" throw="" context="_215" access="public" mangled="_ZN27xcb_list_properties_reply_taSERKS_" demangled="xcb_list_properties_reply_t::operator=(xcb_list_properties_reply_t const&amp;)" location="f0:1834" file="f0" line="1834" endline="1834" inline="1">
    <Argument type="_5225" location="f0:1834" file="f0" line="1834"/>
  </OperatorMethod>
  <Constructor id="_2339" name="xcb_list_properties_reply_t" artificial="1" throw="" context="_215" access="public" mangled="_ZN27xcb_list_properties_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_list_properties_reply_t::xcb_list_properties_reply_t(xcb_list_properties_reply_t const&amp;)" location="f0:1834" file="f0" line="1834" endline="1834" inline="1">
    <Argument type="_5225" location="f0:1834" file="f0" line="1834"/>
  </Constructor>
  <Constructor id="_2340" name="xcb_list_properties_reply_t" artificial="1" throw="" context="_215" access="public" mangled="_ZN27xcb_list_properties_reply_tC1Ev *INTERNAL* " demangled="xcb_list_properties_reply_t::xcb_list_properties_reply_t()" location="f0:1834" file="f0" line="1834" inline="1"/>
  <PointerType id="_2341" type="_1676" size="64" align="64"/>
  <PointerType id="_2342" type="_1481c" size="64" align="64"/>
  <Field id="_2343" name="sequence" type="_151" offset="0" context="_231" access="public" location="f0:2057" file="f0" line="2057"/>
  <Destructor id="_2344" name="xcb_grab_keyboard_cookie_t" artificial="1" throw="" context="_231" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_tD1Ev *INTERNAL* " demangled="xcb_grab_keyboard_cookie_t::~xcb_grab_keyboard_cookie_t()" location="f0:2056" file="f0" line="2056" endline="2056" inline="1">
  </Destructor>
  <OperatorMethod id="_2345" name="=" returns="_5227" artificial="1" throw="" context="_231" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_taSERKS_" demangled="xcb_grab_keyboard_cookie_t::operator=(xcb_grab_keyboard_cookie_t const&amp;)" location="f0:2056" file="f0" line="2056" endline="2056" inline="1">
    <Argument type="_5228" location="f0:2056" file="f0" line="2056"/>
  </OperatorMethod>
  <Constructor id="_2346" name="xcb_grab_keyboard_cookie_t" artificial="1" throw="" context="_231" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_grab_keyboard_cookie_t::xcb_grab_keyboard_cookie_t(xcb_grab_keyboard_cookie_t const&amp;)" location="f0:2056" file="f0" line="2056" endline="2056" inline="1">
    <Argument type="_5228" location="f0:2056" file="f0" line="2056"/>
  </Constructor>
  <Constructor id="_2347" name="xcb_grab_keyboard_cookie_t" artificial="1" throw="" context="_231" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_tC1Ev *INTERNAL* " demangled="xcb_grab_keyboard_cookie_t::xcb_grab_keyboard_cookie_t()" location="f0:2056" file="f0" line="2056" inline="1"/>
  <PointerType id="_2348" type="_28" size="64" align="64"/>
  <PointerType id="_2349" type="_586" size="64" align="64"/>
  <Field id="_2350" name="sequence" type="_151" offset="0" context="_242" access="public" location="f0:1600" file="f0" line="1600"/>
  <Destructor id="_2351" name="xcb_get_geometry_cookie_t" artificial="1" throw="" context="_242" access="public" mangled="_ZN25xcb_get_geometry_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_geometry_cookie_t::~xcb_get_geometry_cookie_t()" location="f0:1599" file="f0" line="1599" endline="1599" inline="1">
  </Destructor>
  <OperatorMethod id="_2352" name="=" returns="_5229" artificial="1" throw="" context="_242" access="public" mangled="_ZN25xcb_get_geometry_cookie_taSERKS_" demangled="xcb_get_geometry_cookie_t::operator=(xcb_get_geometry_cookie_t const&amp;)" location="f0:1599" file="f0" line="1599" endline="1599" inline="1">
    <Argument type="_5230" location="f0:1599" file="f0" line="1599"/>
  </OperatorMethod>
  <Constructor id="_2353" name="xcb_get_geometry_cookie_t" artificial="1" throw="" context="_242" access="public" mangled="_ZN25xcb_get_geometry_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_geometry_cookie_t::xcb_get_geometry_cookie_t(xcb_get_geometry_cookie_t const&amp;)" location="f0:1599" file="f0" line="1599" endline="1599" inline="1">
    <Argument type="_5230" location="f0:1599" file="f0" line="1599"/>
  </Constructor>
  <Constructor id="_2354" name="xcb_get_geometry_cookie_t" artificial="1" throw="" context="_242" access="public" mangled="_ZN25xcb_get_geometry_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_geometry_cookie_t::xcb_get_geometry_cookie_t()" location="f0:1599" file="f0" line="1599" inline="1"/>
  <PointerType id="_2355" type="_937" size="64" align="64"/>
  <Field id="_2356" name="data" type="_5231" offset="0" context="_252" access="public" location="f0:380" file="f0" line="380"/>
  <Field id="_2357" name="rem" type="_184" offset="64" context="_252" access="public" location="f0:381" file="f0" line="381"/>
  <Field id="_2358" name="index" type="_184" offset="96" context="_252" access="public" location="f0:382" file="f0" line="382"/>
  <Destructor id="_2359" name="xcb_screen_iterator_t" artificial="1" throw="" context="_252" access="public" mangled="_ZN21xcb_screen_iterator_tD1Ev *INTERNAL* " demangled="xcb_screen_iterator_t::~xcb_screen_iterator_t()" location="f0:379" file="f0" line="379" endline="379" inline="1">
  </Destructor>
  <OperatorMethod id="_2360" name="=" returns="_5232" artificial="1" throw="" context="_252" access="public" mangled="_ZN21xcb_screen_iterator_taSERKS_" demangled="xcb_screen_iterator_t::operator=(xcb_screen_iterator_t const&amp;)" location="f0:379" file="f0" line="379" endline="379" inline="1">
    <Argument type="_5233" location="f0:379" file="f0" line="379"/>
  </OperatorMethod>
  <Constructor id="_2361" name="xcb_screen_iterator_t" artificial="1" throw="" context="_252" access="public" mangled="_ZN21xcb_screen_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_screen_iterator_t::xcb_screen_iterator_t(xcb_screen_iterator_t const&amp;)" location="f0:379" file="f0" line="379" endline="379" inline="1">
    <Argument type="_5233" location="f0:379" file="f0" line="379"/>
  </Constructor>
  <Constructor id="_2362" name="xcb_screen_iterator_t" artificial="1" throw="" context="_252" access="public" mangled="_ZN21xcb_screen_iterator_tC1Ev *INTERNAL* " demangled="xcb_screen_iterator_t::xcb_screen_iterator_t()" location="f0:379" file="f0" line="379" inline="1"/>
  <PointerType id="_2363" type="_503" size="64" align="64"/>
  <PointerType id="_2364" type="_731c" size="64" align="64"/>
  <Field id="_2365" name="data" type="_5235" offset="0" context="_263" access="public" location="f0:480" file="f0" line="480"/>
  <Field id="_2366" name="rem" type="_184" offset="64" context="_263" access="public" location="f0:481" file="f0" line="481"/>
  <Field id="_2367" name="index" type="_184" offset="96" context="_263" access="public" location="f0:482" file="f0" line="482"/>
  <Destructor id="_2368" name="xcb_setup_iterator_t" artificial="1" throw="" context="_263" access="public" mangled="_ZN20xcb_setup_iterator_tD1Ev *INTERNAL* " demangled="xcb_setup_iterator_t::~xcb_setup_iterator_t()" location="f0:479" file="f0" line="479" endline="479" inline="1">
  </Destructor>
  <OperatorMethod id="_2369" name="=" returns="_5236" artificial="1" throw="" context="_263" access="public" mangled="_ZN20xcb_setup_iterator_taSERKS_" demangled="xcb_setup_iterator_t::operator=(xcb_setup_iterator_t const&amp;)" location="f0:479" file="f0" line="479" endline="479" inline="1">
    <Argument type="_5237" location="f0:479" file="f0" line="479"/>
  </OperatorMethod>
  <Constructor id="_2370" name="xcb_setup_iterator_t" artificial="1" throw="" context="_263" access="public" mangled="_ZN20xcb_setup_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_iterator_t::xcb_setup_iterator_t(xcb_setup_iterator_t const&amp;)" location="f0:479" file="f0" line="479" endline="479" inline="1">
    <Argument type="_5237" location="f0:479" file="f0" line="479"/>
  </Constructor>
  <Constructor id="_2371" name="xcb_setup_iterator_t" artificial="1" throw="" context="_263" access="public" mangled="_ZN20xcb_setup_iterator_tC1Ev *INTERNAL* " demangled="xcb_setup_iterator_t::xcb_setup_iterator_t()" location="f0:479" file="f0" line="479" inline="1"/>
  <PointerType id="_2372" type="_539" size="64" align="64"/>
  <PointerType id="_2373" type="_1679" size="64" align="64"/>
  <Field id="_2374" name="instance_name" type="_1121" offset="0" context="_280" access="public" location="f3:407" file="f3" line="407"/>
  <Field id="_2375" name="class_name" type="_1121" offset="64" context="_280" access="public" location="f3:409" file="f3" line="409"/>
  <Field id="_2376" name="_reply" type="_2241" offset="128" context="_280" access="public" location="f3:412" file="f3" line="412"/>
  <Destructor id="_2377" name="._35" artificial="1" throw="" context="_280" access="public" mangled="_ZN30xcb_icccm_get_wm_class_reply_tD1Ev *INTERNAL* " demangled="xcb_icccm_get_wm_class_reply_t::~xcb_icccm_get_wm_class_reply_t()" location="f3:413" file="f3" line="413" endline="413" inline="1">
  </Destructor>
  <OperatorMethod id="_2378" name="=" returns="_5238" artificial="1" throw="" context="_280" access="public" mangled="_ZN30xcb_icccm_get_wm_class_reply_taSERKS_" demangled="xcb_icccm_get_wm_class_reply_t::operator=(xcb_icccm_get_wm_class_reply_t const&amp;)" location="f3:413" file="f3" line="413" endline="413" inline="1">
    <Argument type="_5239" location="f3:405" file="f3" line="405"/>
  </OperatorMethod>
  <Constructor id="_2379" name="._35" artificial="1" throw="" context="_280" access="public" mangled="_ZN30xcb_icccm_get_wm_class_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_icccm_get_wm_class_reply_t::xcb_icccm_get_wm_class_reply_t(xcb_icccm_get_wm_class_reply_t const&amp;)" location="f3:413" file="f3" line="413" endline="413" inline="1">
    <Argument type="_5239" location="f3:405" file="f3" line="405"/>
  </Constructor>
  <Constructor id="_2380" name="._35" artificial="1" throw="" context="_280" access="public" mangled="_ZN30xcb_icccm_get_wm_class_reply_tC1Ev *INTERNAL* " demangled="xcb_icccm_get_wm_class_reply_t::xcb_icccm_get_wm_class_reply_t()" location="f3:413" file="f3" line="413" inline="1"/>
  <PointerType id="_2381" type="_216c" size="64" align="64"/>
  <PointerType id="_2382" type="_1505c" size="64" align="64"/>
  <Field id="_2383" name="major_opcode" type="_1478" offset="0" context="_285" access="public" location="f0:1872" file="f0" line="1872"/>
  <Field id="_2384" name="pad0" type="_1478" offset="8" context="_285" access="public" location="f0:1873" file="f0" line="1873"/>
  <Field id="_2385" name="length" type="_1399" offset="16" context="_285" access="public" location="f0:1874" file="f0" line="1874"/>
  <Field id="_2386" name="selection" type="_1679" offset="32" context="_285" access="public" location="f0:1875" file="f0" line="1875"/>
  <Destructor id="_2387" name="xcb_get_selection_owner_request_t" artificial="1" throw="" context="_285" access="public" mangled="_ZN33xcb_get_selection_owner_request_tD1Ev *INTERNAL* " demangled="xcb_get_selection_owner_request_t::~xcb_get_selection_owner_request_t()" location="f0:1871" file="f0" line="1871" endline="1871" inline="1">
  </Destructor>
  <OperatorMethod id="_2388" name="=" returns="_5242" artificial="1" throw="" context="_285" access="public" mangled="_ZN33xcb_get_selection_owner_request_taSERKS_" demangled="xcb_get_selection_owner_request_t::operator=(xcb_get_selection_owner_request_t const&amp;)" location="f0:1871" file="f0" line="1871" endline="1871" inline="1">
    <Argument type="_5243" location="f0:1871" file="f0" line="1871"/>
  </OperatorMethod>
  <Constructor id="_2389" name="xcb_get_selection_owner_request_t" artificial="1" throw="" context="_285" access="public" mangled="_ZN33xcb_get_selection_owner_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_selection_owner_request_t::xcb_get_selection_owner_request_t(xcb_get_selection_owner_request_t const&amp;)" location="f0:1871" file="f0" line="1871" endline="1871" inline="1">
    <Argument type="_5243" location="f0:1871" file="f0" line="1871"/>
  </Constructor>
  <Constructor id="_2390" name="xcb_get_selection_owner_request_t" artificial="1" throw="" context="_285" access="public" mangled="_ZN33xcb_get_selection_owner_request_tC1Ev *INTERNAL* " demangled="xcb_get_selection_owner_request_t::xcb_get_selection_owner_request_t()" location="f0:1871" file="f0" line="1871" inline="1"/>
  <Field id="_2391" name="major_opcode" type="_1478" offset="0" context="_288" access="public" location="f0:3951" file="f0" line="3951"/>
  <Field id="_2392" name="pad0" type="_1478" offset="8" context="_288" access="public" location="f0:3952" file="f0" line="3952"/>
  <Field id="_2393" name="length" type="_1399" offset="16" context="_288" access="public" location="f0:3953" file="f0" line="3953"/>
  <Destructor id="_2394" name="xcb_get_keyboard_control_request_t" artificial="1" throw="" context="_288" access="public" mangled="_ZN34xcb_get_keyboard_control_request_tD1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_request_t::~xcb_get_keyboard_control_request_t()" location="f0:3950" file="f0" line="3950" endline="3950" inline="1">
  </Destructor>
  <OperatorMethod id="_2395" name="=" returns="_5244" artificial="1" throw="" context="_288" access="public" mangled="_ZN34xcb_get_keyboard_control_request_taSERKS_" demangled="xcb_get_keyboard_control_request_t::operator=(xcb_get_keyboard_control_request_t const&amp;)" location="f0:3950" file="f0" line="3950" endline="3950" inline="1">
    <Argument type="_5245" location="f0:3950" file="f0" line="3950"/>
  </OperatorMethod>
  <Constructor id="_2396" name="xcb_get_keyboard_control_request_t" artificial="1" throw="" context="_288" access="public" mangled="_ZN34xcb_get_keyboard_control_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_keyboard_control_request_t::xcb_get_keyboard_control_request_t(xcb_get_keyboard_control_request_t const&amp;)" location="f0:3950" file="f0" line="3950" endline="3950" inline="1">
    <Argument type="_5245" location="f0:3950" file="f0" line="3950"/>
  </Constructor>
  <Constructor id="_2397" name="xcb_get_keyboard_control_request_t" artificial="1" throw="" context="_288" access="public" mangled="_ZN34xcb_get_keyboard_control_request_tC1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_request_t::xcb_get_keyboard_control_request_t()" location="f0:3950" file="f0" line="3950" inline="1"/>
  <PointerType id="_2398" type="_1096c" size="64" align="64"/>
  <PointerType id="_2399" type="_679" size="64" align="64"/>
  <PointerType id="_2400" type="_652c" size="64" align="64"/>
  <Field id="_2401" name="major_opcode" type="_1478" offset="0" context="_296" access="public" location="f0:3314" file="f0" line="3314"/>
  <Field id="_2402" name="pad0" type="_1478" offset="8" context="_296" access="public" location="f0:3315" file="f0" line="3315"/>
  <Field id="_2403" name="length" type="_1399" offset="16" context="_296" access="public" location="f0:3316" file="f0" line="3316"/>
  <Field id="_2404" name="cmap" type="_720" offset="32" context="_296" access="public" location="f0:3317" file="f0" line="3317"/>
  <Destructor id="_2405" name="xcb_uninstall_colormap_request_t" artificial="1" throw="" context="_296" access="public" mangled="_ZN32xcb_uninstall_colormap_request_tD1Ev *INTERNAL* " demangled="xcb_uninstall_colormap_request_t::~xcb_uninstall_colormap_request_t()" location="f0:3313" file="f0" line="3313" endline="3313" inline="1">
  </Destructor>
  <OperatorMethod id="_2406" name="=" returns="_5248" artificial="1" throw="" context="_296" access="public" mangled="_ZN32xcb_uninstall_colormap_request_taSERKS_" demangled="xcb_uninstall_colormap_request_t::operator=(xcb_uninstall_colormap_request_t const&amp;)" location="f0:3313" file="f0" line="3313" endline="3313" inline="1">
    <Argument type="_5249" location="f0:3313" file="f0" line="3313"/>
  </OperatorMethod>
  <Constructor id="_2407" name="xcb_uninstall_colormap_request_t" artificial="1" throw="" context="_296" access="public" mangled="_ZN32xcb_uninstall_colormap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_uninstall_colormap_request_t::xcb_uninstall_colormap_request_t(xcb_uninstall_colormap_request_t const&amp;)" location="f0:3313" file="f0" line="3313" endline="3313" inline="1">
    <Argument type="_5249" location="f0:3313" file="f0" line="3313"/>
  </Constructor>
  <Constructor id="_2408" name="xcb_uninstall_colormap_request_t" artificial="1" throw="" context="_296" access="public" mangled="_ZN32xcb_uninstall_colormap_request_tC1Ev *INTERNAL* " demangled="xcb_uninstall_colormap_request_t::xcb_uninstall_colormap_request_t()" location="f0:3313" file="f0" line="3313" inline="1"/>
  <PointerType id="_2409" type="_195" size="64" align="64"/>
  <CvQualifiedType id="_1997r" type="_1997" restrict="1"/>
  <PointerType id="_2411" type="_776c" size="64" align="64"/>
  <CvQualifiedType id="_2411r" type="_2411" restrict="1"/>
  <PointerType id="_2413" type="_1750" size="64" align="64"/>
  <PointerType id="_2414" type="_546" size="64" align="64"/>
  <PointerType id="_2415" type="_723" size="64" align="64"/>
  <Field id="_2416" name="major_opcode" type="_1478" offset="0" context="_307" access="public" location="f0:4233" file="f0" line="4233"/>
  <Field id="_2417" name="pad0" type="_1478" offset="8" context="_307" access="public" location="f0:4234" file="f0" line="4234"/>
  <Field id="_2418" name="length" type="_1399" offset="16" context="_307" access="public" location="f0:4235" file="f0" line="4235"/>
  <Field id="_2419" name="window" type="_680" offset="32" context="_307" access="public" location="f0:4236" file="f0" line="4236"/>
  <Field id="_2420" name="atoms_len" type="_1399" offset="64" context="_307" access="public" location="f0:4237" file="f0" line="4237"/>
  <Field id="_2421" name="delta" type="_883" offset="80" context="_307" access="public" location="f0:4238" file="f0" line="4238"/>
  <Destructor id="_2422" name="xcb_rotate_properties_request_t" artificial="1" throw="" context="_307" access="public" mangled="_ZN31xcb_rotate_properties_request_tD1Ev *INTERNAL* " demangled="xcb_rotate_properties_request_t::~xcb_rotate_properties_request_t()" location="f0:4232" file="f0" line="4232" endline="4232" inline="1">
  </Destructor>
  <OperatorMethod id="_2423" name="=" returns="_5251" artificial="1" throw="" context="_307" access="public" mangled="_ZN31xcb_rotate_properties_request_taSERKS_" demangled="xcb_rotate_properties_request_t::operator=(xcb_rotate_properties_request_t const&amp;)" location="f0:4232" file="f0" line="4232" endline="4232" inline="1">
    <Argument type="_5252" location="f0:4232" file="f0" line="4232"/>
  </OperatorMethod>
  <Constructor id="_2424" name="xcb_rotate_properties_request_t" artificial="1" throw="" context="_307" access="public" mangled="_ZN31xcb_rotate_properties_request_tC1ERKS_ *INTERNAL* " demangled="xcb_rotate_properties_request_t::xcb_rotate_properties_request_t(xcb_rotate_properties_request_t const&amp;)" location="f0:4232" file="f0" line="4232" endline="4232" inline="1">
    <Argument type="_5252" location="f0:4232" file="f0" line="4232"/>
  </Constructor>
  <Constructor id="_2425" name="xcb_rotate_properties_request_t" artificial="1" throw="" context="_307" access="public" mangled="_ZN31xcb_rotate_properties_request_tC1Ev *INTERNAL* " demangled="xcb_rotate_properties_request_t::xcb_rotate_properties_request_t()" location="f0:4232" file="f0" line="4232" inline="1"/>
  <PointerType id="_2426" type="_886" size="64" align="64"/>
  <Field id="_2427" name="major_opcode" type="_1478" offset="0" context="_311" access="public" location="f0:2180" file="f0" line="2180"/>
  <Field id="_2428" name="pad0" type="_1478" offset="8" context="_311" access="public" location="f0:2181" file="f0" line="2181"/>
  <Field id="_2429" name="length" type="_1399" offset="16" context="_311" access="public" location="f0:2182" file="f0" line="2182"/>
  <Destructor id="_2430" name="xcb_ungrab_server_request_t" artificial="1" throw="" context="_311" access="public" mangled="_ZN27xcb_ungrab_server_request_tD1Ev *INTERNAL* " demangled="xcb_ungrab_server_request_t::~xcb_ungrab_server_request_t()" location="f0:2179" file="f0" line="2179" endline="2179" inline="1">
  </Destructor>
  <OperatorMethod id="_2431" name="=" returns="_5253" artificial="1" throw="" context="_311" access="public" mangled="_ZN27xcb_ungrab_server_request_taSERKS_" demangled="xcb_ungrab_server_request_t::operator=(xcb_ungrab_server_request_t const&amp;)" location="f0:2179" file="f0" line="2179" endline="2179" inline="1">
    <Argument type="_5254" location="f0:2179" file="f0" line="2179"/>
  </OperatorMethod>
  <Constructor id="_2432" name="xcb_ungrab_server_request_t" artificial="1" throw="" context="_311" access="public" mangled="_ZN27xcb_ungrab_server_request_tC1ERKS_ *INTERNAL* " demangled="xcb_ungrab_server_request_t::xcb_ungrab_server_request_t(xcb_ungrab_server_request_t const&amp;)" location="f0:2179" file="f0" line="2179" endline="2179" inline="1">
    <Argument type="_5254" location="f0:2179" file="f0" line="2179"/>
  </Constructor>
  <Constructor id="_2433" name="xcb_ungrab_server_request_t" artificial="1" throw="" context="_311" access="public" mangled="_ZN27xcb_ungrab_server_request_tC1Ev *INTERNAL* " demangled="xcb_ungrab_server_request_t::xcb_ungrab_server_request_t()" location="f0:2179" file="f0" line="2179" inline="1"/>
  <PointerType id="_2434" type="_1736" size="64" align="64"/>
  <PointerType id="_2435" type="_9c" size="64" align="64"/>
  <ArrayType id="_2436" min="0" max="1u" type="_1121" size="128" align="64"/>
  <Field id="_2437" name="response_type" type="_1478" offset="0" context="_321" access="public" location="f0:838" file="f0" line="838"/>
  <Field id="_2438" name="pad0" type="_1478" offset="8" context="_321" access="public" location="f0:839" file="f0" line="839"/>
  <Field id="_2439" name="sequence" type="_1399" offset="16" context="_321" access="public" location="f0:840" file="f0" line="840"/>
  <Field id="_2440" name="parent" type="_680" offset="32" context="_321" access="public" location="f0:841" file="f0" line="841"/>
  <Field id="_2441" name="window" type="_680" offset="64" context="_321" access="public" location="f0:842" file="f0" line="842"/>
  <Destructor id="_2442" name="xcb_map_request_event_t" artificial="1" throw="" context="_321" access="public" mangled="_ZN23xcb_map_request_event_tD1Ev *INTERNAL* " demangled="xcb_map_request_event_t::~xcb_map_request_event_t()" location="f0:837" file="f0" line="837" endline="837" inline="1">
  </Destructor>
  <OperatorMethod id="_2443" name="=" returns="_5256" artificial="1" throw="" context="_321" access="public" mangled="_ZN23xcb_map_request_event_taSERKS_" demangled="xcb_map_request_event_t::operator=(xcb_map_request_event_t const&amp;)" location="f0:837" file="f0" line="837" endline="837" inline="1">
    <Argument type="_5257" location="f0:837" file="f0" line="837"/>
  </OperatorMethod>
  <Constructor id="_2444" name="xcb_map_request_event_t" artificial="1" throw="" context="_321" access="public" mangled="_ZN23xcb_map_request_event_tC1ERKS_ *INTERNAL* " demangled="xcb_map_request_event_t::xcb_map_request_event_t(xcb_map_request_event_t const&amp;)" location="f0:837" file="f0" line="837" endline="837" inline="1">
    <Argument type="_5257" location="f0:837" file="f0" line="837"/>
  </Constructor>
  <Constructor id="_2445" name="xcb_map_request_event_t" artificial="1" throw="" context="_321" access="public" mangled="_ZN23xcb_map_request_event_tC1Ev *INTERNAL* " demangled="xcb_map_request_event_t::xcb_map_request_event_t()" location="f0:837" file="f0" line="837" inline="1"/>
  <Field id="_2446" name="sequence" type="_151" offset="0" context="_323" access="public" location="f0:1392" file="f0" line="1392"/>
  <Destructor id="_2447" name="xcb_get_window_attributes_cookie_t" artificial="1" throw="" context="_323" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_window_attributes_cookie_t::~xcb_get_window_attributes_cookie_t()" location="f0:1391" file="f0" line="1391" endline="1391" inline="1">
  </Destructor>
  <OperatorMethod id="_2448" name="=" returns="_5258" artificial="1" throw="" context="_323" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_taSERKS_" demangled="xcb_get_window_attributes_cookie_t::operator=(xcb_get_window_attributes_cookie_t const&amp;)" location="f0:1391" file="f0" line="1391" endline="1391" inline="1">
    <Argument type="_5259" location="f0:1391" file="f0" line="1391"/>
  </OperatorMethod>
  <Constructor id="_2449" name="xcb_get_window_attributes_cookie_t" artificial="1" throw="" context="_323" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_window_attributes_cookie_t::xcb_get_window_attributes_cookie_t(xcb_get_window_attributes_cookie_t const&amp;)" location="f0:1391" file="f0" line="1391" endline="1391" inline="1">
    <Argument type="_5259" location="f0:1391" file="f0" line="1391"/>
  </Constructor>
  <Constructor id="_2450" name="xcb_get_window_attributes_cookie_t" artificial="1" throw="" context="_323" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_window_attributes_cookie_t::xcb_get_window_attributes_cookie_t()" location="f0:1391" file="f0" line="1391" inline="1"/>
  <Field id="_2451" name="data8" type="_5260" offset="0" context="_335" access="public" location="f0:1144" file="f0" line="1144"/>
  <Field id="_2452" name="data16" type="_5261" offset="0" context="_335" access="public" location="f0:1145" file="f0" line="1145"/>
  <Field id="_2453" name="data32" type="_5262" offset="0" context="_335" access="public" location="f0:1146" file="f0" line="1146"/>
  <Destructor id="_2454" name="xcb_client_message_data_t" artificial="1" throw="" context="_335" access="public" mangled="_ZN25xcb_client_message_data_tD1Ev *INTERNAL* " demangled="xcb_client_message_data_t::~xcb_client_message_data_t()" location="f0:1143" file="f0" line="1143" endline="1143" inline="1">
  </Destructor>
  <OperatorMethod id="_2455" name="=" returns="_5263" artificial="1" throw="" context="_335" access="public" mangled="_ZN25xcb_client_message_data_taSERKS_" demangled="xcb_client_message_data_t::operator=(xcb_client_message_data_t const&amp;)" location="f0:1143" file="f0" line="1143" endline="1143" inline="1">
    <Argument type="_5264" location="f0:1143" file="f0" line="1143"/>
  </OperatorMethod>
  <Constructor id="_2456" name="xcb_client_message_data_t" artificial="1" throw="" context="_335" access="public" mangled="_ZN25xcb_client_message_data_tC1ERKS_ *INTERNAL* " demangled="xcb_client_message_data_t::xcb_client_message_data_t(xcb_client_message_data_t const&amp;)" location="f0:1143" file="f0" line="1143" endline="1143" inline="1">
    <Argument type="_5264" location="f0:1143" file="f0" line="1143"/>
  </Constructor>
  <Constructor id="_2457" name="xcb_client_message_data_t" artificial="1" throw="" context="_335" access="public" mangled="_ZN25xcb_client_message_data_tC1Ev *INTERNAL* " demangled="xcb_client_message_data_t::xcb_client_message_data_t()" location="f0:1143" file="f0" line="1143" inline="1"/>
  <Field id="_2458" name="response_type" type="_1478" offset="0" context="_338" access="public" location="f0:1801" file="f0" line="1801"/>
  <Field id="_2459" name="format" type="_1478" offset="8" context="_338" access="public" location="f0:1802" file="f0" line="1802"/>
  <Field id="_2460" name="sequence" type="_1399" offset="16" context="_338" access="public" location="f0:1803" file="f0" line="1803"/>
  <Field id="_2461" name="length" type="_699" offset="32" context="_338" access="public" location="f0:1804" file="f0" line="1804"/>
  <Field id="_2462" name="type" type="_1679" offset="64" context="_338" access="public" location="f0:1805" file="f0" line="1805"/>
  <Field id="_2463" name="bytes_after" type="_699" offset="96" context="_338" access="public" location="f0:1806" file="f0" line="1806"/>
  <Field id="_2464" name="value_len" type="_699" offset="128" context="_338" access="public" location="f0:1807" file="f0" line="1807"/>
  <Field id="_2465" name="pad0" type="_5265" offset="160" context="_338" access="public" location="f0:1808" file="f0" line="1808"/>
  <Destructor id="_2466" name="xcb_get_property_reply_t" artificial="1" throw="" context="_338" access="public" mangled="_ZN24xcb_get_property_reply_tD1Ev *INTERNAL* " demangled="xcb_get_property_reply_t::~xcb_get_property_reply_t()" location="f0:1800" file="f0" line="1800" endline="1800" inline="1">
  </Destructor>
  <OperatorMethod id="_2467" name="=" returns="_5266" artificial="1" throw="" context="_338" access="public" mangled="_ZN24xcb_get_property_reply_taSERKS_" demangled="xcb_get_property_reply_t::operator=(xcb_get_property_reply_t const&amp;)" location="f0:1800" file="f0" line="1800" endline="1800" inline="1">
    <Argument type="_5267" location="f0:1800" file="f0" line="1800"/>
  </OperatorMethod>
  <Constructor id="_2468" name="xcb_get_property_reply_t" artificial="1" throw="" context="_338" access="public" mangled="_ZN24xcb_get_property_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_property_reply_t::xcb_get_property_reply_t(xcb_get_property_reply_t const&amp;)" location="f0:1800" file="f0" line="1800" endline="1800" inline="1">
    <Argument type="_5267" location="f0:1800" file="f0" line="1800"/>
  </Constructor>
  <Constructor id="_2469" name="xcb_get_property_reply_t" artificial="1" throw="" context="_338" access="public" mangled="_ZN24xcb_get_property_reply_tC1Ev *INTERNAL* " demangled="xcb_get_property_reply_t::xcb_get_property_reply_t()" location="f0:1800" file="f0" line="1800" inline="1"/>
  <Field id="_2470" name="sequence" type="_151" offset="0" context="_341" access="public" location="f0:3941" file="f0" line="3941"/>
  <Destructor id="_2471" name="xcb_get_keyboard_control_cookie_t" artificial="1" throw="" context="_341" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_cookie_t::~xcb_get_keyboard_control_cookie_t()" location="f0:3940" file="f0" line="3940" endline="3940" inline="1">
  </Destructor>
  <OperatorMethod id="_2472" name="=" returns="_5268" artificial="1" throw="" context="_341" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_taSERKS_" demangled="xcb_get_keyboard_control_cookie_t::operator=(xcb_get_keyboard_control_cookie_t const&amp;)" location="f0:3940" file="f0" line="3940" endline="3940" inline="1">
    <Argument type="_5269" location="f0:3940" file="f0" line="3940"/>
  </OperatorMethod>
  <Constructor id="_2473" name="xcb_get_keyboard_control_cookie_t" artificial="1" throw="" context="_341" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_keyboard_control_cookie_t::xcb_get_keyboard_control_cookie_t(xcb_get_keyboard_control_cookie_t const&amp;)" location="f0:3940" file="f0" line="3940" endline="3940" inline="1">
    <Argument type="_5269" location="f0:3940" file="f0" line="3940"/>
  </Constructor>
  <Constructor id="_2474" name="xcb_get_keyboard_control_cookie_t" artificial="1" throw="" context="_341" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_cookie_t::xcb_get_keyboard_control_cookie_t()" location="f0:3940" file="f0" line="3940" inline="1"/>
  <Field id="_2475" name="__size" type="_5148" offset="0" context="_346" access="public" location="f9:108" file="f9" line="108"/>
  <Field id="_2476" name="__align" type="_184" offset="0" context="_346" access="public" location="f9:109" file="f9" line="109"/>
  <Destructor id="_2477" name="._5" artificial="1" throw="" context="_346" access="public" mangled="_ZN19pthread_mutexattr_tD1Ev *INTERNAL* " demangled="pthread_mutexattr_t::~pthread_mutexattr_t()" location="f9:110" file="f9" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_2478" name="=" returns="_5270" artificial="1" throw="" context="_346" access="public" mangled="_ZN19pthread_mutexattr_taSERKS_" demangled="pthread_mutexattr_t::operator=(pthread_mutexattr_t const&amp;)" location="f9:110" file="f9" line="110" endline="110" inline="1">
    <Argument type="_5271" location="f9:107" file="f9" line="107"/>
  </OperatorMethod>
  <Constructor id="_2479" name="._5" artificial="1" throw="" context="_346" access="public" mangled="_ZN19pthread_mutexattr_tC1ERKS_ *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t(pthread_mutexattr_t const&amp;)" location="f9:110" file="f9" line="110" endline="110" inline="1">
    <Argument type="_5271" location="f9:107" file="f9" line="107"/>
  </Constructor>
  <Constructor id="_2480" name="._5" artificial="1" throw="" context="_346" access="public" mangled="_ZN19pthread_mutexattr_tC1Ev *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t()" location="f9:110" file="f9" line="110" inline="1"/>
  <PointerType id="_2481" type="_98" size="64" align="64"/>
  <Field id="_2482" name="response_type" type="_1478" offset="0" context="_351" access="public" location="f0:950" file="f0" line="950"/>
  <Field id="_2483" name="pad0" type="_1478" offset="8" context="_351" access="public" location="f0:951" file="f0" line="951"/>
  <Field id="_2484" name="sequence" type="_1399" offset="16" context="_351" access="public" location="f0:952" file="f0" line="952"/>
  <Field id="_2485" name="event" type="_680" offset="32" context="_351" access="public" location="f0:953" file="f0" line="953"/>
  <Field id="_2486" name="window" type="_680" offset="64" context="_351" access="public" location="f0:954" file="f0" line="954"/>
  <Field id="_2487" name="pad1" type="_5272" offset="96" context="_351" access="public" location="f0:955" file="f0" line="955"/>
  <Field id="_2488" name="place" type="_1478" offset="128" context="_351" access="public" location="f0:956" file="f0" line="956"/>
  <Field id="_2489" name="pad2" type="_5162" offset="136" context="_351" access="public" location="f0:957" file="f0" line="957"/>
  <Destructor id="_2490" name="xcb_circulate_notify_event_t" artificial="1" throw="" context="_351" access="public" mangled="_ZN28xcb_circulate_notify_event_tD1Ev *INTERNAL* " demangled="xcb_circulate_notify_event_t::~xcb_circulate_notify_event_t()" location="f0:949" file="f0" line="949" endline="949" inline="1">
  </Destructor>
  <OperatorMethod id="_2491" name="=" returns="_5273" artificial="1" throw="" context="_351" access="public" mangled="_ZN28xcb_circulate_notify_event_taSERKS_" demangled="xcb_circulate_notify_event_t::operator=(xcb_circulate_notify_event_t const&amp;)" location="f0:949" file="f0" line="949" endline="949" inline="1">
    <Argument type="_5274" location="f0:949" file="f0" line="949"/>
  </OperatorMethod>
  <Constructor id="_2492" name="xcb_circulate_notify_event_t" artificial="1" throw="" context="_351" access="public" mangled="_ZN28xcb_circulate_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_circulate_notify_event_t::xcb_circulate_notify_event_t(xcb_circulate_notify_event_t const&amp;)" location="f0:949" file="f0" line="949" endline="949" inline="1">
    <Argument type="_5274" location="f0:949" file="f0" line="949"/>
  </Constructor>
  <Constructor id="_2493" name="xcb_circulate_notify_event_t" artificial="1" throw="" context="_351" access="public" mangled="_ZN28xcb_circulate_notify_event_tC1Ev *INTERNAL* " demangled="xcb_circulate_notify_event_t::xcb_circulate_notify_event_t()" location="f0:949" file="f0" line="949" inline="1"/>
  <Field id="_2494" name="response_type" type="_1478" offset="0" context="_353" access="public" location="f0:594" file="f0" line="594"/>
  <Field id="_2495" name="detail" type="_1478" offset="8" context="_353" access="public" location="f0:595" file="f0" line="595"/>
  <Field id="_2496" name="sequence" type="_1399" offset="16" context="_353" access="public" location="f0:596" file="f0" line="596"/>
  <Field id="_2497" name="time" type="_1260" offset="32" context="_353" access="public" location="f0:597" file="f0" line="597"/>
  <Field id="_2498" name="root" type="_680" offset="64" context="_353" access="public" location="f0:598" file="f0" line="598"/>
  <Field id="_2499" name="event" type="_680" offset="96" context="_353" access="public" location="f0:599" file="f0" line="599"/>
  <Field id="_2500" name="child" type="_680" offset="128" context="_353" access="public" location="f0:600" file="f0" line="600"/>
  <Field id="_2501" name="root_x" type="_883" offset="160" context="_353" access="public" location="f0:601" file="f0" line="601"/>
  <Field id="_2502" name="root_y" type="_883" offset="176" context="_353" access="public" location="f0:602" file="f0" line="602"/>
  <Field id="_2503" name="event_x" type="_883" offset="192" context="_353" access="public" location="f0:603" file="f0" line="603"/>
  <Field id="_2504" name="event_y" type="_883" offset="208" context="_353" access="public" location="f0:604" file="f0" line="604"/>
  <Field id="_2505" name="state" type="_1399" offset="224" context="_353" access="public" location="f0:605" file="f0" line="605"/>
  <Field id="_2506" name="same_screen" type="_1478" offset="240" context="_353" access="public" location="f0:606" file="f0" line="606"/>
  <Field id="_2507" name="pad0" type="_1478" offset="248" context="_353" access="public" location="f0:607" file="f0" line="607"/>
  <Destructor id="_2508" name="xcb_motion_notify_event_t" artificial="1" throw="" context="_353" access="public" mangled="_ZN25xcb_motion_notify_event_tD1Ev *INTERNAL* " demangled="xcb_motion_notify_event_t::~xcb_motion_notify_event_t()" location="f0:593" file="f0" line="593" endline="593" inline="1">
  </Destructor>
  <OperatorMethod id="_2509" name="=" returns="_5275" artificial="1" throw="" context="_353" access="public" mangled="_ZN25xcb_motion_notify_event_taSERKS_" demangled="xcb_motion_notify_event_t::operator=(xcb_motion_notify_event_t const&amp;)" location="f0:593" file="f0" line="593" endline="593" inline="1">
    <Argument type="_5276" location="f0:593" file="f0" line="593"/>
  </OperatorMethod>
  <Constructor id="_2510" name="xcb_motion_notify_event_t" artificial="1" throw="" context="_353" access="public" mangled="_ZN25xcb_motion_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_motion_notify_event_t::xcb_motion_notify_event_t(xcb_motion_notify_event_t const&amp;)" location="f0:593" file="f0" line="593" endline="593" inline="1">
    <Argument type="_5276" location="f0:593" file="f0" line="593"/>
  </Constructor>
  <Constructor id="_2511" name="xcb_motion_notify_event_t" artificial="1" throw="" context="_353" access="public" mangled="_ZN25xcb_motion_notify_event_tC1Ev *INTERNAL* " demangled="xcb_motion_notify_event_t::xcb_motion_notify_event_t()" location="f0:593" file="f0" line="593" inline="1"/>
  <PointerType id="_2512" type="_1240" size="64" align="64"/>
  <PointerType id="_2513" type="_381" size="64" align="64"/>
  <PointerType id="_2514" type="_669" size="64" align="64"/>
  <Field id="_2515" name="fds_bits" type="_5277" offset="0" context="_362" access="public" location="f12:70" file="f12" line="70"/>
  <Destructor id="_2516" name="._2" artificial="1" throw="" context="_362" access="public" mangled="_ZN6fd_setD1Ev *INTERNAL* " demangled="fd_set::~fd_set()" location="f12:76" file="f12" line="76" endline="76" inline="1">
  </Destructor>
  <OperatorMethod id="_2517" name="=" returns="_5278" artificial="1" throw="" context="_362" access="public" mangled="_ZN6fd_setaSERKS_" demangled="fd_set::operator=(fd_set const&amp;)" location="f12:76" file="f12" line="76" endline="76" inline="1">
    <Argument type="_5279" location="f12:66" file="f12" line="66"/>
  </OperatorMethod>
  <Constructor id="_2518" name="._2" artificial="1" throw="" context="_362" access="public" mangled="_ZN6fd_setC1ERKS_ *INTERNAL* " demangled="fd_set::fd_set(fd_set const&amp;)" location="f12:76" file="f12" line="76" endline="76" inline="1">
    <Argument type="_5279" location="f12:66" file="f12" line="66"/>
  </Constructor>
  <Constructor id="_2519" name="._2" artificial="1" throw="" context="_362" access="public" mangled="_ZN6fd_setC1Ev *INTERNAL* " demangled="fd_set::fd_set()" location="f12:76" file="f12" line="76" inline="1"/>
  <Field id="_2520" name="__size" type="_5280" offset="0" context="_364" access="public" location="f9:55" file="f9" line="55"/>
  <Field id="_2521" name="__align" type="_32" offset="0" context="_364" access="public" location="f9:56" file="f9" line="56"/>
  <Destructor id="_2522" name="._3" artificial="1" throw="" context="_364" access="public" mangled="_ZN14pthread_attr_tD1Ev *INTERNAL* " demangled="pthread_attr_t::~pthread_attr_t()" location="f9:57" file="f9" line="57" endline="57" inline="1">
  </Destructor>
  <OperatorMethod id="_2523" name="=" returns="_5281" artificial="1" throw="" context="_364" access="public" mangled="_ZN14pthread_attr_taSERKS_" demangled="pthread_attr_t::operator=(pthread_attr_t const&amp;)" location="f9:57" file="f9" line="57" endline="57" inline="1">
    <Argument type="_5282" location="f9:54" file="f9" line="54"/>
  </OperatorMethod>
  <Constructor id="_2524" name="._3" artificial="1" throw="" context="_364" access="public" mangled="_ZN14pthread_attr_tC1ERKS_ *INTERNAL* " demangled="pthread_attr_t::pthread_attr_t(pthread_attr_t const&amp;)" location="f9:57" file="f9" line="57" endline="57" inline="1">
    <Argument type="_5282" location="f9:54" file="f9" line="54"/>
  </Constructor>
  <Constructor id="_2525" name="._3" artificial="1" throw="" context="_364" access="public" mangled="_ZN14pthread_attr_tC1Ev *INTERNAL* " demangled="pthread_attr_t::pthread_attr_t()" location="f9:57" file="f9" line="57" inline="1"/>
  <PointerType id="_2526" type="_214" size="64" align="64"/>
  <Field id="_2527" name="sequence" type="_151" offset="0" context="_368" access="public" location="f0:3598" file="f0" line="3598"/>
  <Destructor id="_2528" name="xcb_query_colors_cookie_t" artificial="1" throw="" context="_368" access="public" mangled="_ZN25xcb_query_colors_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_colors_cookie_t::~xcb_query_colors_cookie_t()" location="f0:3597" file="f0" line="3597" endline="3597" inline="1">
  </Destructor>
  <OperatorMethod id="_2529" name="=" returns="_5283" artificial="1" throw="" context="_368" access="public" mangled="_ZN25xcb_query_colors_cookie_taSERKS_" demangled="xcb_query_colors_cookie_t::operator=(xcb_query_colors_cookie_t const&amp;)" location="f0:3597" file="f0" line="3597" endline="3597" inline="1">
    <Argument type="_5284" location="f0:3597" file="f0" line="3597"/>
  </OperatorMethod>
  <Constructor id="_2530" name="xcb_query_colors_cookie_t" artificial="1" throw="" context="_368" access="public" mangled="_ZN25xcb_query_colors_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_colors_cookie_t::xcb_query_colors_cookie_t(xcb_query_colors_cookie_t const&amp;)" location="f0:3597" file="f0" line="3597" endline="3597" inline="1">
    <Argument type="_5284" location="f0:3597" file="f0" line="3597"/>
  </Constructor>
  <Constructor id="_2531" name="xcb_query_colors_cookie_t" artificial="1" throw="" context="_368" access="public" mangled="_ZN25xcb_query_colors_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_colors_cookie_t::xcb_query_colors_cookie_t()" location="f0:3597" file="f0" line="3597" inline="1"/>
  <PointerType id="_2532" type="_193" size="64" align="64"/>
  <PointerType id="_2533" type="_177c" size="64" align="64"/>
  <Field id="_2534" name="sequence" type="_151" offset="0" context="_378" access="public" location="f0:1777" file="f0" line="1777"/>
  <Destructor id="_2535" name="xcb_get_property_cookie_t" artificial="1" throw="" context="_378" access="public" mangled="_ZN25xcb_get_property_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_property_cookie_t::~xcb_get_property_cookie_t()" location="f0:1776" file="f0" line="1776" endline="1776" inline="1">
  </Destructor>
  <OperatorMethod id="_2536" name="=" returns="_5286" artificial="1" throw="" context="_378" access="public" mangled="_ZN25xcb_get_property_cookie_taSERKS_" demangled="xcb_get_property_cookie_t::operator=(xcb_get_property_cookie_t const&amp;)" location="f0:1776" file="f0" line="1776" endline="1776" inline="1">
    <Argument type="_5287" location="f0:1776" file="f0" line="1776"/>
  </OperatorMethod>
  <Constructor id="_2537" name="xcb_get_property_cookie_t" artificial="1" throw="" context="_378" access="public" mangled="_ZN25xcb_get_property_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_property_cookie_t::xcb_get_property_cookie_t(xcb_get_property_cookie_t const&amp;)" location="f0:1776" file="f0" line="1776" endline="1776" inline="1">
    <Argument type="_5287" location="f0:1776" file="f0" line="1776"/>
  </Constructor>
  <Constructor id="_2538" name="xcb_get_property_cookie_t" artificial="1" throw="" context="_378" access="public" mangled="_ZN25xcb_get_property_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_property_cookie_t::xcb_get_property_cookie_t()" location="f0:1776" file="f0" line="1776" inline="1"/>
  <Field id="_2539" name="__data" type="_2542" offset="0" context="_381" access="public" location="f9:168" file="f9" line="168"/>
  <Field id="_2540" name="__size" type="_5280" offset="0" context="_381" access="public" location="f9:187" file="f9" line="187"/>
  <Field id="_2541" name="__align" type="_32" offset="0" context="_381" access="public" location="f9:188" file="f9" line="188"/>
  <Struct id="_2542" context="_381" access="public" mangled="N16pthread_rwlock_t4._10E" demangled="pthread_rwlock_t::._10" location="f9:154" file="f9" line="154" artificial="1" size="448" align="64" members="_5288 _5289 _5290 _5291 _5292 _5293 _5294 _5295 _5296 _5297 _5298 _5299 _5300 _5301 _5302 " bases=""/>
  <Destructor id="_2543" name="._9" artificial="1" throw="" context="_381" access="public" mangled="_ZN16pthread_rwlock_tD1Ev *INTERNAL* " demangled="pthread_rwlock_t::~pthread_rwlock_t()" location="f9:189" file="f9" line="189" endline="189" inline="1">
  </Destructor>
  <OperatorMethod id="_2544" name="=" returns="_5303" artificial="1" throw="" context="_381" access="public" mangled="_ZN16pthread_rwlock_taSERKS_" demangled="pthread_rwlock_t::operator=(pthread_rwlock_t const&amp;)" location="f9:189" file="f9" line="189" endline="189" inline="1">
    <Argument type="_5304" location="f9:151" file="f9" line="151"/>
  </OperatorMethod>
  <Constructor id="_2545" name="._9" artificial="1" throw="" context="_381" access="public" mangled="_ZN16pthread_rwlock_tC1ERKS_ *INTERNAL* " demangled="pthread_rwlock_t::pthread_rwlock_t(pthread_rwlock_t const&amp;)" location="f9:189" file="f9" line="189" endline="189" inline="1">
    <Argument type="_5304" location="f9:151" file="f9" line="151"/>
  </Constructor>
  <Constructor id="_2546" name="._9" artificial="1" throw="" context="_381" access="public" mangled="_ZN16pthread_rwlock_tC1Ev *INTERNAL* " demangled="pthread_rwlock_t::pthread_rwlock_t()" location="f9:189" file="f9" line="189" inline="1"/>
  <Field id="_2547" name="major_opcode" type="_1478" offset="0" context="_382" access="public" location="f0:2856" file="f0" line="2856"/>
  <Field id="_2548" name="pad0" type="_1478" offset="8" context="_382" access="public" location="f0:2857" file="f0" line="2857"/>
  <Field id="_2549" name="length" type="_1399" offset="16" context="_382" access="public" location="f0:2858" file="f0" line="2858"/>
  <Field id="_2550" name="src_gc" type="_1792" offset="32" context="_382" access="public" location="f0:2859" file="f0" line="2859"/>
  <Field id="_2551" name="dst_gc" type="_1792" offset="64" context="_382" access="public" location="f0:2860" file="f0" line="2860"/>
  <Field id="_2552" name="value_mask" type="_699" offset="96" context="_382" access="public" location="f0:2861" file="f0" line="2861"/>
  <Destructor id="_2553" name="xcb_copy_gc_request_t" artificial="1" throw="" context="_382" access="public" mangled="_ZN21xcb_copy_gc_request_tD1Ev *INTERNAL* " demangled="xcb_copy_gc_request_t::~xcb_copy_gc_request_t()" location="f0:2855" file="f0" line="2855" endline="2855" inline="1">
  </Destructor>
  <OperatorMethod id="_2554" name="=" returns="_5305" artificial="1" throw="" context="_382" access="public" mangled="_ZN21xcb_copy_gc_request_taSERKS_" demangled="xcb_copy_gc_request_t::operator=(xcb_copy_gc_request_t const&amp;)" location="f0:2855" file="f0" line="2855" endline="2855" inline="1">
    <Argument type="_5306" location="f0:2855" file="f0" line="2855"/>
  </OperatorMethod>
  <Constructor id="_2555" name="xcb_copy_gc_request_t" artificial="1" throw="" context="_382" access="public" mangled="_ZN21xcb_copy_gc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_copy_gc_request_t::xcb_copy_gc_request_t(xcb_copy_gc_request_t const&amp;)" location="f0:2855" file="f0" line="2855" endline="2855" inline="1">
    <Argument type="_5306" location="f0:2855" file="f0" line="2855"/>
  </Constructor>
  <Constructor id="_2556" name="xcb_copy_gc_request_t" artificial="1" throw="" context="_382" access="public" mangled="_ZN21xcb_copy_gc_request_tC1Ev *INTERNAL* " demangled="xcb_copy_gc_request_t::xcb_copy_gc_request_t()" location="f0:2855" file="f0" line="2855" inline="1"/>
  <Field id="_2557" name="iov_base" type="_503" offset="0" context="_385" access="public" location="f16:46" file="f16" line="46"/>
  <Field id="_2558" name="iov_len" type="_1197" offset="64" context="_385" access="public" location="f16:47" file="f16" line="47"/>
  <Destructor id="_2559" name="iovec" artificial="1" throw="" context="_385" access="public" mangled="_ZN5iovecD1Ev *INTERNAL* " demangled="iovec::~iovec()" location="f16:45" file="f16" line="45" endline="45" inline="1">
  </Destructor>
  <OperatorMethod id="_2560" name="=" returns="_5307" artificial="1" throw="" context="_385" access="public" mangled="_ZN5iovecaSERKS_" demangled="iovec::operator=(iovec const&amp;)" location="f16:45" file="f16" line="45" endline="45" inline="1">
    <Argument type="_5308" location="f16:45" file="f16" line="45"/>
  </OperatorMethod>
  <Constructor id="_2561" name="iovec" artificial="1" throw="" context="_385" access="public" mangled="_ZN5iovecC1ERKS_ *INTERNAL* " demangled="iovec::iovec(iovec const&amp;)" location="f16:45" file="f16" line="45" endline="45" inline="1">
    <Argument type="_5308" location="f16:45" file="f16" line="45"/>
  </Constructor>
  <Constructor id="_2562" name="iovec" artificial="1" throw="" context="_385" access="public" mangled="_ZN5iovecC1Ev *INTERNAL* " demangled="iovec::iovec()" location="f16:45" file="f16" line="45" inline="1"/>
  <Field id="_2563" name="sequence" type="_151" offset="0" context="_386" access="public" location="f0:3324" file="f0" line="3324"/>
  <Destructor id="_2564" name="xcb_list_installed_colormaps_cookie_t" artificial="1" throw="" context="_386" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_tD1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_cookie_t::~xcb_list_installed_colormaps_cookie_t()" location="f0:3323" file="f0" line="3323" endline="3323" inline="1">
  </Destructor>
  <OperatorMethod id="_2565" name="=" returns="_5309" artificial="1" throw="" context="_386" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_taSERKS_" demangled="xcb_list_installed_colormaps_cookie_t::operator=(xcb_list_installed_colormaps_cookie_t const&amp;)" location="f0:3323" file="f0" line="3323" endline="3323" inline="1">
    <Argument type="_5310" location="f0:3323" file="f0" line="3323"/>
  </OperatorMethod>
  <Constructor id="_2566" name="xcb_list_installed_colormaps_cookie_t" artificial="1" throw="" context="_386" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_list_installed_colormaps_cookie_t::xcb_list_installed_colormaps_cookie_t(xcb_list_installed_colormaps_cookie_t const&amp;)" location="f0:3323" file="f0" line="3323" endline="3323" inline="1">
    <Argument type="_5310" location="f0:3323" file="f0" line="3323"/>
  </Constructor>
  <Constructor id="_2567" name="xcb_list_installed_colormaps_cookie_t" artificial="1" throw="" context="_386" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_tC1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_cookie_t::xcb_list_installed_colormaps_cookie_t()" location="f0:3323" file="f0" line="3323" inline="1"/>
  <CvQualifiedType id="_2242r" type="_2242" restrict="1"/>
  <PointerType id="_2569" type="_645c" size="64" align="64"/>
  <CvQualifiedType id="_2569r" type="_2569" restrict="1"/>
  <Field id="_2571" name="depth" type="_1478" offset="0" context="_389" access="public" location="f0:304" file="f0" line="304"/>
  <Field id="_2572" name="pad0" type="_1478" offset="8" context="_389" access="public" location="f0:305" file="f0" line="305"/>
  <Field id="_2573" name="visuals_len" type="_1399" offset="16" context="_389" access="public" location="f0:306" file="f0" line="306"/>
  <Field id="_2574" name="pad1" type="_5272" offset="32" context="_389" access="public" location="f0:307" file="f0" line="307"/>
  <Destructor id="_2575" name="xcb_depth_t" artificial="1" throw="" context="_389" access="public" mangled="_ZN11xcb_depth_tD1Ev *INTERNAL* " demangled="xcb_depth_t::~xcb_depth_t()" location="f0:303" file="f0" line="303" endline="303" inline="1">
  </Destructor>
  <OperatorMethod id="_2576" name="=" returns="_5312" artificial="1" throw="" context="_389" access="public" mangled="_ZN11xcb_depth_taSERKS_" demangled="xcb_depth_t::operator=(xcb_depth_t const&amp;)" location="f0:303" file="f0" line="303" endline="303" inline="1">
    <Argument type="_5313" location="f0:303" file="f0" line="303"/>
  </OperatorMethod>
  <Constructor id="_2577" name="xcb_depth_t" artificial="1" throw="" context="_389" access="public" mangled="_ZN11xcb_depth_tC1ERKS_ *INTERNAL* " demangled="xcb_depth_t::xcb_depth_t(xcb_depth_t const&amp;)" location="f0:303" file="f0" line="303" endline="303" inline="1">
    <Argument type="_5313" location="f0:303" file="f0" line="303"/>
  </Constructor>
  <Constructor id="_2578" name="xcb_depth_t" artificial="1" throw="" context="_389" access="public" mangled="_ZN11xcb_depth_tC1Ev *INTERNAL* " demangled="xcb_depth_t::xcb_depth_t()" location="f0:303" file="f0" line="303" inline="1"/>
  <Field id="_2579" name="__locales" type="_5314" offset="0" context="_391" access="public" location="f18:31" file="f18" line="31"/>
  <Field id="_2580" name="__ctype_b" type="_5315" offset="832" context="_391" access="public" location="f18:34" file="f18" line="34"/>
  <Field id="_2581" name="__ctype_tolower" type="_5316" offset="896" context="_391" access="public" location="f18:35" file="f18" line="35"/>
  <Field id="_2582" name="__ctype_toupper" type="_5316" offset="960" context="_391" access="public" location="f18:36" file="f18" line="36"/>
  <Field id="_2583" name="__names" type="_5317" offset="1024" context="_391" access="public" location="f18:39" file="f18" line="39"/>
  <Destructor id="_2584" name="__locale_struct" artificial="1" throw="" context="_391" access="public" mangled="_ZN15__locale_structD1Ev *INTERNAL* " demangled="__locale_struct::~__locale_struct()" location="f18:29" file="f18" line="29" endline="29" inline="1">
  </Destructor>
  <OperatorMethod id="_2585" name="=" returns="_5318" artificial="1" throw="" context="_391" access="public" mangled="_ZN15__locale_structaSERKS_" demangled="__locale_struct::operator=(__locale_struct const&amp;)" location="f18:29" file="f18" line="29" endline="29" inline="1">
    <Argument type="_5319" location="f18:29" file="f18" line="29"/>
  </OperatorMethod>
  <Constructor id="_2586" name="__locale_struct" artificial="1" throw="" context="_391" access="public" mangled="_ZN15__locale_structC1ERKS_ *INTERNAL* " demangled="__locale_struct::__locale_struct(__locale_struct const&amp;)" location="f18:29" file="f18" line="29" endline="29" inline="1">
    <Argument type="_5319" location="f18:29" file="f18" line="29"/>
  </Constructor>
  <Constructor id="_2587" name="__locale_struct" artificial="1" throw="" context="_391" access="public" mangled="_ZN15__locale_structC1Ev *INTERNAL* " demangled="__locale_struct::__locale_struct()" location="f18:29" file="f18" line="29" inline="1"/>
  <PointerType id="_2588" type="_905" size="64" align="64"/>
  <PointerType id="_2589" type="_1041c" size="64" align="64"/>
  <Field id="_2590" name="response_type" type="_1478" offset="0" context="_400" access="public" location="f0:977" file="f0" line="977"/>
  <Field id="_2591" name="pad0" type="_1478" offset="8" context="_400" access="public" location="f0:978" file="f0" line="978"/>
  <Field id="_2592" name="sequence" type="_1399" offset="16" context="_400" access="public" location="f0:979" file="f0" line="979"/>
  <Field id="_2593" name="window" type="_680" offset="32" context="_400" access="public" location="f0:980" file="f0" line="980"/>
  <Field id="_2594" name="atom" type="_1679" offset="64" context="_400" access="public" location="f0:981" file="f0" line="981"/>
  <Field id="_2595" name="time" type="_1260" offset="96" context="_400" access="public" location="f0:982" file="f0" line="982"/>
  <Field id="_2596" name="state" type="_1478" offset="128" context="_400" access="public" location="f0:983" file="f0" line="983"/>
  <Field id="_2597" name="pad1" type="_5162" offset="136" context="_400" access="public" location="f0:984" file="f0" line="984"/>
  <Destructor id="_2598" name="xcb_property_notify_event_t" artificial="1" throw="" context="_400" access="public" mangled="_ZN27xcb_property_notify_event_tD1Ev *INTERNAL* " demangled="xcb_property_notify_event_t::~xcb_property_notify_event_t()" location="f0:976" file="f0" line="976" endline="976" inline="1">
  </Destructor>
  <OperatorMethod id="_2599" name="=" returns="_5321" artificial="1" throw="" context="_400" access="public" mangled="_ZN27xcb_property_notify_event_taSERKS_" demangled="xcb_property_notify_event_t::operator=(xcb_property_notify_event_t const&amp;)" location="f0:976" file="f0" line="976" endline="976" inline="1">
    <Argument type="_5322" location="f0:976" file="f0" line="976"/>
  </OperatorMethod>
  <Constructor id="_2600" name="xcb_property_notify_event_t" artificial="1" throw="" context="_400" access="public" mangled="_ZN27xcb_property_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_property_notify_event_t::xcb_property_notify_event_t(xcb_property_notify_event_t const&amp;)" location="f0:976" file="f0" line="976" endline="976" inline="1">
    <Argument type="_5322" location="f0:976" file="f0" line="976"/>
  </Constructor>
  <Constructor id="_2601" name="xcb_property_notify_event_t" artificial="1" throw="" context="_400" access="public" mangled="_ZN27xcb_property_notify_event_tC1Ev *INTERNAL* " demangled="xcb_property_notify_event_t::xcb_property_notify_event_t()" location="f0:976" file="f0" line="976" inline="1"/>
  <CvQualifiedType id="_1918r" type="_1918" restrict="1"/>
  <CvQualifiedType id="_2348r" type="_2348" restrict="1"/>
  <PointerType id="_2604" type="_776" size="64" align="64"/>
  <PointerType id="_2605" type="_788c" size="64" align="64"/>
  <Field id="_2606" name="response_type" type="_1478" offset="0" context="_414" access="public" location="f0:561" file="f0" line="561"/>
  <Field id="_2607" name="detail" type="_589" offset="8" context="_414" access="public" location="f0:562" file="f0" line="562"/>
  <Field id="_2608" name="sequence" type="_1399" offset="16" context="_414" access="public" location="f0:563" file="f0" line="563"/>
  <Field id="_2609" name="time" type="_1260" offset="32" context="_414" access="public" location="f0:564" file="f0" line="564"/>
  <Field id="_2610" name="root" type="_680" offset="64" context="_414" access="public" location="f0:565" file="f0" line="565"/>
  <Field id="_2611" name="event" type="_680" offset="96" context="_414" access="public" location="f0:566" file="f0" line="566"/>
  <Field id="_2612" name="child" type="_680" offset="128" context="_414" access="public" location="f0:567" file="f0" line="567"/>
  <Field id="_2613" name="root_x" type="_883" offset="160" context="_414" access="public" location="f0:568" file="f0" line="568"/>
  <Field id="_2614" name="root_y" type="_883" offset="176" context="_414" access="public" location="f0:569" file="f0" line="569"/>
  <Field id="_2615" name="event_x" type="_883" offset="192" context="_414" access="public" location="f0:570" file="f0" line="570"/>
  <Field id="_2616" name="event_y" type="_883" offset="208" context="_414" access="public" location="f0:571" file="f0" line="571"/>
  <Field id="_2617" name="state" type="_1399" offset="224" context="_414" access="public" location="f0:572" file="f0" line="572"/>
  <Field id="_2618" name="same_screen" type="_1478" offset="240" context="_414" access="public" location="f0:573" file="f0" line="573"/>
  <Field id="_2619" name="pad0" type="_1478" offset="248" context="_414" access="public" location="f0:574" file="f0" line="574"/>
  <Destructor id="_2620" name="xcb_button_press_event_t" artificial="1" throw="" context="_414" access="public" mangled="_ZN24xcb_button_press_event_tD1Ev *INTERNAL* " demangled="xcb_button_press_event_t::~xcb_button_press_event_t()" location="f0:560" file="f0" line="560" endline="560" inline="1">
  </Destructor>
  <OperatorMethod id="_2621" name="=" returns="_5324" artificial="1" throw="" context="_414" access="public" mangled="_ZN24xcb_button_press_event_taSERKS_" demangled="xcb_button_press_event_t::operator=(xcb_button_press_event_t const&amp;)" location="f0:560" file="f0" line="560" endline="560" inline="1">
    <Argument type="_5325" location="f0:560" file="f0" line="560"/>
  </OperatorMethod>
  <Constructor id="_2622" name="xcb_button_press_event_t" artificial="1" throw="" context="_414" access="public" mangled="_ZN24xcb_button_press_event_tC1ERKS_ *INTERNAL* " demangled="xcb_button_press_event_t::xcb_button_press_event_t(xcb_button_press_event_t const&amp;)" location="f0:560" file="f0" line="560" endline="560" inline="1">
    <Argument type="_5325" location="f0:560" file="f0" line="560"/>
  </Constructor>
  <Constructor id="_2623" name="xcb_button_press_event_t" artificial="1" throw="" context="_414" access="public" mangled="_ZN24xcb_button_press_event_tC1Ev *INTERNAL* " demangled="xcb_button_press_event_t::xcb_button_press_event_t()" location="f0:560" file="f0" line="560" inline="1"/>
  <PointerType id="_2624" type="_861c" size="64" align="64"/>
  <CvQualifiedType id="_2624r" type="_2624" restrict="1"/>
  <PointerType id="_2626" type="_1819" size="64" align="64"/>
  <FundamentalType id="_2627" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_2628" type="_1503" size="64" align="64"/>
  <PointerType id="_2629" type="_5327" size="64" align="64"/>
  <Field id="_2630" name="left_side_bearing" type="_883" offset="0" context="_428" access="public" location="f0:2466" file="f0" line="2466"/>
  <Field id="_2631" name="right_side_bearing" type="_883" offset="16" context="_428" access="public" location="f0:2467" file="f0" line="2467"/>
  <Field id="_2632" name="character_width" type="_883" offset="32" context="_428" access="public" location="f0:2468" file="f0" line="2468"/>
  <Field id="_2633" name="ascent" type="_883" offset="48" context="_428" access="public" location="f0:2469" file="f0" line="2469"/>
  <Field id="_2634" name="descent" type="_883" offset="64" context="_428" access="public" location="f0:2470" file="f0" line="2470"/>
  <Field id="_2635" name="attributes" type="_1399" offset="80" context="_428" access="public" location="f0:2471" file="f0" line="2471"/>
  <Destructor id="_2636" name="xcb_charinfo_t" artificial="1" throw="" context="_428" access="public" mangled="_ZN14xcb_charinfo_tD1Ev *INTERNAL* " demangled="xcb_charinfo_t::~xcb_charinfo_t()" location="f0:2465" file="f0" line="2465" endline="2465" inline="1">
  </Destructor>
  <OperatorMethod id="_2637" name="=" returns="_5328" artificial="1" throw="" context="_428" access="public" mangled="_ZN14xcb_charinfo_taSERKS_" demangled="xcb_charinfo_t::operator=(xcb_charinfo_t const&amp;)" location="f0:2465" file="f0" line="2465" endline="2465" inline="1">
    <Argument type="_5329" location="f0:2465" file="f0" line="2465"/>
  </OperatorMethod>
  <Constructor id="_2638" name="xcb_charinfo_t" artificial="1" throw="" context="_428" access="public" mangled="_ZN14xcb_charinfo_tC1ERKS_ *INTERNAL* " demangled="xcb_charinfo_t::xcb_charinfo_t(xcb_charinfo_t const&amp;)" location="f0:2465" file="f0" line="2465" endline="2465" inline="1">
    <Argument type="_5329" location="f0:2465" file="f0" line="2465"/>
  </Constructor>
  <Constructor id="_2639" name="xcb_charinfo_t" artificial="1" throw="" context="_428" access="public" mangled="_ZN14xcb_charinfo_tC1Ev *INTERNAL* " demangled="xcb_charinfo_t::xcb_charinfo_t()" location="f0:2465" file="f0" line="2465" inline="1"/>
  <Field id="_2640" name="major_opcode" type="_1478" offset="0" context="_432" access="public" location="f0:4307" file="f0" line="4307"/>
  <Field id="_2641" name="pad0" type="_1478" offset="8" context="_432" access="public" location="f0:4308" file="f0" line="4308"/>
  <Field id="_2642" name="length" type="_1399" offset="16" context="_432" access="public" location="f0:4309" file="f0" line="4309"/>
  <Destructor id="_2643" name="xcb_get_pointer_mapping_request_t" artificial="1" throw="" context="_432" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_tD1Ev *INTERNAL* " demangled="xcb_get_pointer_mapping_request_t::~xcb_get_pointer_mapping_request_t()" location="f0:4306" file="f0" line="4306" endline="4306" inline="1">
  </Destructor>
  <OperatorMethod id="_2644" name="=" returns="_5330" artificial="1" throw="" context="_432" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_taSERKS_" demangled="xcb_get_pointer_mapping_request_t::operator=(xcb_get_pointer_mapping_request_t const&amp;)" location="f0:4306" file="f0" line="4306" endline="4306" inline="1">
    <Argument type="_5331" location="f0:4306" file="f0" line="4306"/>
  </OperatorMethod>
  <Constructor id="_2645" name="xcb_get_pointer_mapping_request_t" artificial="1" throw="" context="_432" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_pointer_mapping_request_t::xcb_get_pointer_mapping_request_t(xcb_get_pointer_mapping_request_t const&amp;)" location="f0:4306" file="f0" line="4306" endline="4306" inline="1">
    <Argument type="_5331" location="f0:4306" file="f0" line="4306"/>
  </Constructor>
  <Constructor id="_2646" name="xcb_get_pointer_mapping_request_t" artificial="1" throw="" context="_432" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_tC1Ev *INTERNAL* " demangled="xcb_get_pointer_mapping_request_t::xcb_get_pointer_mapping_request_t()" location="f0:4306" file="f0" line="4306" inline="1"/>
  <Field id="_2647" name="response_type" type="_1478" offset="0" context="_434" access="public" location="f0:2507" file="f0" line="2507"/>
  <Field id="_2648" name="pad0" type="_1478" offset="8" context="_434" access="public" location="f0:2508" file="f0" line="2508"/>
  <Field id="_2649" name="sequence" type="_1399" offset="16" context="_434" access="public" location="f0:2509" file="f0" line="2509"/>
  <Field id="_2650" name="length" type="_699" offset="32" context="_434" access="public" location="f0:2510" file="f0" line="2510"/>
  <Field id="_2651" name="min_bounds" type="_429" offset="64" context="_434" access="public" location="f0:2511" file="f0" line="2511"/>
  <Field id="_2652" name="pad1" type="_5272" offset="160" context="_434" access="public" location="f0:2512" file="f0" line="2512"/>
  <Field id="_2653" name="max_bounds" type="_429" offset="192" context="_434" access="public" location="f0:2513" file="f0" line="2513"/>
  <Field id="_2654" name="pad2" type="_5272" offset="288" context="_434" access="public" location="f0:2514" file="f0" line="2514"/>
  <Field id="_2655" name="min_char_or_byte2" type="_1399" offset="320" context="_434" access="public" location="f0:2515" file="f0" line="2515"/>
  <Field id="_2656" name="max_char_or_byte2" type="_1399" offset="336" context="_434" access="public" location="f0:2516" file="f0" line="2516"/>
  <Field id="_2657" name="default_char" type="_1399" offset="352" context="_434" access="public" location="f0:2517" file="f0" line="2517"/>
  <Field id="_2658" name="properties_len" type="_1399" offset="368" context="_434" access="public" location="f0:2518" file="f0" line="2518"/>
  <Field id="_2659" name="draw_direction" type="_1478" offset="384" context="_434" access="public" location="f0:2519" file="f0" line="2519"/>
  <Field id="_2660" name="min_byte1" type="_1478" offset="392" context="_434" access="public" location="f0:2520" file="f0" line="2520"/>
  <Field id="_2661" name="max_byte1" type="_1478" offset="400" context="_434" access="public" location="f0:2521" file="f0" line="2521"/>
  <Field id="_2662" name="all_chars_exist" type="_1478" offset="408" context="_434" access="public" location="f0:2522" file="f0" line="2522"/>
  <Field id="_2663" name="font_ascent" type="_883" offset="416" context="_434" access="public" location="f0:2523" file="f0" line="2523"/>
  <Field id="_2664" name="font_descent" type="_883" offset="432" context="_434" access="public" location="f0:2524" file="f0" line="2524"/>
  <Field id="_2665" name="char_infos_len" type="_699" offset="448" context="_434" access="public" location="f0:2525" file="f0" line="2525"/>
  <Destructor id="_2666" name="xcb_query_font_reply_t" artificial="1" throw="" context="_434" access="public" mangled="_ZN22xcb_query_font_reply_tD1Ev *INTERNAL* " demangled="xcb_query_font_reply_t::~xcb_query_font_reply_t()" location="f0:2506" file="f0" line="2506" endline="2506" inline="1">
  </Destructor>
  <OperatorMethod id="_2667" name="=" returns="_5332" artificial="1" throw="" context="_434" access="public" mangled="_ZN22xcb_query_font_reply_taSERKS_" demangled="xcb_query_font_reply_t::operator=(xcb_query_font_reply_t const&amp;)" location="f0:2506" file="f0" line="2506" endline="2506" inline="1">
    <Argument type="_5333" location="f0:2506" file="f0" line="2506"/>
  </OperatorMethod>
  <Constructor id="_2668" name="xcb_query_font_reply_t" artificial="1" throw="" context="_434" access="public" mangled="_ZN22xcb_query_font_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_font_reply_t::xcb_query_font_reply_t(xcb_query_font_reply_t const&amp;)" location="f0:2506" file="f0" line="2506" endline="2506" inline="1">
    <Argument type="_5333" location="f0:2506" file="f0" line="2506"/>
  </Constructor>
  <Constructor id="_2669" name="xcb_query_font_reply_t" artificial="1" throw="" context="_434" access="public" mangled="_ZN22xcb_query_font_reply_tC1Ev *INTERNAL* " demangled="xcb_query_font_reply_t::xcb_query_font_reply_t()" location="f0:2506" file="f0" line="2506" inline="1"/>
  <PointerType id="_2670" type="_1080" size="64" align="64"/>
  <Field id="_2671" name="major_opcode" type="_1478" offset="0" context="_444" access="public" location="f0:1513" file="f0" line="1513"/>
  <Field id="_2672" name="pad0" type="_1478" offset="8" context="_444" access="public" location="f0:1514" file="f0" line="1514"/>
  <Field id="_2673" name="length" type="_1399" offset="16" context="_444" access="public" location="f0:1515" file="f0" line="1515"/>
  <Field id="_2674" name="window" type="_680" offset="32" context="_444" access="public" location="f0:1516" file="f0" line="1516"/>
  <Destructor id="_2675" name="xcb_map_subwindows_request_t" artificial="1" throw="" context="_444" access="public" mangled="_ZN28xcb_map_subwindows_request_tD1Ev *INTERNAL* " demangled="xcb_map_subwindows_request_t::~xcb_map_subwindows_request_t()" location="f0:1512" file="f0" line="1512" endline="1512" inline="1">
  </Destructor>
  <OperatorMethod id="_2676" name="=" returns="_5334" artificial="1" throw="" context="_444" access="public" mangled="_ZN28xcb_map_subwindows_request_taSERKS_" demangled="xcb_map_subwindows_request_t::operator=(xcb_map_subwindows_request_t const&amp;)" location="f0:1512" file="f0" line="1512" endline="1512" inline="1">
    <Argument type="_5335" location="f0:1512" file="f0" line="1512"/>
  </OperatorMethod>
  <Constructor id="_2677" name="xcb_map_subwindows_request_t" artificial="1" throw="" context="_444" access="public" mangled="_ZN28xcb_map_subwindows_request_tC1ERKS_ *INTERNAL* " demangled="xcb_map_subwindows_request_t::xcb_map_subwindows_request_t(xcb_map_subwindows_request_t const&amp;)" location="f0:1512" file="f0" line="1512" endline="1512" inline="1">
    <Argument type="_5335" location="f0:1512" file="f0" line="1512"/>
  </Constructor>
  <Constructor id="_2678" name="xcb_map_subwindows_request_t" artificial="1" throw="" context="_444" access="public" mangled="_ZN28xcb_map_subwindows_request_tC1Ev *INTERNAL* " demangled="xcb_map_subwindows_request_t::xcb_map_subwindows_request_t()" location="f0:1512" file="f0" line="1512" inline="1"/>
  <Field id="_2679" name="major_opcode" type="_1478" offset="0" context="_447" access="public" location="f0:1762" file="f0" line="1762"/>
  <Field id="_2680" name="pad0" type="_1478" offset="8" context="_447" access="public" location="f0:1763" file="f0" line="1763"/>
  <Field id="_2681" name="length" type="_1399" offset="16" context="_447" access="public" location="f0:1764" file="f0" line="1764"/>
  <Field id="_2682" name="window" type="_680" offset="32" context="_447" access="public" location="f0:1765" file="f0" line="1765"/>
  <Field id="_2683" name="property" type="_1679" offset="64" context="_447" access="public" location="f0:1766" file="f0" line="1766"/>
  <Destructor id="_2684" name="xcb_delete_property_request_t" artificial="1" throw="" context="_447" access="public" mangled="_ZN29xcb_delete_property_request_tD1Ev *INTERNAL* " demangled="xcb_delete_property_request_t::~xcb_delete_property_request_t()" location="f0:1761" file="f0" line="1761" endline="1761" inline="1">
  </Destructor>
  <OperatorMethod id="_2685" name="=" returns="_5336" artificial="1" throw="" context="_447" access="public" mangled="_ZN29xcb_delete_property_request_taSERKS_" demangled="xcb_delete_property_request_t::operator=(xcb_delete_property_request_t const&amp;)" location="f0:1761" file="f0" line="1761" endline="1761" inline="1">
    <Argument type="_5337" location="f0:1761" file="f0" line="1761"/>
  </OperatorMethod>
  <Constructor id="_2686" name="xcb_delete_property_request_t" artificial="1" throw="" context="_447" access="public" mangled="_ZN29xcb_delete_property_request_tC1ERKS_ *INTERNAL* " demangled="xcb_delete_property_request_t::xcb_delete_property_request_t(xcb_delete_property_request_t const&amp;)" location="f0:1761" file="f0" line="1761" endline="1761" inline="1">
    <Argument type="_5337" location="f0:1761" file="f0" line="1761"/>
  </Constructor>
  <Constructor id="_2687" name="xcb_delete_property_request_t" artificial="1" throw="" context="_447" access="public" mangled="_ZN29xcb_delete_property_request_tC1Ev *INTERNAL* " demangled="xcb_delete_property_request_t::xcb_delete_property_request_t()" location="f0:1761" file="f0" line="1761" inline="1"/>
  <PointerType id="_2688" type="_1249" size="64" align="64"/>
  <Field id="_2689" name="data" type="_5338" offset="0" context="_456" access="public" location="f0:314" file="f0" line="314"/>
  <Field id="_2690" name="rem" type="_184" offset="64" context="_456" access="public" location="f0:315" file="f0" line="315"/>
  <Field id="_2691" name="index" type="_184" offset="96" context="_456" access="public" location="f0:316" file="f0" line="316"/>
  <Destructor id="_2692" name="xcb_depth_iterator_t" artificial="1" throw="" context="_456" access="public" mangled="_ZN20xcb_depth_iterator_tD1Ev *INTERNAL* " demangled="xcb_depth_iterator_t::~xcb_depth_iterator_t()" location="f0:313" file="f0" line="313" endline="313" inline="1">
  </Destructor>
  <OperatorMethod id="_2693" name="=" returns="_5339" artificial="1" throw="" context="_456" access="public" mangled="_ZN20xcb_depth_iterator_taSERKS_" demangled="xcb_depth_iterator_t::operator=(xcb_depth_iterator_t const&amp;)" location="f0:313" file="f0" line="313" endline="313" inline="1">
    <Argument type="_5340" location="f0:313" file="f0" line="313"/>
  </OperatorMethod>
  <Constructor id="_2694" name="xcb_depth_iterator_t" artificial="1" throw="" context="_456" access="public" mangled="_ZN20xcb_depth_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_depth_iterator_t::xcb_depth_iterator_t(xcb_depth_iterator_t const&amp;)" location="f0:313" file="f0" line="313" endline="313" inline="1">
    <Argument type="_5340" location="f0:313" file="f0" line="313"/>
  </Constructor>
  <Constructor id="_2695" name="xcb_depth_iterator_t" artificial="1" throw="" context="_456" access="public" mangled="_ZN20xcb_depth_iterator_tC1Ev *INTERNAL* " demangled="xcb_depth_iterator_t::xcb_depth_iterator_t()" location="f0:313" file="f0" line="313" inline="1"/>
  <Field id="_2696" name="major_opcode" type="_1478" offset="0" context="_460" access="public" location="f0:3190" file="f0" line="3190"/>
  <Field id="_2697" name="pad0" type="_1478" offset="8" context="_460" access="public" location="f0:3191" file="f0" line="3191"/>
  <Field id="_2698" name="length" type="_1399" offset="16" context="_460" access="public" location="f0:3192" file="f0" line="3192"/>
  <Field id="_2699" name="drawable" type="_878" offset="32" context="_460" access="public" location="f0:3193" file="f0" line="3193"/>
  <Field id="_2700" name="gc" type="_1792" offset="64" context="_460" access="public" location="f0:3194" file="f0" line="3194"/>
  <Field id="_2701" name="x" type="_883" offset="96" context="_460" access="public" location="f0:3195" file="f0" line="3195"/>
  <Field id="_2702" name="y" type="_883" offset="112" context="_460" access="public" location="f0:3196" file="f0" line="3196"/>
  <Destructor id="_2703" name="xcb_poly_text_8_request_t" artificial="1" throw="" context="_460" access="public" mangled="_ZN25xcb_poly_text_8_request_tD1Ev *INTERNAL* " demangled="xcb_poly_text_8_request_t::~xcb_poly_text_8_request_t()" location="f0:3189" file="f0" line="3189" endline="3189" inline="1">
  </Destructor>
  <OperatorMethod id="_2704" name="=" returns="_5341" artificial="1" throw="" context="_460" access="public" mangled="_ZN25xcb_poly_text_8_request_taSERKS_" demangled="xcb_poly_text_8_request_t::operator=(xcb_poly_text_8_request_t const&amp;)" location="f0:3189" file="f0" line="3189" endline="3189" inline="1">
    <Argument type="_5342" location="f0:3189" file="f0" line="3189"/>
  </OperatorMethod>
  <Constructor id="_2705" name="xcb_poly_text_8_request_t" artificial="1" throw="" context="_460" access="public" mangled="_ZN25xcb_poly_text_8_request_tC1ERKS_ *INTERNAL* " demangled="xcb_poly_text_8_request_t::xcb_poly_text_8_request_t(xcb_poly_text_8_request_t const&amp;)" location="f0:3189" file="f0" line="3189" endline="3189" inline="1">
    <Argument type="_5342" location="f0:3189" file="f0" line="3189"/>
  </Constructor>
  <Constructor id="_2706" name="xcb_poly_text_8_request_t" artificial="1" throw="" context="_460" access="public" mangled="_ZN25xcb_poly_text_8_request_tC1Ev *INTERNAL* " demangled="xcb_poly_text_8_request_t::xcb_poly_text_8_request_t()" location="f0:3189" file="f0" line="3189" inline="1"/>
  <PointerType id="_2707" type="_1247" size="64" align="64"/>
  <PointerType id="_2708" type="_1088" size="64" align="64"/>
  <CvQualifiedType id="_2533r" type="_2533" restrict="1"/>
  <CvQualifiedType id="_1121r" type="_1121" restrict="1"/>
  <CvQualifiedType id="_184v" type="_184" volatile="1"/>
  <PointerType id="_2712" type="_1579" size="64" align="64"/>
  <PointerType id="_2713" type="_1733" size="64" align="64"/>
  <PointerType id="_2714" type="_98c" size="64" align="64"/>
  <Field id="_2715" name="response_type" type="_1478" offset="0" context="_474" access="public" location="f0:1165" file="f0" line="1165"/>
  <Field id="_2716" name="format" type="_1478" offset="8" context="_474" access="public" location="f0:1166" file="f0" line="1166"/>
  <Field id="_2717" name="sequence" type="_1399" offset="16" context="_474" access="public" location="f0:1167" file="f0" line="1167"/>
  <Field id="_2718" name="window" type="_680" offset="32" context="_474" access="public" location="f0:1168" file="f0" line="1168"/>
  <Field id="_2719" name="type" type="_1679" offset="64" context="_474" access="public" location="f0:1169" file="f0" line="1169"/>
  <Field id="_2720" name="data" type="_336" offset="96" context="_474" access="public" location="f0:1170" file="f0" line="1170"/>
  <Destructor id="_2721" name="xcb_client_message_event_t" artificial="1" throw="" context="_474" access="public" mangled="_ZN26xcb_client_message_event_tD1Ev *INTERNAL* " demangled="xcb_client_message_event_t::~xcb_client_message_event_t()" location="f0:1164" file="f0" line="1164" endline="1164" inline="1">
  </Destructor>
  <OperatorMethod id="_2722" name="=" returns="_5344" artificial="1" throw="" context="_474" access="public" mangled="_ZN26xcb_client_message_event_taSERKS_" demangled="xcb_client_message_event_t::operator=(xcb_client_message_event_t const&amp;)" location="f0:1164" file="f0" line="1164" endline="1164" inline="1">
    <Argument type="_5345" location="f0:1164" file="f0" line="1164"/>
  </OperatorMethod>
  <Constructor id="_2723" name="xcb_client_message_event_t" artificial="1" throw="" context="_474" access="public" mangled="_ZN26xcb_client_message_event_tC1ERKS_ *INTERNAL* " demangled="xcb_client_message_event_t::xcb_client_message_event_t(xcb_client_message_event_t const&amp;)" location="f0:1164" file="f0" line="1164" endline="1164" inline="1">
    <Argument type="_5345" location="f0:1164" file="f0" line="1164"/>
  </Constructor>
  <Constructor id="_2724" name="xcb_client_message_event_t" artificial="1" throw="" context="_474" access="public" mangled="_ZN26xcb_client_message_event_tC1Ev *INTERNAL* " demangled="xcb_client_message_event_t::xcb_client_message_event_t()" location="f0:1164" file="f0" line="1164" inline="1"/>
  <Field id="_2725" name="major_opcode" type="_1478" offset="0" context="_476" access="public" location="f0:3992" file="f0" line="3992"/>
  <Field id="_2726" name="pad0" type="_1478" offset="8" context="_476" access="public" location="f0:3993" file="f0" line="3993"/>
  <Field id="_2727" name="length" type="_1399" offset="16" context="_476" access="public" location="f0:3994" file="f0" line="3994"/>
  <Field id="_2728" name="acceleration_numerator" type="_883" offset="32" context="_476" access="public" location="f0:3995" file="f0" line="3995"/>
  <Field id="_2729" name="acceleration_denominator" type="_883" offset="48" context="_476" access="public" location="f0:3996" file="f0" line="3996"/>
  <Field id="_2730" name="threshold" type="_883" offset="64" context="_476" access="public" location="f0:3997" file="f0" line="3997"/>
  <Field id="_2731" name="do_acceleration" type="_1478" offset="80" context="_476" access="public" location="f0:3998" file="f0" line="3998"/>
  <Field id="_2732" name="do_threshold" type="_1478" offset="88" context="_476" access="public" location="f0:3999" file="f0" line="3999"/>
  <Destructor id="_2733" name="xcb_change_pointer_control_request_t" artificial="1" throw="" context="_476" access="public" mangled="_ZN36xcb_change_pointer_control_request_tD1Ev *INTERNAL* " demangled="xcb_change_pointer_control_request_t::~xcb_change_pointer_control_request_t()" location="f0:3991" file="f0" line="3991" endline="3991" inline="1">
  </Destructor>
  <OperatorMethod id="_2734" name="=" returns="_5346" artificial="1" throw="" context="_476" access="public" mangled="_ZN36xcb_change_pointer_control_request_taSERKS_" demangled="xcb_change_pointer_control_request_t::operator=(xcb_change_pointer_control_request_t const&amp;)" location="f0:3991" file="f0" line="3991" endline="3991" inline="1">
    <Argument type="_5347" location="f0:3991" file="f0" line="3991"/>
  </OperatorMethod>
  <Constructor id="_2735" name="xcb_change_pointer_control_request_t" artificial="1" throw="" context="_476" access="public" mangled="_ZN36xcb_change_pointer_control_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_pointer_control_request_t::xcb_change_pointer_control_request_t(xcb_change_pointer_control_request_t const&amp;)" location="f0:3991" file="f0" line="3991" endline="3991" inline="1">
    <Argument type="_5347" location="f0:3991" file="f0" line="3991"/>
  </Constructor>
  <Constructor id="_2736" name="xcb_change_pointer_control_request_t" artificial="1" throw="" context="_476" access="public" mangled="_ZN36xcb_change_pointer_control_request_tC1Ev *INTERNAL* " demangled="xcb_change_pointer_control_request_t::xcb_change_pointer_control_request_t()" location="f0:3991" file="f0" line="3991" inline="1"/>
  <Field id="_2737" name="response_type" type="_1478" offset="0" context="_485" access="public" location="f0:4025" file="f0" line="4025"/>
  <Field id="_2738" name="pad0" type="_1478" offset="8" context="_485" access="public" location="f0:4026" file="f0" line="4026"/>
  <Field id="_2739" name="sequence" type="_1399" offset="16" context="_485" access="public" location="f0:4027" file="f0" line="4027"/>
  <Field id="_2740" name="length" type="_699" offset="32" context="_485" access="public" location="f0:4028" file="f0" line="4028"/>
  <Field id="_2741" name="acceleration_numerator" type="_1399" offset="64" context="_485" access="public" location="f0:4029" file="f0" line="4029"/>
  <Field id="_2742" name="acceleration_denominator" type="_1399" offset="80" context="_485" access="public" location="f0:4030" file="f0" line="4030"/>
  <Field id="_2743" name="threshold" type="_1399" offset="96" context="_485" access="public" location="f0:4031" file="f0" line="4031"/>
  <Field id="_2744" name="pad1" type="_5348" offset="112" context="_485" access="public" location="f0:4032" file="f0" line="4032"/>
  <Destructor id="_2745" name="xcb_get_pointer_control_reply_t" artificial="1" throw="" context="_485" access="public" mangled="_ZN31xcb_get_pointer_control_reply_tD1Ev *INTERNAL* " demangled="xcb_get_pointer_control_reply_t::~xcb_get_pointer_control_reply_t()" location="f0:4024" file="f0" line="4024" endline="4024" inline="1">
  </Destructor>
  <OperatorMethod id="_2746" name="=" returns="_5349" artificial="1" throw="" context="_485" access="public" mangled="_ZN31xcb_get_pointer_control_reply_taSERKS_" demangled="xcb_get_pointer_control_reply_t::operator=(xcb_get_pointer_control_reply_t const&amp;)" location="f0:4024" file="f0" line="4024" endline="4024" inline="1">
    <Argument type="_5350" location="f0:4024" file="f0" line="4024"/>
  </OperatorMethod>
  <Constructor id="_2747" name="xcb_get_pointer_control_reply_t" artificial="1" throw="" context="_485" access="public" mangled="_ZN31xcb_get_pointer_control_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_pointer_control_reply_t::xcb_get_pointer_control_reply_t(xcb_get_pointer_control_reply_t const&amp;)" location="f0:4024" file="f0" line="4024" endline="4024" inline="1">
    <Argument type="_5350" location="f0:4024" file="f0" line="4024"/>
  </Constructor>
  <Constructor id="_2748" name="xcb_get_pointer_control_reply_t" artificial="1" throw="" context="_485" access="public" mangled="_ZN31xcb_get_pointer_control_reply_tC1Ev *INTERNAL* " demangled="xcb_get_pointer_control_reply_t::xcb_get_pointer_control_reply_t()" location="f0:4024" file="f0" line="4024" inline="1"/>
  <Field id="_2749" name="__cancel_routine" type="_2629" offset="0" context="_488" access="public" location="f4:526" file="f4" line="526"/>
  <Field id="_2750" name="__cancel_arg" type="_503" offset="64" context="_488" access="public" location="f4:527" file="f4" line="527"/>
  <Field id="_2751" name="__do_it" type="_184" offset="128" context="_488" access="public" location="f4:528" file="f4" line="528"/>
  <Field id="_2752" name="__cancel_type" type="_184" offset="160" context="_488" access="public" location="f4:529" file="f4" line="529"/>
  <Destructor id="_2753" name="__pthread_cleanup_frame" artificial="1" throw="" context="_488" access="public" mangled="_ZN23__pthread_cleanup_frameD1Ev *INTERNAL* " demangled="__pthread_cleanup_frame::~__pthread_cleanup_frame()" location="f4:525" file="f4" line="525" endline="525" inline="1">
  </Destructor>
  <OperatorMethod id="_2754" name="=" returns="_5351" artificial="1" throw="" context="_488" access="public" mangled="_ZN23__pthread_cleanup_frameaSERKS_" demangled="__pthread_cleanup_frame::operator=(__pthread_cleanup_frame const&amp;)" location="f4:525" file="f4" line="525" endline="525" inline="1">
    <Argument type="_5352" location="f4:525" file="f4" line="525"/>
  </OperatorMethod>
  <Constructor id="_2755" name="__pthread_cleanup_frame" artificial="1" throw="" context="_488" access="public" mangled="_ZN23__pthread_cleanup_frameC1ERKS_ *INTERNAL* " demangled="__pthread_cleanup_frame::__pthread_cleanup_frame(__pthread_cleanup_frame const&amp;)" location="f4:525" file="f4" line="525" endline="525" inline="1">
    <Argument type="_5352" location="f4:525" file="f4" line="525"/>
  </Constructor>
  <Constructor id="_2756" name="__pthread_cleanup_frame" artificial="1" throw="" context="_488" access="public" mangled="_ZN23__pthread_cleanup_frameC1Ev *INTERNAL* " demangled="__pthread_cleanup_frame::__pthread_cleanup_frame()" location="f4:525" file="f4" line="525" inline="1"/>
  <Field id="_2757" name="response_type" type="_1478" offset="0" context="_492" access="public" location="f0:1882" file="f0" line="1882"/>
  <Field id="_2758" name="pad0" type="_1478" offset="8" context="_492" access="public" location="f0:1883" file="f0" line="1883"/>
  <Field id="_2759" name="sequence" type="_1399" offset="16" context="_492" access="public" location="f0:1884" file="f0" line="1884"/>
  <Field id="_2760" name="length" type="_699" offset="32" context="_492" access="public" location="f0:1885" file="f0" line="1885"/>
  <Field id="_2761" name="owner" type="_680" offset="64" context="_492" access="public" location="f0:1886" file="f0" line="1886"/>
  <Destructor id="_2762" name="xcb_get_selection_owner_reply_t" artificial="1" throw="" context="_492" access="public" mangled="_ZN31xcb_get_selection_owner_reply_tD1Ev *INTERNAL* " demangled="xcb_get_selection_owner_reply_t::~xcb_get_selection_owner_reply_t()" location="f0:1881" file="f0" line="1881" endline="1881" inline="1">
  </Destructor>
  <OperatorMethod id="_2763" name="=" returns="_5353" artificial="1" throw="" context="_492" access="public" mangled="_ZN31xcb_get_selection_owner_reply_taSERKS_" demangled="xcb_get_selection_owner_reply_t::operator=(xcb_get_selection_owner_reply_t const&amp;)" location="f0:1881" file="f0" line="1881" endline="1881" inline="1">
    <Argument type="_5354" location="f0:1881" file="f0" line="1881"/>
  </OperatorMethod>
  <Constructor id="_2764" name="xcb_get_selection_owner_reply_t" artificial="1" throw="" context="_492" access="public" mangled="_ZN31xcb_get_selection_owner_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_selection_owner_reply_t::xcb_get_selection_owner_reply_t(xcb_get_selection_owner_reply_t const&amp;)" location="f0:1881" file="f0" line="1881" endline="1881" inline="1">
    <Argument type="_5354" location="f0:1881" file="f0" line="1881"/>
  </Constructor>
  <Constructor id="_2765" name="xcb_get_selection_owner_reply_t" artificial="1" throw="" context="_492" access="public" mangled="_ZN31xcb_get_selection_owner_reply_tC1Ev *INTERNAL* " demangled="xcb_get_selection_owner_reply_t::xcb_get_selection_owner_reply_t()" location="f0:1881" file="f0" line="1881" inline="1"/>
  <Field id="_2766" name="major_opcode" type="_1478" offset="0" context="_496" access="public" location="f0:3770" file="f0" line="3770"/>
  <Field id="_2767" name="_class" type="_1478" offset="8" context="_496" access="public" location="f0:3771" file="f0" line="3771"/>
  <Field id="_2768" name="length" type="_1399" offset="16" context="_496" access="public" location="f0:3772" file="f0" line="3772"/>
  <Field id="_2769" name="drawable" type="_878" offset="32" context="_496" access="public" location="f0:3773" file="f0" line="3773"/>
  <Field id="_2770" name="width" type="_1399" offset="64" context="_496" access="public" location="f0:3774" file="f0" line="3774"/>
  <Field id="_2771" name="height" type="_1399" offset="80" context="_496" access="public" location="f0:3775" file="f0" line="3775"/>
  <Destructor id="_2772" name="xcb_query_best_size_request_t" artificial="1" throw="" context="_496" access="public" mangled="_ZN29xcb_query_best_size_request_tD1Ev *INTERNAL* " demangled="xcb_query_best_size_request_t::~xcb_query_best_size_request_t()" location="f0:3769" file="f0" line="3769" endline="3769" inline="1">
  </Destructor>
  <OperatorMethod id="_2773" name="=" returns="_5355" artificial="1" throw="" context="_496" access="public" mangled="_ZN29xcb_query_best_size_request_taSERKS_" demangled="xcb_query_best_size_request_t::operator=(xcb_query_best_size_request_t const&amp;)" location="f0:3769" file="f0" line="3769" endline="3769" inline="1">
    <Argument type="_5356" location="f0:3769" file="f0" line="3769"/>
  </OperatorMethod>
  <Constructor id="_2774" name="xcb_query_best_size_request_t" artificial="1" throw="" context="_496" access="public" mangled="_ZN29xcb_query_best_size_request_tC1ERKS_ *INTERNAL* " demangled="xcb_query_best_size_request_t::xcb_query_best_size_request_t(xcb_query_best_size_request_t const&amp;)" location="f0:3769" file="f0" line="3769" endline="3769" inline="1">
    <Argument type="_5356" location="f0:3769" file="f0" line="3769"/>
  </Constructor>
  <Constructor id="_2775" name="xcb_query_best_size_request_t" artificial="1" throw="" context="_496" access="public" mangled="_ZN29xcb_query_best_size_request_tC1Ev *INTERNAL* " demangled="xcb_query_best_size_request_t::xcb_query_best_size_request_t()" location="f0:3769" file="f0" line="3769" inline="1"/>
  <CvQualifiedType id="_2067r" type="_2067" restrict="1"/>
  <PointerType id="_2777" type="_1135c" size="64" align="64"/>
  <PointerType id="_2778" type="_1887" size="64" align="64"/>
  <PointerType id="_2779" type="_547" size="64" align="64"/>
  <Field id="_2780" name="major_opcode" type="_1478" offset="0" context="_508" access="public" location="f0:2345" file="f0" line="2345"/>
  <Field id="_2781" name="revert_to" type="_1478" offset="8" context="_508" access="public" location="f0:2346" file="f0" line="2346"/>
  <Field id="_2782" name="length" type="_1399" offset="16" context="_508" access="public" location="f0:2347" file="f0" line="2347"/>
  <Field id="_2783" name="focus" type="_680" offset="32" context="_508" access="public" location="f0:2348" file="f0" line="2348"/>
  <Field id="_2784" name="time" type="_1260" offset="64" context="_508" access="public" location="f0:2349" file="f0" line="2349"/>
  <Destructor id="_2785" name="xcb_set_input_focus_request_t" artificial="1" throw="" context="_508" access="public" mangled="_ZN29xcb_set_input_focus_request_tD1Ev *INTERNAL* " demangled="xcb_set_input_focus_request_t::~xcb_set_input_focus_request_t()" location="f0:2344" file="f0" line="2344" endline="2344" inline="1">
  </Destructor>
  <OperatorMethod id="_2786" name="=" returns="_5358" artificial="1" throw="" context="_508" access="public" mangled="_ZN29xcb_set_input_focus_request_taSERKS_" demangled="xcb_set_input_focus_request_t::operator=(xcb_set_input_focus_request_t const&amp;)" location="f0:2344" file="f0" line="2344" endline="2344" inline="1">
    <Argument type="_5359" location="f0:2344" file="f0" line="2344"/>
  </OperatorMethod>
  <Constructor id="_2787" name="xcb_set_input_focus_request_t" artificial="1" throw="" context="_508" access="public" mangled="_ZN29xcb_set_input_focus_request_tC1ERKS_ *INTERNAL* " demangled="xcb_set_input_focus_request_t::xcb_set_input_focus_request_t(xcb_set_input_focus_request_t const&amp;)" location="f0:2344" file="f0" line="2344" endline="2344" inline="1">
    <Argument type="_5359" location="f0:2344" file="f0" line="2344"/>
  </Constructor>
  <Constructor id="_2788" name="xcb_set_input_focus_request_t" artificial="1" throw="" context="_508" access="public" mangled="_ZN29xcb_set_input_focus_request_tC1Ev *INTERNAL* " demangled="xcb_set_input_focus_request_t::xcb_set_input_focus_request_t()" location="f0:2344" file="f0" line="2344" inline="1"/>
  <PointerType id="_2789" type="_1064c" size="64" align="64"/>
  <Field id="_2790" name="response_type" type="_1478" offset="0" context="_511" access="public" location="f0:1412" file="f0" line="1412"/>
  <Field id="_2791" name="backing_store" type="_1478" offset="8" context="_511" access="public" location="f0:1413" file="f0" line="1413"/>
  <Field id="_2792" name="sequence" type="_1399" offset="16" context="_511" access="public" location="f0:1414" file="f0" line="1414"/>
  <Field id="_2793" name="length" type="_699" offset="32" context="_511" access="public" location="f0:1415" file="f0" line="1415"/>
  <Field id="_2794" name="visual" type="_1781" offset="64" context="_511" access="public" location="f0:1416" file="f0" line="1416"/>
  <Field id="_2795" name="_class" type="_1399" offset="96" context="_511" access="public" location="f0:1417" file="f0" line="1417"/>
  <Field id="_2796" name="bit_gravity" type="_1478" offset="112" context="_511" access="public" location="f0:1418" file="f0" line="1418"/>
  <Field id="_2797" name="win_gravity" type="_1478" offset="120" context="_511" access="public" location="f0:1419" file="f0" line="1419"/>
  <Field id="_2798" name="backing_planes" type="_699" offset="128" context="_511" access="public" location="f0:1420" file="f0" line="1420"/>
  <Field id="_2799" name="backing_pixel" type="_699" offset="160" context="_511" access="public" location="f0:1421" file="f0" line="1421"/>
  <Field id="_2800" name="save_under" type="_1478" offset="192" context="_511" access="public" location="f0:1422" file="f0" line="1422"/>
  <Field id="_2801" name="map_is_installed" type="_1478" offset="200" context="_511" access="public" location="f0:1423" file="f0" line="1423"/>
  <Field id="_2802" name="map_state" type="_1478" offset="208" context="_511" access="public" location="f0:1424" file="f0" line="1424"/>
  <Field id="_2803" name="override_redirect" type="_1478" offset="216" context="_511" access="public" location="f0:1425" file="f0" line="1425"/>
  <Field id="_2804" name="colormap" type="_720" offset="224" context="_511" access="public" location="f0:1426" file="f0" line="1426"/>
  <Field id="_2805" name="all_event_masks" type="_699" offset="256" context="_511" access="public" location="f0:1427" file="f0" line="1427"/>
  <Field id="_2806" name="your_event_mask" type="_699" offset="288" context="_511" access="public" location="f0:1428" file="f0" line="1428"/>
  <Field id="_2807" name="do_not_propagate_mask" type="_1399" offset="320" context="_511" access="public" location="f0:1429" file="f0" line="1429"/>
  <Field id="_2808" name="pad0" type="_5156" offset="336" context="_511" access="public" location="f0:1430" file="f0" line="1430"/>
  <Destructor id="_2809" name="xcb_get_window_attributes_reply_t" artificial="1" throw="" context="_511" access="public" mangled="_ZN33xcb_get_window_attributes_reply_tD1Ev *INTERNAL* " demangled="xcb_get_window_attributes_reply_t::~xcb_get_window_attributes_reply_t()" location="f0:1411" file="f0" line="1411" endline="1411" inline="1">
  </Destructor>
  <OperatorMethod id="_2810" name="=" returns="_5361" artificial="1" throw="" context="_511" access="public" mangled="_ZN33xcb_get_window_attributes_reply_taSERKS_" demangled="xcb_get_window_attributes_reply_t::operator=(xcb_get_window_attributes_reply_t const&amp;)" location="f0:1411" file="f0" line="1411" endline="1411" inline="1">
    <Argument type="_5362" location="f0:1411" file="f0" line="1411"/>
  </OperatorMethod>
  <Constructor id="_2811" name="xcb_get_window_attributes_reply_t" artificial="1" throw="" context="_511" access="public" mangled="_ZN33xcb_get_window_attributes_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_window_attributes_reply_t::xcb_get_window_attributes_reply_t(xcb_get_window_attributes_reply_t const&amp;)" location="f0:1411" file="f0" line="1411" endline="1411" inline="1">
    <Argument type="_5362" location="f0:1411" file="f0" line="1411"/>
  </Constructor>
  <Constructor id="_2812" name="xcb_get_window_attributes_reply_t" artificial="1" throw="" context="_511" access="public" mangled="_ZN33xcb_get_window_attributes_reply_tC1Ev *INTERNAL* " demangled="xcb_get_window_attributes_reply_t::xcb_get_window_attributes_reply_t()" location="f0:1411" file="f0" line="1411" inline="1"/>
  <PointerType id="_2813" type="_1010" size="64" align="64"/>
  <PointerType id="_2814" type="_346" size="64" align="64"/>
  <Field id="_2815" name="__data" type="_2818" offset="0" context="_528" access="public" location="f9:127" file="f9" line="127"/>
  <Field id="_2816" name="__size" type="_5363" offset="0" context="_528" access="public" location="f9:128" file="f9" line="128"/>
  <Field id="_2817" name="__align" type="_1998" offset="0" context="_528" access="public" location="f9:129" file="f9" line="129"/>
  <Struct id="_2818" context="_528" access="public" mangled="N14pthread_cond_t3._7E" demangled="pthread_cond_t::._7" location="f9:118" file="f9" line="118" artificial="1" size="384" align="64" members="_5364 _5365 _5366 _5367 _5368 _5369 _5370 _5371 _5372 _5373 _5374 _5375 " bases=""/>
  <Destructor id="_2819" name="._6" artificial="1" throw="" context="_528" access="public" mangled="_ZN14pthread_cond_tD1Ev *INTERNAL* " demangled="pthread_cond_t::~pthread_cond_t()" location="f9:130" file="f9" line="130" endline="130" inline="1">
  </Destructor>
  <OperatorMethod id="_2820" name="=" returns="_5376" artificial="1" throw="" context="_528" access="public" mangled="_ZN14pthread_cond_taSERKS_" demangled="pthread_cond_t::operator=(pthread_cond_t const&amp;)" location="f9:130" file="f9" line="130" endline="130" inline="1">
    <Argument type="_5377" location="f9:116" file="f9" line="116"/>
  </OperatorMethod>
  <Constructor id="_2821" name="._6" artificial="1" throw="" context="_528" access="public" mangled="_ZN14pthread_cond_tC1ERKS_ *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t(pthread_cond_t const&amp;)" location="f9:130" file="f9" line="130" endline="130" inline="1">
    <Argument type="_5377" location="f9:116" file="f9" line="116"/>
  </Constructor>
  <Constructor id="_2822" name="._6" artificial="1" throw="" context="_528" access="public" mangled="_ZN14pthread_cond_tC1Ev *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t()" location="f9:130" file="f9" line="130" inline="1"/>
  <Field id="_2823" name="response_type" type="_1478" offset="0" context="_538" access="public" location="f0:3782" file="f0" line="3782"/>
  <Field id="_2824" name="pad0" type="_1478" offset="8" context="_538" access="public" location="f0:3783" file="f0" line="3783"/>
  <Field id="_2825" name="sequence" type="_1399" offset="16" context="_538" access="public" location="f0:3784" file="f0" line="3784"/>
  <Field id="_2826" name="length" type="_699" offset="32" context="_538" access="public" location="f0:3785" file="f0" line="3785"/>
  <Field id="_2827" name="width" type="_1399" offset="64" context="_538" access="public" location="f0:3786" file="f0" line="3786"/>
  <Field id="_2828" name="height" type="_1399" offset="80" context="_538" access="public" location="f0:3787" file="f0" line="3787"/>
  <Destructor id="_2829" name="xcb_query_best_size_reply_t" artificial="1" throw="" context="_538" access="public" mangled="_ZN27xcb_query_best_size_reply_tD1Ev *INTERNAL* " demangled="xcb_query_best_size_reply_t::~xcb_query_best_size_reply_t()" location="f0:3781" file="f0" line="3781" endline="3781" inline="1">
  </Destructor>
  <OperatorMethod id="_2830" name="=" returns="_5378" artificial="1" throw="" context="_538" access="public" mangled="_ZN27xcb_query_best_size_reply_taSERKS_" demangled="xcb_query_best_size_reply_t::operator=(xcb_query_best_size_reply_t const&amp;)" location="f0:3781" file="f0" line="3781" endline="3781" inline="1">
    <Argument type="_5379" location="f0:3781" file="f0" line="3781"/>
  </OperatorMethod>
  <Constructor id="_2831" name="xcb_query_best_size_reply_t" artificial="1" throw="" context="_538" access="public" mangled="_ZN27xcb_query_best_size_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_best_size_reply_t::xcb_query_best_size_reply_t(xcb_query_best_size_reply_t const&amp;)" location="f0:3781" file="f0" line="3781" endline="3781" inline="1">
    <Argument type="_5379" location="f0:3781" file="f0" line="3781"/>
  </Constructor>
  <Constructor id="_2832" name="xcb_query_best_size_reply_t" artificial="1" throw="" context="_538" access="public" mangled="_ZN27xcb_query_best_size_reply_tC1Ev *INTERNAL* " demangled="xcb_query_best_size_reply_t::xcb_query_best_size_reply_t()" location="f0:3781" file="f0" line="3781" inline="1"/>
  <Field id="_2833" name="data" type="_5380" offset="0" context="_543" access="public" location="f0:55" file="f0" line="55"/>
  <Field id="_2834" name="rem" type="_184" offset="64" context="_543" access="public" location="f0:56" file="f0" line="56"/>
  <Field id="_2835" name="index" type="_184" offset="96" context="_543" access="public" location="f0:57" file="f0" line="57"/>
  <Destructor id="_2836" name="xcb_pixmap_iterator_t" artificial="1" throw="" context="_543" access="public" mangled="_ZN21xcb_pixmap_iterator_tD1Ev *INTERNAL* " demangled="xcb_pixmap_iterator_t::~xcb_pixmap_iterator_t()" location="f0:54" file="f0" line="54" endline="54" inline="1">
  </Destructor>
  <OperatorMethod id="_2837" name="=" returns="_5381" artificial="1" throw="" context="_543" access="public" mangled="_ZN21xcb_pixmap_iterator_taSERKS_" demangled="xcb_pixmap_iterator_t::operator=(xcb_pixmap_iterator_t const&amp;)" location="f0:54" file="f0" line="54" endline="54" inline="1">
    <Argument type="_5382" location="f0:54" file="f0" line="54"/>
  </OperatorMethod>
  <Constructor id="_2838" name="xcb_pixmap_iterator_t" artificial="1" throw="" context="_543" access="public" mangled="_ZN21xcb_pixmap_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_pixmap_iterator_t::xcb_pixmap_iterator_t(xcb_pixmap_iterator_t const&amp;)" location="f0:54" file="f0" line="54" endline="54" inline="1">
    <Argument type="_5382" location="f0:54" file="f0" line="54"/>
  </Constructor>
  <Constructor id="_2839" name="xcb_pixmap_iterator_t" artificial="1" throw="" context="_543" access="public" mangled="_ZN21xcb_pixmap_iterator_tC1Ev *INTERNAL* " demangled="xcb_pixmap_iterator_t::xcb_pixmap_iterator_t()" location="f0:54" file="f0" line="54" inline="1"/>
  <PointerType id="_2840" type="_1121" size="64" align="64"/>
  <Field id="_2841" name="modes" type="_151" offset="0" context="_546" access="public" location="f20:26" file="f20" line="26"/>
  <Field id="_2842" name="offset" type="_32" offset="64" context="_546" access="public" location="f20:27" file="f20" line="27"/>
  <Field id="_2843" name="freq" type="_32" offset="128" context="_546" access="public" location="f20:28" file="f20" line="28"/>
  <Field id="_2844" name="maxerror" type="_32" offset="192" context="_546" access="public" location="f20:29" file="f20" line="29"/>
  <Field id="_2845" name="esterror" type="_32" offset="256" context="_546" access="public" location="f20:30" file="f20" line="30"/>
  <Field id="_2846" name="status" type="_184" offset="320" context="_546" access="public" location="f20:31" file="f20" line="31"/>
  <Field id="_2847" name="constant" type="_32" offset="384" context="_546" access="public" location="f20:32" file="f20" line="32"/>
  <Field id="_2848" name="precision" type="_32" offset="448" context="_546" access="public" location="f20:33" file="f20" line="33"/>
  <Field id="_2849" name="tolerance" type="_32" offset="512" context="_546" access="public" location="f20:34" file="f20" line="34"/>
  <Field id="_2850" name="time" type="_19" offset="576" context="_546" access="public" location="f20:35" file="f20" line="35"/>
  <Field id="_2851" name="tick" type="_32" offset="704" context="_546" access="public" location="f20:36" file="f20" line="36"/>
  <Field id="_2852" name="ppsfreq" type="_32" offset="768" context="_546" access="public" location="f20:38" file="f20" line="38"/>
  <Field id="_2853" name="jitter" type="_32" offset="832" context="_546" access="public" location="f20:39" file="f20" line="39"/>
  <Field id="_2854" name="shift" type="_184" offset="896" context="_546" access="public" location="f20:40" file="f20" line="40"/>
  <Field id="_2855" name="stabil" type="_32" offset="960" context="_546" access="public" location="f20:41" file="f20" line="41"/>
  <Field id="_2856" name="jitcnt" type="_32" offset="1024" context="_546" access="public" location="f20:42" file="f20" line="42"/>
  <Field id="_2857" name="calcnt" type="_32" offset="1088" context="_546" access="public" location="f20:43" file="f20" line="43"/>
  <Field id="_2858" name="errcnt" type="_32" offset="1152" context="_546" access="public" location="f20:44" file="f20" line="44"/>
  <Field id="_2859" name="stbcnt" type="_32" offset="1216" context="_546" access="public" location="f20:45" file="f20" line="45"/>
  <Field id="_2860" name="tai" type="_184" offset="1280" context="_546" access="public" location="f20:47" file="f20" line="47"/>
  <Field id="_2861" name="" bits="32" type="_184" offset="1312" context="_546" access="public" location="f20:50" file="f20" line="50"/>
  <Field id="_2862" name="" bits="32" type="_184" offset="1344" context="_546" access="public" location="f20:50" file="f20" line="50"/>
  <Field id="_2863" name="" bits="32" type="_184" offset="1376" context="_546" access="public" location="f20:50" file="f20" line="50"/>
  <Field id="_2864" name="" bits="32" type="_184" offset="1408" context="_546" access="public" location="f20:50" file="f20" line="50"/>
  <Field id="_2865" name="" bits="32" type="_184" offset="1440" context="_546" access="public" location="f20:51" file="f20" line="51"/>
  <Field id="_2866" name="" bits="32" type="_184" offset="1472" context="_546" access="public" location="f20:51" file="f20" line="51"/>
  <Field id="_2867" name="" bits="32" type="_184" offset="1504" context="_546" access="public" location="f20:51" file="f20" line="51"/>
  <Field id="_2868" name="" bits="32" type="_184" offset="1536" context="_546" access="public" location="f20:51" file="f20" line="51"/>
  <Field id="_2869" name="" bits="32" type="_184" offset="1568" context="_546" access="public" location="f20:52" file="f20" line="52"/>
  <Field id="_2870" name="" bits="32" type="_184" offset="1600" context="_546" access="public" location="f20:52" file="f20" line="52"/>
  <Field id="_2871" name="" bits="32" type="_184" offset="1632" context="_546" access="public" location="f20:52" file="f20" line="52"/>
  <Destructor id="_2872" name="timex" artificial="1" throw="" context="_546" access="public" mangled="_ZN5timexD1Ev *INTERNAL* " demangled="timex::~timex()" location="f20:25" file="f20" line="25" endline="25" inline="1">
  </Destructor>
  <OperatorMethod id="_2873" name="=" returns="_5383" artificial="1" throw="" context="_546" access="public" mangled="_ZN5timexaSERKS_" demangled="timex::operator=(timex const&amp;)" location="f20:25" file="f20" line="25" endline="25" inline="1">
    <Argument type="_5384" location="f20:25" file="f20" line="25"/>
  </OperatorMethod>
  <Constructor id="_2874" name="timex" artificial="1" throw="" context="_546" access="public" mangled="_ZN5timexC1ERKS_ *INTERNAL* " demangled="timex::timex(timex const&amp;)" location="f20:25" file="f20" line="25" endline="25" inline="1">
    <Argument type="_5384" location="f20:25" file="f20" line="25"/>
  </Constructor>
  <Constructor id="_2875" name="timex" artificial="1" throw="" context="_546" access="public" mangled="_ZN5timexC1Ev *INTERNAL* " demangled="timex::timex()" location="f20:25" file="f20" line="25" inline="1"/>
  <Field id="_2876" name="__size" type="_5385" offset="0" context="_547" access="public" location="f9:208" file="f9" line="208"/>
  <Field id="_2877" name="__align" type="_32" offset="0" context="_547" access="public" location="f9:209" file="f9" line="209"/>
  <Destructor id="_2878" name="._12" artificial="1" throw="" context="_547" access="public" mangled="_ZN17pthread_barrier_tD1Ev *INTERNAL* " demangled="pthread_barrier_t::~pthread_barrier_t()" location="f9:210" file="f9" line="210" endline="210" inline="1">
  </Destructor>
  <OperatorMethod id="_2879" name="=" returns="_5386" artificial="1" throw="" context="_547" access="public" mangled="_ZN17pthread_barrier_taSERKS_" demangled="pthread_barrier_t::operator=(pthread_barrier_t const&amp;)" location="f9:210" file="f9" line="210" endline="210" inline="1">
    <Argument type="_5387" location="f9:207" file="f9" line="207"/>
  </OperatorMethod>
  <Constructor id="_2880" name="._12" artificial="1" throw="" context="_547" access="public" mangled="_ZN17pthread_barrier_tC1ERKS_ *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t(pthread_barrier_t const&amp;)" location="f9:210" file="f9" line="210" endline="210" inline="1">
    <Argument type="_5387" location="f9:207" file="f9" line="207"/>
  </Constructor>
  <Constructor id="_2881" name="._12" artificial="1" throw="" context="_547" access="public" mangled="_ZN17pthread_barrier_tC1Ev *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t()" location="f9:210" file="f9" line="210" inline="1"/>
  <Field id="_2882" name="major_opcode" type="_1478" offset="0" context="_549" access="public" location="f0:1825" file="f0" line="1825"/>
  <Field id="_2883" name="pad0" type="_1478" offset="8" context="_549" access="public" location="f0:1826" file="f0" line="1826"/>
  <Field id="_2884" name="length" type="_1399" offset="16" context="_549" access="public" location="f0:1827" file="f0" line="1827"/>
  <Field id="_2885" name="window" type="_680" offset="32" context="_549" access="public" location="f0:1828" file="f0" line="1828"/>
  <Destructor id="_2886" name="xcb_list_properties_request_t" artificial="1" throw="" context="_549" access="public" mangled="_ZN29xcb_list_properties_request_tD1Ev *INTERNAL* " demangled="xcb_list_properties_request_t::~xcb_list_properties_request_t()" location="f0:1824" file="f0" line="1824" endline="1824" inline="1">
  </Destructor>
  <OperatorMethod id="_2887" name="=" returns="_5388" artificial="1" throw="" context="_549" access="public" mangled="_ZN29xcb_list_properties_request_taSERKS_" demangled="xcb_list_properties_request_t::operator=(xcb_list_properties_request_t const&amp;)" location="f0:1824" file="f0" line="1824" endline="1824" inline="1">
    <Argument type="_5389" location="f0:1824" file="f0" line="1824"/>
  </OperatorMethod>
  <Constructor id="_2888" name="xcb_list_properties_request_t" artificial="1" throw="" context="_549" access="public" mangled="_ZN29xcb_list_properties_request_tC1ERKS_ *INTERNAL* " demangled="xcb_list_properties_request_t::xcb_list_properties_request_t(xcb_list_properties_request_t const&amp;)" location="f0:1824" file="f0" line="1824" endline="1824" inline="1">
    <Argument type="_5389" location="f0:1824" file="f0" line="1824"/>
  </Constructor>
  <Constructor id="_2889" name="xcb_list_properties_request_t" artificial="1" throw="" context="_549" access="public" mangled="_ZN29xcb_list_properties_request_tC1Ev *INTERNAL* " demangled="xcb_list_properties_request_t::xcb_list_properties_request_t()" location="f0:1824" file="f0" line="1824" inline="1"/>
  <PointerType id="_2890" type="_601" size="64" align="64"/>
  <Field id="_2891" name="status" type="_1478" offset="0" context="_563" access="public" location="f0:431" file="f0" line="431"/>
  <Field id="_2892" name="pad0" type="_5390" offset="8" context="_563" access="public" location="f0:432" file="f0" line="432"/>
  <Field id="_2893" name="length" type="_1399" offset="48" context="_563" access="public" location="f0:433" file="f0" line="433"/>
  <Destructor id="_2894" name="xcb_setup_authenticate_t" artificial="1" throw="" context="_563" access="public" mangled="_ZN24xcb_setup_authenticate_tD1Ev *INTERNAL* " demangled="xcb_setup_authenticate_t::~xcb_setup_authenticate_t()" location="f0:430" file="f0" line="430" endline="430" inline="1">
  </Destructor>
  <OperatorMethod id="_2895" name="=" returns="_5391" artificial="1" throw="" context="_563" access="public" mangled="_ZN24xcb_setup_authenticate_taSERKS_" demangled="xcb_setup_authenticate_t::operator=(xcb_setup_authenticate_t const&amp;)" location="f0:430" file="f0" line="430" endline="430" inline="1">
    <Argument type="_5392" location="f0:430" file="f0" line="430"/>
  </OperatorMethod>
  <Constructor id="_2896" name="xcb_setup_authenticate_t" artificial="1" throw="" context="_563" access="public" mangled="_ZN24xcb_setup_authenticate_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_authenticate_t::xcb_setup_authenticate_t(xcb_setup_authenticate_t const&amp;)" location="f0:430" file="f0" line="430" endline="430" inline="1">
    <Argument type="_5392" location="f0:430" file="f0" line="430"/>
  </Constructor>
  <Constructor id="_2897" name="xcb_setup_authenticate_t" artificial="1" throw="" context="_563" access="public" mangled="_ZN24xcb_setup_authenticate_tC1Ev *INTERNAL* " demangled="xcb_setup_authenticate_t::xcb_setup_authenticate_t()" location="f0:430" file="f0" line="430" inline="1"/>
  <Field id="_2898" name="response_type" type="_1478" offset="0" context="_565" access="public" location="f0:734" file="f0" line="734"/>
  <Field id="_2899" name="pad0" type="_1478" offset="8" context="_565" access="public" location="f0:735" file="f0" line="735"/>
  <Field id="_2900" name="sequence" type="_1399" offset="16" context="_565" access="public" location="f0:736" file="f0" line="736"/>
  <Field id="_2901" name="drawable" type="_878" offset="32" context="_565" access="public" location="f0:737" file="f0" line="737"/>
  <Field id="_2902" name="minor_opcode" type="_1399" offset="64" context="_565" access="public" location="f0:738" file="f0" line="738"/>
  <Field id="_2903" name="major_opcode" type="_1478" offset="80" context="_565" access="public" location="f0:739" file="f0" line="739"/>
  <Field id="_2904" name="pad1" type="_1478" offset="88" context="_565" access="public" location="f0:740" file="f0" line="740"/>
  <Destructor id="_2905" name="xcb_no_exposure_event_t" artificial="1" throw="" context="_565" access="public" mangled="_ZN23xcb_no_exposure_event_tD1Ev *INTERNAL* " demangled="xcb_no_exposure_event_t::~xcb_no_exposure_event_t()" location="f0:733" file="f0" line="733" endline="733" inline="1">
  </Destructor>
  <OperatorMethod id="_2906" name="=" returns="_5393" artificial="1" throw="" context="_565" access="public" mangled="_ZN23xcb_no_exposure_event_taSERKS_" demangled="xcb_no_exposure_event_t::operator=(xcb_no_exposure_event_t const&amp;)" location="f0:733" file="f0" line="733" endline="733" inline="1">
    <Argument type="_5394" location="f0:733" file="f0" line="733"/>
  </OperatorMethod>
  <Constructor id="_2907" name="xcb_no_exposure_event_t" artificial="1" throw="" context="_565" access="public" mangled="_ZN23xcb_no_exposure_event_tC1ERKS_ *INTERNAL* " demangled="xcb_no_exposure_event_t::xcb_no_exposure_event_t(xcb_no_exposure_event_t const&amp;)" location="f0:733" file="f0" line="733" endline="733" inline="1">
    <Argument type="_5394" location="f0:733" file="f0" line="733"/>
  </Constructor>
  <Constructor id="_2908" name="xcb_no_exposure_event_t" artificial="1" throw="" context="_565" access="public" mangled="_ZN23xcb_no_exposure_event_tC1Ev *INTERNAL* " demangled="xcb_no_exposure_event_t::xcb_no_exposure_event_t()" location="f0:733" file="f0" line="733" inline="1"/>
  <Field id="_2909" name="response_type" type="_1478" offset="0" context="_571" access="public" location="f0:914" file="f0" line="914"/>
  <Field id="_2910" name="pad0" type="_1478" offset="8" context="_571" access="public" location="f0:915" file="f0" line="915"/>
  <Field id="_2911" name="sequence" type="_1399" offset="16" context="_571" access="public" location="f0:916" file="f0" line="916"/>
  <Field id="_2912" name="event" type="_680" offset="32" context="_571" access="public" location="f0:917" file="f0" line="917"/>
  <Field id="_2913" name="window" type="_680" offset="64" context="_571" access="public" location="f0:918" file="f0" line="918"/>
  <Field id="_2914" name="x" type="_883" offset="96" context="_571" access="public" location="f0:919" file="f0" line="919"/>
  <Field id="_2915" name="y" type="_883" offset="112" context="_571" access="public" location="f0:920" file="f0" line="920"/>
  <Destructor id="_2916" name="xcb_gravity_notify_event_t" artificial="1" throw="" context="_571" access="public" mangled="_ZN26xcb_gravity_notify_event_tD1Ev *INTERNAL* " demangled="xcb_gravity_notify_event_t::~xcb_gravity_notify_event_t()" location="f0:913" file="f0" line="913" endline="913" inline="1">
  </Destructor>
  <OperatorMethod id="_2917" name="=" returns="_5395" artificial="1" throw="" context="_571" access="public" mangled="_ZN26xcb_gravity_notify_event_taSERKS_" demangled="xcb_gravity_notify_event_t::operator=(xcb_gravity_notify_event_t const&amp;)" location="f0:913" file="f0" line="913" endline="913" inline="1">
    <Argument type="_5396" location="f0:913" file="f0" line="913"/>
  </OperatorMethod>
  <Constructor id="_2918" name="xcb_gravity_notify_event_t" artificial="1" throw="" context="_571" access="public" mangled="_ZN26xcb_gravity_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_gravity_notify_event_t::xcb_gravity_notify_event_t(xcb_gravity_notify_event_t const&amp;)" location="f0:913" file="f0" line="913" endline="913" inline="1">
    <Argument type="_5396" location="f0:913" file="f0" line="913"/>
  </Constructor>
  <Constructor id="_2919" name="xcb_gravity_notify_event_t" artificial="1" throw="" context="_571" access="public" mangled="_ZN26xcb_gravity_notify_event_tC1Ev *INTERNAL* " demangled="xcb_gravity_notify_event_t::xcb_gravity_notify_event_t()" location="f0:913" file="f0" line="913" inline="1"/>
  <PointerType id="_2920" type="_861" size="64" align="64"/>
  <Field id="_2921" name="response_type" type="_1478" offset="0" context="_574" access="public" location="f0:1620" file="f0" line="1620"/>
  <Field id="_2922" name="depth" type="_1478" offset="8" context="_574" access="public" location="f0:1621" file="f0" line="1621"/>
  <Field id="_2923" name="sequence" type="_1399" offset="16" context="_574" access="public" location="f0:1622" file="f0" line="1622"/>
  <Field id="_2924" name="length" type="_699" offset="32" context="_574" access="public" location="f0:1623" file="f0" line="1623"/>
  <Field id="_2925" name="root" type="_680" offset="64" context="_574" access="public" location="f0:1624" file="f0" line="1624"/>
  <Field id="_2926" name="x" type="_883" offset="96" context="_574" access="public" location="f0:1625" file="f0" line="1625"/>
  <Field id="_2927" name="y" type="_883" offset="112" context="_574" access="public" location="f0:1626" file="f0" line="1626"/>
  <Field id="_2928" name="width" type="_1399" offset="128" context="_574" access="public" location="f0:1627" file="f0" line="1627"/>
  <Field id="_2929" name="height" type="_1399" offset="144" context="_574" access="public" location="f0:1628" file="f0" line="1628"/>
  <Field id="_2930" name="border_width" type="_1399" offset="160" context="_574" access="public" location="f0:1629" file="f0" line="1629"/>
  <Field id="_2931" name="pad0" type="_5156" offset="176" context="_574" access="public" location="f0:1630" file="f0" line="1630"/>
  <Destructor id="_2932" name="xcb_get_geometry_reply_t" artificial="1" throw="" context="_574" access="public" mangled="_ZN24xcb_get_geometry_reply_tD1Ev *INTERNAL* " demangled="xcb_get_geometry_reply_t::~xcb_get_geometry_reply_t()" location="f0:1619" file="f0" line="1619" endline="1619" inline="1">
  </Destructor>
  <OperatorMethod id="_2933" name="=" returns="_5397" artificial="1" throw="" context="_574" access="public" mangled="_ZN24xcb_get_geometry_reply_taSERKS_" demangled="xcb_get_geometry_reply_t::operator=(xcb_get_geometry_reply_t const&amp;)" location="f0:1619" file="f0" line="1619" endline="1619" inline="1">
    <Argument type="_5398" location="f0:1619" file="f0" line="1619"/>
  </OperatorMethod>
  <Constructor id="_2934" name="xcb_get_geometry_reply_t" artificial="1" throw="" context="_574" access="public" mangled="_ZN24xcb_get_geometry_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_geometry_reply_t::xcb_get_geometry_reply_t(xcb_get_geometry_reply_t const&amp;)" location="f0:1619" file="f0" line="1619" endline="1619" inline="1">
    <Argument type="_5398" location="f0:1619" file="f0" line="1619"/>
  </Constructor>
  <Constructor id="_2935" name="xcb_get_geometry_reply_t" artificial="1" throw="" context="_574" access="public" mangled="_ZN24xcb_get_geometry_reply_tC1Ev *INTERNAL* " demangled="xcb_get_geometry_reply_t::xcb_get_geometry_reply_t()" location="f0:1619" file="f0" line="1619" inline="1"/>
  <Field id="_2936" name="__val" type="_5399" offset="0" context="_576" access="public" location="f10:144" file="f10" line="144"/>
  <Destructor id="_2937" name="._0" artificial="1" throw="" context="_576" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f10:144" file="f10" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_2938" name="=" returns="_5400" artificial="1" throw="" context="_576" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f10:144" file="f10" line="144" endline="144" inline="1">
    <Argument type="_5401" location="f10:144" file="f10" line="144"/>
  </OperatorMethod>
  <Constructor id="_2939" name="._0" artificial="1" throw="" context="_576" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f10:144" file="f10" line="144" endline="144" inline="1">
    <Argument type="_5401" location="f10:144" file="f10" line="144"/>
  </Constructor>
  <Constructor id="_2940" name="._0" artificial="1" throw="" context="_576" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f10:144" file="f10" line="144" inline="1"/>
  <Field id="_2941" name="__bits" type="_5402" offset="0" context="_579" access="public" location="f13:129" file="f13" line="129"/>
  <Destructor id="_2942" name="._14" artificial="1" throw="" context="_579" access="public" mangled="_ZN9cpu_set_tD1Ev *INTERNAL* " demangled="cpu_set_t::~cpu_set_t()" location="f13:130" file="f13" line="130" endline="130" inline="1">
  </Destructor>
  <OperatorMethod id="_2943" name="=" returns="_5403" artificial="1" throw="" context="_579" access="public" mangled="_ZN9cpu_set_taSERKS_" demangled="cpu_set_t::operator=(cpu_set_t const&amp;)" location="f13:130" file="f13" line="130" endline="130" inline="1">
    <Argument type="_5404" location="f13:128" file="f13" line="128"/>
  </OperatorMethod>
  <Constructor id="_2944" name="._14" artificial="1" throw="" context="_579" access="public" mangled="_ZN9cpu_set_tC1ERKS_ *INTERNAL* " demangled="cpu_set_t::cpu_set_t(cpu_set_t const&amp;)" location="f13:130" file="f13" line="130" endline="130" inline="1">
    <Argument type="_5404" location="f13:128" file="f13" line="128"/>
  </Constructor>
  <Constructor id="_2945" name="._14" artificial="1" throw="" context="_579" access="public" mangled="_ZN9cpu_set_tC1Ev *INTERNAL* " demangled="cpu_set_t::cpu_set_t()" location="f13:130" file="f13" line="130" inline="1"/>
  <Field id="_2946" name="response_type" type="_1478" offset="0" context="_586" access="public" location="f14:130" file="f14" line="130"/>
  <Field id="_2947" name="pad0" type="_1478" offset="8" context="_586" access="public" location="f14:131" file="f14" line="131"/>
  <Field id="_2948" name="sequence" type="_1399" offset="16" context="_586" access="public" location="f14:132" file="f14" line="132"/>
  <Field id="_2949" name="pad" type="_5405" offset="32" context="_586" access="public" location="f14:133" file="f14" line="133"/>
  <Field id="_2950" name="full_sequence" type="_699" offset="256" context="_586" access="public" location="f14:134" file="f14" line="134"/>
  <Destructor id="_2951" name="._29" artificial="1" throw="" context="_586" access="public" mangled="_ZN19xcb_generic_event_tD1Ev *INTERNAL* " demangled="xcb_generic_event_t::~xcb_generic_event_t()" location="f14:135" file="f14" line="135" endline="135" inline="1">
  </Destructor>
  <OperatorMethod id="_2952" name="=" returns="_5406" artificial="1" throw="" context="_586" access="public" mangled="_ZN19xcb_generic_event_taSERKS_" demangled="xcb_generic_event_t::operator=(xcb_generic_event_t const&amp;)" location="f14:135" file="f14" line="135" endline="135" inline="1">
    <Argument type="_5407" location="f14:129" file="f14" line="129"/>
  </OperatorMethod>
  <Constructor id="_2953" name="._29" artificial="1" throw="" context="_586" access="public" mangled="_ZN19xcb_generic_event_tC1ERKS_ *INTERNAL* " demangled="xcb_generic_event_t::xcb_generic_event_t(xcb_generic_event_t const&amp;)" location="f14:135" file="f14" line="135" endline="135" inline="1">
    <Argument type="_5407" location="f14:129" file="f14" line="129"/>
  </Constructor>
  <Constructor id="_2954" name="._29" artificial="1" throw="" context="_586" access="public" mangled="_ZN19xcb_generic_event_tC1Ev *INTERNAL* " demangled="xcb_generic_event_t::xcb_generic_event_t()" location="f14:135" file="f14" line="135" inline="1"/>
  <PointerType id="_2955" type="_457" size="64" align="64"/>
  <Field id="_2956" name="major_opcode" type="_1478" offset="0" context="_591" access="public" location="f0:3061" file="f0" line="3061"/>
  <Field id="_2957" name="pad0" type="_1478" offset="8" context="_591" access="public" location="f0:3062" file="f0" line="3062"/>
  <Field id="_2958" name="length" type="_1399" offset="16" context="_591" access="public" location="f0:3063" file="f0" line="3063"/>
  <Field id="_2959" name="drawable" type="_878" offset="32" context="_591" access="public" location="f0:3064" file="f0" line="3064"/>
  <Field id="_2960" name="gc" type="_1792" offset="64" context="_591" access="public" location="f0:3065" file="f0" line="3065"/>
  <Destructor id="_2961" name="xcb_poly_arc_request_t" artificial="1" throw="" context="_591" access="public" mangled="_ZN22xcb_poly_arc_request_tD1Ev *INTERNAL* " demangled="xcb_poly_arc_request_t::~xcb_poly_arc_request_t()" location="f0:3060" file="f0" line="3060" endline="3060" inline="1">
  </Destructor>
  <OperatorMethod id="_2962" name="=" returns="_5408" artificial="1" throw="" context="_591" access="public" mangled="_ZN22xcb_poly_arc_request_taSERKS_" demangled="xcb_poly_arc_request_t::operator=(xcb_poly_arc_request_t const&amp;)" location="f0:3060" file="f0" line="3060" endline="3060" inline="1">
    <Argument type="_5409" location="f0:3060" file="f0" line="3060"/>
  </OperatorMethod>
  <Constructor id="_2963" name="xcb_poly_arc_request_t" artificial="1" throw="" context="_591" access="public" mangled="_ZN22xcb_poly_arc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_poly_arc_request_t::xcb_poly_arc_request_t(xcb_poly_arc_request_t const&amp;)" location="f0:3060" file="f0" line="3060" endline="3060" inline="1">
    <Argument type="_5409" location="f0:3060" file="f0" line="3060"/>
  </Constructor>
  <Constructor id="_2964" name="xcb_poly_arc_request_t" artificial="1" throw="" context="_591" access="public" mangled="_ZN22xcb_poly_arc_request_tC1Ev *INTERNAL* " demangled="xcb_poly_arc_request_t::xcb_poly_arc_request_t()" location="f0:3060" file="f0" line="3060" inline="1"/>
  <PointerType id="_2965" type="_610" size="64" align="64"/>
  <PointerType id="_2966" type="_435c" size="64" align="64"/>
  <PointerType id="_2967" type="_1740" size="64" align="64"/>
  <Field id="_2968" name="data" type="_5411" offset="0" context="_600" access="public" location="f0:402" file="f0" line="402"/>
  <Field id="_2969" name="rem" type="_184" offset="64" context="_600" access="public" location="f0:403" file="f0" line="403"/>
  <Field id="_2970" name="index" type="_184" offset="96" context="_600" access="public" location="f0:404" file="f0" line="404"/>
  <Destructor id="_2971" name="xcb_setup_request_iterator_t" artificial="1" throw="" context="_600" access="public" mangled="_ZN28xcb_setup_request_iterator_tD1Ev *INTERNAL* " demangled="xcb_setup_request_iterator_t::~xcb_setup_request_iterator_t()" location="f0:401" file="f0" line="401" endline="401" inline="1">
  </Destructor>
  <OperatorMethod id="_2972" name="=" returns="_5412" artificial="1" throw="" context="_600" access="public" mangled="_ZN28xcb_setup_request_iterator_taSERKS_" demangled="xcb_setup_request_iterator_t::operator=(xcb_setup_request_iterator_t const&amp;)" location="f0:401" file="f0" line="401" endline="401" inline="1">
    <Argument type="_5413" location="f0:401" file="f0" line="401"/>
  </OperatorMethod>
  <Constructor id="_2973" name="xcb_setup_request_iterator_t" artificial="1" throw="" context="_600" access="public" mangled="_ZN28xcb_setup_request_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_request_iterator_t::xcb_setup_request_iterator_t(xcb_setup_request_iterator_t const&amp;)" location="f0:401" file="f0" line="401" endline="401" inline="1">
    <Argument type="_5413" location="f0:401" file="f0" line="401"/>
  </Constructor>
  <Constructor id="_2974" name="xcb_setup_request_iterator_t" artificial="1" throw="" context="_600" access="public" mangled="_ZN28xcb_setup_request_iterator_tC1Ev *INTERNAL* " demangled="xcb_setup_request_iterator_t::xcb_setup_request_iterator_t()" location="f0:401" file="f0" line="401" inline="1"/>
  <PointerType id="_2975" type="_579" size="64" align="64"/>
  <Field id="_2976" name="x1" type="_883" offset="0" context="_605" access="public" location="f0:3011" file="f0" line="3011"/>
  <Field id="_2977" name="y1" type="_883" offset="16" context="_605" access="public" location="f0:3012" file="f0" line="3012"/>
  <Field id="_2978" name="x2" type="_883" offset="32" context="_605" access="public" location="f0:3013" file="f0" line="3013"/>
  <Field id="_2979" name="y2" type="_883" offset="48" context="_605" access="public" location="f0:3014" file="f0" line="3014"/>
  <Destructor id="_2980" name="xcb_segment_t" artificial="1" throw="" context="_605" access="public" mangled="_ZN13xcb_segment_tD1Ev *INTERNAL* " demangled="xcb_segment_t::~xcb_segment_t()" location="f0:3010" file="f0" line="3010" endline="3010" inline="1">
  </Destructor>
  <OperatorMethod id="_2981" name="=" returns="_5414" artificial="1" throw="" context="_605" access="public" mangled="_ZN13xcb_segment_taSERKS_" demangled="xcb_segment_t::operator=(xcb_segment_t const&amp;)" location="f0:3010" file="f0" line="3010" endline="3010" inline="1">
    <Argument type="_5415" location="f0:3010" file="f0" line="3010"/>
  </OperatorMethod>
  <Constructor id="_2982" name="xcb_segment_t" artificial="1" throw="" context="_605" access="public" mangled="_ZN13xcb_segment_tC1ERKS_ *INTERNAL* " demangled="xcb_segment_t::xcb_segment_t(xcb_segment_t const&amp;)" location="f0:3010" file="f0" line="3010" endline="3010" inline="1">
    <Argument type="_5415" location="f0:3010" file="f0" line="3010"/>
  </Constructor>
  <Constructor id="_2983" name="xcb_segment_t" artificial="1" throw="" context="_605" access="public" mangled="_ZN13xcb_segment_tC1Ev *INTERNAL* " demangled="xcb_segment_t::xcb_segment_t()" location="f0:3010" file="f0" line="3010" inline="1"/>
  <Field id="_2984" name="depth" type="_1478" offset="0" context="_609" access="public" location="f0:253" file="f0" line="253"/>
  <Field id="_2985" name="bits_per_pixel" type="_1478" offset="8" context="_609" access="public" location="f0:254" file="f0" line="254"/>
  <Field id="_2986" name="scanline_pad" type="_1478" offset="16" context="_609" access="public" location="f0:255" file="f0" line="255"/>
  <Field id="_2987" name="pad0" type="_5390" offset="24" context="_609" access="public" location="f0:256" file="f0" line="256"/>
  <Destructor id="_2988" name="xcb_format_t" artificial="1" throw="" context="_609" access="public" mangled="_ZN12xcb_format_tD1Ev *INTERNAL* " demangled="xcb_format_t::~xcb_format_t()" location="f0:252" file="f0" line="252" endline="252" inline="1">
  </Destructor>
  <OperatorMethod id="_2989" name="=" returns="_5416" artificial="1" throw="" context="_609" access="public" mangled="_ZN12xcb_format_taSERKS_" demangled="xcb_format_t::operator=(xcb_format_t const&amp;)" location="f0:252" file="f0" line="252" endline="252" inline="1">
    <Argument type="_5417" location="f0:252" file="f0" line="252"/>
  </OperatorMethod>
  <Constructor id="_2990" name="xcb_format_t" artificial="1" throw="" context="_609" access="public" mangled="_ZN12xcb_format_tC1ERKS_ *INTERNAL* " demangled="xcb_format_t::xcb_format_t(xcb_format_t const&amp;)" location="f0:252" file="f0" line="252" endline="252" inline="1">
    <Argument type="_5417" location="f0:252" file="f0" line="252"/>
  </Constructor>
  <Constructor id="_2991" name="xcb_format_t" artificial="1" throw="" context="_609" access="public" mangled="_ZN12xcb_format_tC1Ev *INTERNAL* " demangled="xcb_format_t::xcb_format_t()" location="f0:252" file="f0" line="252" inline="1"/>
  <Field id="_2992" name="flags" type="_1366" offset="0" context="_612" access="public" location="f3:770" file="f3" line="770"/>
  <Field id="_2993" name="input" type="_699" offset="32" context="_612" access="public" location="f3:773" file="f3" line="773"/>
  <Field id="_2994" name="initial_state" type="_1366" offset="64" context="_612" access="public" location="f3:775" file="f3" line="775"/>
  <Field id="_2995" name="icon_pixmap" type="_1761" offset="96" context="_612" access="public" location="f3:777" file="f3" line="777"/>
  <Field id="_2996" name="icon_window" type="_680" offset="128" context="_612" access="public" location="f3:779" file="f3" line="779"/>
  <Field id="_2997" name="icon_x" type="_1366" offset="160" context="_612" access="public" location="f3:781" file="f3" line="781"/>
  <Field id="_2998" name="icon_y" type="_1366" offset="192" context="_612" access="public" location="f3:781" file="f3" line="781"/>
  <Field id="_2999" name="icon_mask" type="_1761" offset="224" context="_612" access="public" location="f3:783" file="f3" line="783"/>
  <Field id="_3000" name="window_group" type="_680" offset="256" context="_612" access="public" location="f3:785" file="f3" line="785"/>
  <Destructor id="_3001" name="._38" artificial="1" throw="" context="_612" access="public" mangled="_ZN20xcb_icccm_wm_hints_tD1Ev *INTERNAL* " demangled="xcb_icccm_wm_hints_t::~xcb_icccm_wm_hints_t()" location="f3:786" file="f3" line="786" endline="786" inline="1">
  </Destructor>
  <OperatorMethod id="_3002" name="=" returns="_5418" artificial="1" throw="" context="_612" access="public" mangled="_ZN20xcb_icccm_wm_hints_taSERKS_" demangled="xcb_icccm_wm_hints_t::operator=(xcb_icccm_wm_hints_t const&amp;)" location="f3:786" file="f3" line="786" endline="786" inline="1">
    <Argument type="_5419" location="f3:768" file="f3" line="768"/>
  </OperatorMethod>
  <Constructor id="_3003" name="._38" artificial="1" throw="" context="_612" access="public" mangled="_ZN20xcb_icccm_wm_hints_tC1ERKS_ *INTERNAL* " demangled="xcb_icccm_wm_hints_t::xcb_icccm_wm_hints_t(xcb_icccm_wm_hints_t const&amp;)" location="f3:786" file="f3" line="786" endline="786" inline="1">
    <Argument type="_5419" location="f3:768" file="f3" line="768"/>
  </Constructor>
  <Constructor id="_3004" name="._38" artificial="1" throw="" context="_612" access="public" mangled="_ZN20xcb_icccm_wm_hints_tC1Ev *INTERNAL* " demangled="xcb_icccm_wm_hints_t::xcb_icccm_wm_hints_t()" location="f3:786" file="f3" line="786" inline="1"/>
  <PointerType id="_3005" type="_390c" size="64" align="64"/>
  <Field id="_3006" name="major_opcode" type="_1478" offset="0" context="_618" access="public" location="f0:3047" file="f0" line="3047"/>
  <Field id="_3007" name="pad0" type="_1478" offset="8" context="_618" access="public" location="f0:3048" file="f0" line="3048"/>
  <Field id="_3008" name="length" type="_1399" offset="16" context="_618" access="public" location="f0:3049" file="f0" line="3049"/>
  <Field id="_3009" name="drawable" type="_878" offset="32" context="_618" access="public" location="f0:3050" file="f0" line="3050"/>
  <Field id="_3010" name="gc" type="_1792" offset="64" context="_618" access="public" location="f0:3051" file="f0" line="3051"/>
  <Destructor id="_3011" name="xcb_poly_rectangle_request_t" artificial="1" throw="" context="_618" access="public" mangled="_ZN28xcb_poly_rectangle_request_tD1Ev *INTERNAL* " demangled="xcb_poly_rectangle_request_t::~xcb_poly_rectangle_request_t()" location="f0:3046" file="f0" line="3046" endline="3046" inline="1">
  </Destructor>
  <OperatorMethod id="_3012" name="=" returns="_5421" artificial="1" throw="" context="_618" access="public" mangled="_ZN28xcb_poly_rectangle_request_taSERKS_" demangled="xcb_poly_rectangle_request_t::operator=(xcb_poly_rectangle_request_t const&amp;)" location="f0:3046" file="f0" line="3046" endline="3046" inline="1">
    <Argument type="_5422" location="f0:3046" file="f0" line="3046"/>
  </OperatorMethod>
  <Constructor id="_3013" name="xcb_poly_rectangle_request_t" artificial="1" throw="" context="_618" access="public" mangled="_ZN28xcb_poly_rectangle_request_tC1ERKS_ *INTERNAL* " demangled="xcb_poly_rectangle_request_t::xcb_poly_rectangle_request_t(xcb_poly_rectangle_request_t const&amp;)" location="f0:3046" file="f0" line="3046" endline="3046" inline="1">
    <Argument type="_5422" location="f0:3046" file="f0" line="3046"/>
  </Constructor>
  <Constructor id="_3014" name="xcb_poly_rectangle_request_t" artificial="1" throw="" context="_618" access="public" mangled="_ZN28xcb_poly_rectangle_request_tC1Ev *INTERNAL* " demangled="xcb_poly_rectangle_request_t::xcb_poly_rectangle_request_t()" location="f0:3046" file="f0" line="3046" inline="1"/>
  <PointerType id="_3015" type="_429" size="64" align="64"/>
  <Field id="_3016" name="major_opcode" type="_1478" offset="0" context="_631" access="public" location="f0:1526" file="f0" line="1526"/>
  <Field id="_3017" name="pad0" type="_1478" offset="8" context="_631" access="public" location="f0:1527" file="f0" line="1527"/>
  <Field id="_3018" name="length" type="_1399" offset="16" context="_631" access="public" location="f0:1528" file="f0" line="1528"/>
  <Field id="_3019" name="window" type="_680" offset="32" context="_631" access="public" location="f0:1529" file="f0" line="1529"/>
  <Destructor id="_3020" name="xcb_unmap_window_request_t" artificial="1" throw="" context="_631" access="public" mangled="_ZN26xcb_unmap_window_request_tD1Ev *INTERNAL* " demangled="xcb_unmap_window_request_t::~xcb_unmap_window_request_t()" location="f0:1525" file="f0" line="1525" endline="1525" inline="1">
  </Destructor>
  <OperatorMethod id="_3021" name="=" returns="_5423" artificial="1" throw="" context="_631" access="public" mangled="_ZN26xcb_unmap_window_request_taSERKS_" demangled="xcb_unmap_window_request_t::operator=(xcb_unmap_window_request_t const&amp;)" location="f0:1525" file="f0" line="1525" endline="1525" inline="1">
    <Argument type="_5424" location="f0:1525" file="f0" line="1525"/>
  </OperatorMethod>
  <Constructor id="_3022" name="xcb_unmap_window_request_t" artificial="1" throw="" context="_631" access="public" mangled="_ZN26xcb_unmap_window_request_tC1ERKS_ *INTERNAL* " demangled="xcb_unmap_window_request_t::xcb_unmap_window_request_t(xcb_unmap_window_request_t const&amp;)" location="f0:1525" file="f0" line="1525" endline="1525" inline="1">
    <Argument type="_5424" location="f0:1525" file="f0" line="1525"/>
  </Constructor>
  <Constructor id="_3023" name="xcb_unmap_window_request_t" artificial="1" throw="" context="_631" access="public" mangled="_ZN26xcb_unmap_window_request_tC1Ev *INTERNAL* " demangled="xcb_unmap_window_request_t::xcb_unmap_window_request_t()" location="f0:1525" file="f0" line="1525" inline="1"/>
  <PointerType id="_3024" type="_1133" size="64" align="64"/>
  <PointerType id="_3025" type="_1306c" size="64" align="64"/>
  <Field id="_3026" name="response_type" type="_1478" offset="0" context="_642" access="public" location="f0:3848" file="f0" line="3848"/>
  <Field id="_3027" name="names_len" type="_1478" offset="8" context="_642" access="public" location="f0:3849" file="f0" line="3849"/>
  <Field id="_3028" name="sequence" type="_1399" offset="16" context="_642" access="public" location="f0:3850" file="f0" line="3850"/>
  <Field id="_3029" name="length" type="_699" offset="32" context="_642" access="public" location="f0:3851" file="f0" line="3851"/>
  <Field id="_3030" name="pad0" type="_5426" offset="64" context="_642" access="public" location="f0:3852" file="f0" line="3852"/>
  <Destructor id="_3031" name="xcb_list_extensions_reply_t" artificial="1" throw="" context="_642" access="public" mangled="_ZN27xcb_list_extensions_reply_tD1Ev *INTERNAL* " demangled="xcb_list_extensions_reply_t::~xcb_list_extensions_reply_t()" location="f0:3847" file="f0" line="3847" endline="3847" inline="1">
  </Destructor>
  <OperatorMethod id="_3032" name="=" returns="_5427" artificial="1" throw="" context="_642" access="public" mangled="_ZN27xcb_list_extensions_reply_taSERKS_" demangled="xcb_list_extensions_reply_t::operator=(xcb_list_extensions_reply_t const&amp;)" location="f0:3847" file="f0" line="3847" endline="3847" inline="1">
    <Argument type="_5428" location="f0:3847" file="f0" line="3847"/>
  </OperatorMethod>
  <Constructor id="_3033" name="xcb_list_extensions_reply_t" artificial="1" throw="" context="_642" access="public" mangled="_ZN27xcb_list_extensions_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_list_extensions_reply_t::xcb_list_extensions_reply_t(xcb_list_extensions_reply_t const&amp;)" location="f0:3847" file="f0" line="3847" endline="3847" inline="1">
    <Argument type="_5428" location="f0:3847" file="f0" line="3847"/>
  </Constructor>
  <Constructor id="_3034" name="xcb_list_extensions_reply_t" artificial="1" throw="" context="_642" access="public" mangled="_ZN27xcb_list_extensions_reply_tC1Ev *INTERNAL* " demangled="xcb_list_extensions_reply_t::xcb_list_extensions_reply_t()" location="f0:3847" file="f0" line="3847" inline="1"/>
  <Field id="_3035" name="__sched_priority" type="_184" offset="0" context="_645" access="public" location="f13:76" file="f13" line="76"/>
  <Destructor id="_3036" name="sched_param" artificial="1" throw="" context="_645" access="public" mangled="_ZN11sched_paramD1Ev *INTERNAL* " demangled="sched_param::~sched_param()" location="f13:75" file="f13" line="75" endline="75" inline="1">
  </Destructor>
  <OperatorMethod id="_3037" name="=" returns="_5429" artificial="1" throw="" context="_645" access="public" mangled="_ZN11sched_paramaSERKS_" demangled="sched_param::operator=(sched_param const&amp;)" location="f13:75" file="f13" line="75" endline="75" inline="1">
    <Argument type="_5430" location="f13:75" file="f13" line="75"/>
  </OperatorMethod>
  <Constructor id="_3038" name="sched_param" artificial="1" throw="" context="_645" access="public" mangled="_ZN11sched_paramC1ERKS_ *INTERNAL* " demangled="sched_param::sched_param(sched_param const&amp;)" location="f13:75" file="f13" line="75" endline="75" inline="1">
    <Argument type="_5430" location="f13:75" file="f13" line="75"/>
  </Constructor>
  <Constructor id="_3039" name="sched_param" artificial="1" throw="" context="_645" access="public" mangled="_ZN11sched_paramC1Ev *INTERNAL* " demangled="sched_param::sched_param()" location="f13:75" file="f13" line="75" inline="1"/>
  <Field id="_3040" name="status" type="_1478" offset="0" context="_651" access="public" location="f0:454" file="f0" line="454"/>
  <Field id="_3041" name="pad0" type="_1478" offset="8" context="_651" access="public" location="f0:455" file="f0" line="455"/>
  <Field id="_3042" name="protocol_major_version" type="_1399" offset="16" context="_651" access="public" location="f0:456" file="f0" line="456"/>
  <Field id="_3043" name="protocol_minor_version" type="_1399" offset="32" context="_651" access="public" location="f0:457" file="f0" line="457"/>
  <Field id="_3044" name="length" type="_1399" offset="48" context="_651" access="public" location="f0:458" file="f0" line="458"/>
  <Field id="_3045" name="release_number" type="_699" offset="64" context="_651" access="public" location="f0:459" file="f0" line="459"/>
  <Field id="_3046" name="resource_id_base" type="_699" offset="96" context="_651" access="public" location="f0:460" file="f0" line="460"/>
  <Field id="_3047" name="resource_id_mask" type="_699" offset="128" context="_651" access="public" location="f0:461" file="f0" line="461"/>
  <Field id="_3048" name="motion_buffer_size" type="_699" offset="160" context="_651" access="public" location="f0:462" file="f0" line="462"/>
  <Field id="_3049" name="vendor_len" type="_1399" offset="192" context="_651" access="public" location="f0:463" file="f0" line="463"/>
  <Field id="_3050" name="maximum_request_length" type="_1399" offset="208" context="_651" access="public" location="f0:464" file="f0" line="464"/>
  <Field id="_3051" name="roots_len" type="_1478" offset="224" context="_651" access="public" location="f0:465" file="f0" line="465"/>
  <Field id="_3052" name="pixmap_formats_len" type="_1478" offset="232" context="_651" access="public" location="f0:466" file="f0" line="466"/>
  <Field id="_3053" name="image_byte_order" type="_1478" offset="240" context="_651" access="public" location="f0:467" file="f0" line="467"/>
  <Field id="_3054" name="bitmap_format_bit_order" type="_1478" offset="248" context="_651" access="public" location="f0:468" file="f0" line="468"/>
  <Field id="_3055" name="bitmap_format_scanline_unit" type="_1478" offset="256" context="_651" access="public" location="f0:469" file="f0" line="469"/>
  <Field id="_3056" name="bitmap_format_scanline_pad" type="_1478" offset="264" context="_651" access="public" location="f0:470" file="f0" line="470"/>
  <Field id="_3057" name="min_keycode" type="_905" offset="272" context="_651" access="public" location="f0:471" file="f0" line="471"/>
  <Field id="_3058" name="max_keycode" type="_905" offset="280" context="_651" access="public" location="f0:472" file="f0" line="472"/>
  <Field id="_3059" name="pad1" type="_5272" offset="288" context="_651" access="public" location="f0:473" file="f0" line="473"/>
  <Destructor id="_3060" name="xcb_setup_t" artificial="1" throw="" context="_651" access="public" mangled="_ZN11xcb_setup_tD1Ev *INTERNAL* " demangled="xcb_setup_t::~xcb_setup_t()" location="f0:453" file="f0" line="453" endline="453" inline="1">
  </Destructor>
  <OperatorMethod id="_3061" name="=" returns="_5431" artificial="1" throw="" context="_651" access="public" mangled="_ZN11xcb_setup_taSERKS_" demangled="xcb_setup_t::operator=(xcb_setup_t const&amp;)" location="f0:453" file="f0" line="453" endline="453" inline="1">
    <Argument type="_5432" location="f0:453" file="f0" line="453"/>
  </OperatorMethod>
  <Constructor id="_3062" name="xcb_setup_t" artificial="1" throw="" context="_651" access="public" mangled="_ZN11xcb_setup_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_t::xcb_setup_t(xcb_setup_t const&amp;)" location="f0:453" file="f0" line="453" endline="453" inline="1">
    <Argument type="_5432" location="f0:453" file="f0" line="453"/>
  </Constructor>
  <Constructor id="_3063" name="xcb_setup_t" artificial="1" throw="" context="_651" access="public" mangled="_ZN11xcb_setup_tC1Ev *INTERNAL* " demangled="xcb_setup_t::xcb_setup_t()" location="f0:453" file="f0" line="453" inline="1"/>
  <PointerType id="_3064" type="_1721" size="64" align="64"/>
  <Field id="_3065" name="sequence" type="_151" offset="0" context="_654" access="public" location="f0:3395" file="f0" line="3395"/>
  <Destructor id="_3066" name="xcb_alloc_named_color_cookie_t" artificial="1" throw="" context="_654" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_tD1Ev *INTERNAL* " demangled="xcb_alloc_named_color_cookie_t::~xcb_alloc_named_color_cookie_t()" location="f0:3394" file="f0" line="3394" endline="3394" inline="1">
  </Destructor>
  <OperatorMethod id="_3067" name="=" returns="_5433" artificial="1" throw="" context="_654" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_taSERKS_" demangled="xcb_alloc_named_color_cookie_t::operator=(xcb_alloc_named_color_cookie_t const&amp;)" location="f0:3394" file="f0" line="3394" endline="3394" inline="1">
    <Argument type="_5434" location="f0:3394" file="f0" line="3394"/>
  </OperatorMethod>
  <Constructor id="_3068" name="xcb_alloc_named_color_cookie_t" artificial="1" throw="" context="_654" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_alloc_named_color_cookie_t::xcb_alloc_named_color_cookie_t(xcb_alloc_named_color_cookie_t const&amp;)" location="f0:3394" file="f0" line="3394" endline="3394" inline="1">
    <Argument type="_5434" location="f0:3394" file="f0" line="3394"/>
  </Constructor>
  <Constructor id="_3069" name="xcb_alloc_named_color_cookie_t" artificial="1" throw="" context="_654" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_tC1Ev *INTERNAL* " demangled="xcb_alloc_named_color_cookie_t::xcb_alloc_named_color_cookie_t()" location="f0:3394" file="f0" line="3394" inline="1"/>
  <PointerType id="_3070" type="_1938" size="64" align="64"/>
  <PointerType id="_3071" type="_1940" size="64" align="64"/>
  <PointerType id="_3072" type="_1676c" size="64" align="64"/>
  <Field id="_3073" name="data" type="_5436" offset="0" context="_668" access="public" location="f0:154" file="f0" line="154"/>
  <Field id="_3074" name="rem" type="_184" offset="64" context="_668" access="public" location="f0:155" file="f0" line="155"/>
  <Field id="_3075" name="index" type="_184" offset="96" context="_668" access="public" location="f0:156" file="f0" line="156"/>
  <Destructor id="_3076" name="xcb_timestamp_iterator_t" artificial="1" throw="" context="_668" access="public" mangled="_ZN24xcb_timestamp_iterator_tD1Ev *INTERNAL* " demangled="xcb_timestamp_iterator_t::~xcb_timestamp_iterator_t()" location="f0:153" file="f0" line="153" endline="153" inline="1">
  </Destructor>
  <OperatorMethod id="_3077" name="=" returns="_5437" artificial="1" throw="" context="_668" access="public" mangled="_ZN24xcb_timestamp_iterator_taSERKS_" demangled="xcb_timestamp_iterator_t::operator=(xcb_timestamp_iterator_t const&amp;)" location="f0:153" file="f0" line="153" endline="153" inline="1">
    <Argument type="_5438" location="f0:153" file="f0" line="153"/>
  </OperatorMethod>
  <Constructor id="_3078" name="xcb_timestamp_iterator_t" artificial="1" throw="" context="_668" access="public" mangled="_ZN24xcb_timestamp_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_timestamp_iterator_t::xcb_timestamp_iterator_t(xcb_timestamp_iterator_t const&amp;)" location="f0:153" file="f0" line="153" endline="153" inline="1">
    <Argument type="_5438" location="f0:153" file="f0" line="153"/>
  </Constructor>
  <Constructor id="_3079" name="xcb_timestamp_iterator_t" artificial="1" throw="" context="_668" access="public" mangled="_ZN24xcb_timestamp_iterator_tC1Ev *INTERNAL* " demangled="xcb_timestamp_iterator_t::xcb_timestamp_iterator_t()" location="f0:153" file="f0" line="153" inline="1"/>
  <Field id="_3080" name="response_type" type="_1478" offset="0" context="_672" access="public" location="f0:694" file="f0" line="694"/>
  <Field id="_3081" name="pad0" type="_1478" offset="8" context="_672" access="public" location="f0:695" file="f0" line="695"/>
  <Field id="_3082" name="sequence" type="_1399" offset="16" context="_672" access="public" location="f0:696" file="f0" line="696"/>
  <Field id="_3083" name="window" type="_680" offset="32" context="_672" access="public" location="f0:697" file="f0" line="697"/>
  <Field id="_3084" name="x" type="_1399" offset="64" context="_672" access="public" location="f0:698" file="f0" line="698"/>
  <Field id="_3085" name="y" type="_1399" offset="80" context="_672" access="public" location="f0:699" file="f0" line="699"/>
  <Field id="_3086" name="width" type="_1399" offset="96" context="_672" access="public" location="f0:700" file="f0" line="700"/>
  <Field id="_3087" name="height" type="_1399" offset="112" context="_672" access="public" location="f0:701" file="f0" line="701"/>
  <Field id="_3088" name="count" type="_1399" offset="128" context="_672" access="public" location="f0:702" file="f0" line="702"/>
  <Field id="_3089" name="pad1" type="_5156" offset="144" context="_672" access="public" location="f0:703" file="f0" line="703"/>
  <Destructor id="_3090" name="xcb_expose_event_t" artificial="1" throw="" context="_672" access="public" mangled="_ZN18xcb_expose_event_tD1Ev *INTERNAL* " demangled="xcb_expose_event_t::~xcb_expose_event_t()" location="f0:693" file="f0" line="693" endline="693" inline="1">
  </Destructor>
  <OperatorMethod id="_3091" name="=" returns="_5439" artificial="1" throw="" context="_672" access="public" mangled="_ZN18xcb_expose_event_taSERKS_" demangled="xcb_expose_event_t::operator=(xcb_expose_event_t const&amp;)" location="f0:693" file="f0" line="693" endline="693" inline="1">
    <Argument type="_5440" location="f0:693" file="f0" line="693"/>
  </OperatorMethod>
  <Constructor id="_3092" name="xcb_expose_event_t" artificial="1" throw="" context="_672" access="public" mangled="_ZN18xcb_expose_event_tC1ERKS_ *INTERNAL* " demangled="xcb_expose_event_t::xcb_expose_event_t(xcb_expose_event_t const&amp;)" location="f0:693" file="f0" line="693" endline="693" inline="1">
    <Argument type="_5440" location="f0:693" file="f0" line="693"/>
  </Constructor>
  <Constructor id="_3093" name="xcb_expose_event_t" artificial="1" throw="" context="_672" access="public" mangled="_ZN18xcb_expose_event_tC1Ev *INTERNAL* " demangled="xcb_expose_event_t::xcb_expose_event_t()" location="f0:693" file="f0" line="693" inline="1"/>
  <Field id="_3094" name="major_opcode" type="_1478" offset="0" context="_674" access="public" location="f0:2712" file="f0" line="2712"/>
  <Field id="_3095" name="depth" type="_1478" offset="8" context="_674" access="public" location="f0:2713" file="f0" line="2713"/>
  <Field id="_3096" name="length" type="_1399" offset="16" context="_674" access="public" location="f0:2714" file="f0" line="2714"/>
  <Field id="_3097" name="pid" type="_1761" offset="32" context="_674" access="public" location="f0:2715" file="f0" line="2715"/>
  <Field id="_3098" name="drawable" type="_878" offset="64" context="_674" access="public" location="f0:2716" file="f0" line="2716"/>
  <Field id="_3099" name="width" type="_1399" offset="96" context="_674" access="public" location="f0:2717" file="f0" line="2717"/>
  <Field id="_3100" name="height" type="_1399" offset="112" context="_674" access="public" location="f0:2718" file="f0" line="2718"/>
  <Destructor id="_3101" name="xcb_create_pixmap_request_t" artificial="1" throw="" context="_674" access="public" mangled="_ZN27xcb_create_pixmap_request_tD1Ev *INTERNAL* " demangled="xcb_create_pixmap_request_t::~xcb_create_pixmap_request_t()" location="f0:2711" file="f0" line="2711" endline="2711" inline="1">
  </Destructor>
  <OperatorMethod id="_3102" name="=" returns="_5441" artificial="1" throw="" context="_674" access="public" mangled="_ZN27xcb_create_pixmap_request_taSERKS_" demangled="xcb_create_pixmap_request_t::operator=(xcb_create_pixmap_request_t const&amp;)" location="f0:2711" file="f0" line="2711" endline="2711" inline="1">
    <Argument type="_5442" location="f0:2711" file="f0" line="2711"/>
  </OperatorMethod>
  <Constructor id="_3103" name="xcb_create_pixmap_request_t" artificial="1" throw="" context="_674" access="public" mangled="_ZN27xcb_create_pixmap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_create_pixmap_request_t::xcb_create_pixmap_request_t(xcb_create_pixmap_request_t const&amp;)" location="f0:2711" file="f0" line="2711" endline="2711" inline="1">
    <Argument type="_5442" location="f0:2711" file="f0" line="2711"/>
  </Constructor>
  <Constructor id="_3104" name="xcb_create_pixmap_request_t" artificial="1" throw="" context="_674" access="public" mangled="_ZN27xcb_create_pixmap_request_tC1Ev *INTERNAL* " demangled="xcb_create_pixmap_request_t::xcb_create_pixmap_request_t()" location="f0:2711" file="f0" line="2711" inline="1"/>
  <Field id="_3105" name="major_opcode" type="_1478" offset="0" context="_676" access="public" location="f0:3366" file="f0" line="3366"/>
  <Field id="_3106" name="pad0" type="_1478" offset="8" context="_676" access="public" location="f0:3367" file="f0" line="3367"/>
  <Field id="_3107" name="length" type="_1399" offset="16" context="_676" access="public" location="f0:3368" file="f0" line="3368"/>
  <Field id="_3108" name="cmap" type="_720" offset="32" context="_676" access="public" location="f0:3369" file="f0" line="3369"/>
  <Field id="_3109" name="red" type="_1399" offset="64" context="_676" access="public" location="f0:3370" file="f0" line="3370"/>
  <Field id="_3110" name="green" type="_1399" offset="80" context="_676" access="public" location="f0:3371" file="f0" line="3371"/>
  <Field id="_3111" name="blue" type="_1399" offset="96" context="_676" access="public" location="f0:3372" file="f0" line="3372"/>
  <Field id="_3112" name="pad1" type="_5156" offset="112" context="_676" access="public" location="f0:3373" file="f0" line="3373"/>
  <Destructor id="_3113" name="xcb_alloc_color_request_t" artificial="1" throw="" context="_676" access="public" mangled="_ZN25xcb_alloc_color_request_tD1Ev *INTERNAL* " demangled="xcb_alloc_color_request_t::~xcb_alloc_color_request_t()" location="f0:3365" file="f0" line="3365" endline="3365" inline="1">
  </Destructor>
  <OperatorMethod id="_3114" name="=" returns="_5443" artificial="1" throw="" context="_676" access="public" mangled="_ZN25xcb_alloc_color_request_taSERKS_" demangled="xcb_alloc_color_request_t::operator=(xcb_alloc_color_request_t const&amp;)" location="f0:3365" file="f0" line="3365" endline="3365" inline="1">
    <Argument type="_5444" location="f0:3365" file="f0" line="3365"/>
  </OperatorMethod>
  <Constructor id="_3115" name="xcb_alloc_color_request_t" artificial="1" throw="" context="_676" access="public" mangled="_ZN25xcb_alloc_color_request_tC1ERKS_ *INTERNAL* " demangled="xcb_alloc_color_request_t::xcb_alloc_color_request_t(xcb_alloc_color_request_t const&amp;)" location="f0:3365" file="f0" line="3365" endline="3365" inline="1">
    <Argument type="_5444" location="f0:3365" file="f0" line="3365"/>
  </Constructor>
  <Constructor id="_3116" name="xcb_alloc_color_request_t" artificial="1" throw="" context="_676" access="public" mangled="_ZN25xcb_alloc_color_request_tC1Ev *INTERNAL* " demangled="xcb_alloc_color_request_t::xcb_alloc_color_request_t()" location="f0:3365" file="f0" line="3365" inline="1"/>
  <Field id="_3117" name="response_type" type="_1478" offset="0" context="_678" access="public" location="f0:2552" file="f0" line="2552"/>
  <Field id="_3118" name="draw_direction" type="_1478" offset="8" context="_678" access="public" location="f0:2553" file="f0" line="2553"/>
  <Field id="_3119" name="sequence" type="_1399" offset="16" context="_678" access="public" location="f0:2554" file="f0" line="2554"/>
  <Field id="_3120" name="length" type="_699" offset="32" context="_678" access="public" location="f0:2555" file="f0" line="2555"/>
  <Field id="_3121" name="font_ascent" type="_883" offset="64" context="_678" access="public" location="f0:2556" file="f0" line="2556"/>
  <Field id="_3122" name="font_descent" type="_883" offset="80" context="_678" access="public" location="f0:2557" file="f0" line="2557"/>
  <Field id="_3123" name="overall_ascent" type="_883" offset="96" context="_678" access="public" location="f0:2558" file="f0" line="2558"/>
  <Field id="_3124" name="overall_descent" type="_883" offset="112" context="_678" access="public" location="f0:2559" file="f0" line="2559"/>
  <Field id="_3125" name="overall_width" type="_1366" offset="128" context="_678" access="public" location="f0:2560" file="f0" line="2560"/>
  <Field id="_3126" name="overall_left" type="_1366" offset="160" context="_678" access="public" location="f0:2561" file="f0" line="2561"/>
  <Field id="_3127" name="overall_right" type="_1366" offset="192" context="_678" access="public" location="f0:2562" file="f0" line="2562"/>
  <Destructor id="_3128" name="xcb_query_text_extents_reply_t" artificial="1" throw="" context="_678" access="public" mangled="_ZN30xcb_query_text_extents_reply_tD1Ev *INTERNAL* " demangled="xcb_query_text_extents_reply_t::~xcb_query_text_extents_reply_t()" location="f0:2551" file="f0" line="2551" endline="2551" inline="1">
  </Destructor>
  <OperatorMethod id="_3129" name="=" returns="_5445" artificial="1" throw="" context="_678" access="public" mangled="_ZN30xcb_query_text_extents_reply_taSERKS_" demangled="xcb_query_text_extents_reply_t::operator=(xcb_query_text_extents_reply_t const&amp;)" location="f0:2551" file="f0" line="2551" endline="2551" inline="1">
    <Argument type="_5446" location="f0:2551" file="f0" line="2551"/>
  </OperatorMethod>
  <Constructor id="_3130" name="xcb_query_text_extents_reply_t" artificial="1" throw="" context="_678" access="public" mangled="_ZN30xcb_query_text_extents_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_text_extents_reply_t::xcb_query_text_extents_reply_t(xcb_query_text_extents_reply_t const&amp;)" location="f0:2551" file="f0" line="2551" endline="2551" inline="1">
    <Argument type="_5446" location="f0:2551" file="f0" line="2551"/>
  </Constructor>
  <Constructor id="_3131" name="xcb_query_text_extents_reply_t" artificial="1" throw="" context="_678" access="public" mangled="_ZN30xcb_query_text_extents_reply_tC1Ev *INTERNAL* " demangled="xcb_query_text_extents_reply_t::xcb_query_text_extents_reply_t()" location="f0:2551" file="f0" line="2551" inline="1"/>
  <Field id="_3132" name="major_opcode" type="_1478" offset="0" context="_681" access="public" location="f0:2318" file="f0" line="2318"/>
  <Field id="_3133" name="pad0" type="_1478" offset="8" context="_681" access="public" location="f0:2319" file="f0" line="2319"/>
  <Field id="_3134" name="length" type="_1399" offset="16" context="_681" access="public" location="f0:2320" file="f0" line="2320"/>
  <Field id="_3135" name="src_window" type="_680" offset="32" context="_681" access="public" location="f0:2321" file="f0" line="2321"/>
  <Field id="_3136" name="dst_window" type="_680" offset="64" context="_681" access="public" location="f0:2322" file="f0" line="2322"/>
  <Field id="_3137" name="src_x" type="_883" offset="96" context="_681" access="public" location="f0:2323" file="f0" line="2323"/>
  <Field id="_3138" name="src_y" type="_883" offset="112" context="_681" access="public" location="f0:2324" file="f0" line="2324"/>
  <Field id="_3139" name="src_width" type="_1399" offset="128" context="_681" access="public" location="f0:2325" file="f0" line="2325"/>
  <Field id="_3140" name="src_height" type="_1399" offset="144" context="_681" access="public" location="f0:2326" file="f0" line="2326"/>
  <Field id="_3141" name="dst_x" type="_883" offset="160" context="_681" access="public" location="f0:2327" file="f0" line="2327"/>
  <Field id="_3142" name="dst_y" type="_883" offset="176" context="_681" access="public" location="f0:2328" file="f0" line="2328"/>
  <Destructor id="_3143" name="xcb_warp_pointer_request_t" artificial="1" throw="" context="_681" access="public" mangled="_ZN26xcb_warp_pointer_request_tD1Ev *INTERNAL* " demangled="xcb_warp_pointer_request_t::~xcb_warp_pointer_request_t()" location="f0:2317" file="f0" line="2317" endline="2317" inline="1">
  </Destructor>
  <OperatorMethod id="_3144" name="=" returns="_5447" artificial="1" throw="" context="_681" access="public" mangled="_ZN26xcb_warp_pointer_request_taSERKS_" demangled="xcb_warp_pointer_request_t::operator=(xcb_warp_pointer_request_t const&amp;)" location="f0:2317" file="f0" line="2317" endline="2317" inline="1">
    <Argument type="_5448" location="f0:2317" file="f0" line="2317"/>
  </OperatorMethod>
  <Constructor id="_3145" name="xcb_warp_pointer_request_t" artificial="1" throw="" context="_681" access="public" mangled="_ZN26xcb_warp_pointer_request_tC1ERKS_ *INTERNAL* " demangled="xcb_warp_pointer_request_t::xcb_warp_pointer_request_t(xcb_warp_pointer_request_t const&amp;)" location="f0:2317" file="f0" line="2317" endline="2317" inline="1">
    <Argument type="_5448" location="f0:2317" file="f0" line="2317"/>
  </Constructor>
  <Constructor id="_3146" name="xcb_warp_pointer_request_t" artificial="1" throw="" context="_681" access="public" mangled="_ZN26xcb_warp_pointer_request_tC1Ev *INTERNAL* " demangled="xcb_warp_pointer_request_t::xcb_warp_pointer_request_t()" location="f0:2317" file="f0" line="2317" inline="1"/>
  <Field id="_3147" name="namelen" type="_184" offset="0" context="_683" access="public" location="f14:206" file="f14" line="206"/>
  <Field id="_3148" name="name" type="_1121" offset="64" context="_683" access="public" location="f14:207" file="f14" line="207"/>
  <Field id="_3149" name="datalen" type="_184" offset="128" context="_683" access="public" location="f14:208" file="f14" line="208"/>
  <Field id="_3150" name="data" type="_1121" offset="192" context="_683" access="public" location="f14:209" file="f14" line="209"/>
  <Destructor id="_3151" name="xcb_auth_info_t" artificial="1" throw="" context="_683" access="public" mangled="_ZN15xcb_auth_info_tD1Ev *INTERNAL* " demangled="xcb_auth_info_t::~xcb_auth_info_t()" location="f14:205" file="f14" line="205" endline="205" inline="1">
  </Destructor>
  <OperatorMethod id="_3152" name="=" returns="_5449" artificial="1" throw="" context="_683" access="public" mangled="_ZN15xcb_auth_info_taSERKS_" demangled="xcb_auth_info_t::operator=(xcb_auth_info_t const&amp;)" location="f14:205" file="f14" line="205" endline="205" inline="1">
    <Argument type="_5450" location="f14:205" file="f14" line="205"/>
  </OperatorMethod>
  <Constructor id="_3153" name="xcb_auth_info_t" artificial="1" throw="" context="_683" access="public" mangled="_ZN15xcb_auth_info_tC1ERKS_ *INTERNAL* " demangled="xcb_auth_info_t::xcb_auth_info_t(xcb_auth_info_t const&amp;)" location="f14:205" file="f14" line="205" endline="205" inline="1">
    <Argument type="_5450" location="f14:205" file="f14" line="205"/>
  </Constructor>
  <Constructor id="_3154" name="xcb_auth_info_t" artificial="1" throw="" context="_683" access="public" mangled="_ZN15xcb_auth_info_tC1Ev *INTERNAL* " demangled="xcb_auth_info_t::xcb_auth_info_t()" location="f14:205" file="f14" line="205" inline="1"/>
  <Field id="_3155" name="response_type" type="_1478" offset="0" context="_686" access="public" location="f0:1723" file="f0" line="1723"/>
  <Field id="_3156" name="pad0" type="_1478" offset="8" context="_686" access="public" location="f0:1724" file="f0" line="1724"/>
  <Field id="_3157" name="sequence" type="_1399" offset="16" context="_686" access="public" location="f0:1725" file="f0" line="1725"/>
  <Field id="_3158" name="length" type="_699" offset="32" context="_686" access="public" location="f0:1726" file="f0" line="1726"/>
  <Field id="_3159" name="name_len" type="_1399" offset="64" context="_686" access="public" location="f0:1727" file="f0" line="1727"/>
  <Field id="_3160" name="pad1" type="_5173" offset="80" context="_686" access="public" location="f0:1728" file="f0" line="1728"/>
  <Destructor id="_3161" name="xcb_get_atom_name_reply_t" artificial="1" throw="" context="_686" access="public" mangled="_ZN25xcb_get_atom_name_reply_tD1Ev *INTERNAL* " demangled="xcb_get_atom_name_reply_t::~xcb_get_atom_name_reply_t()" location="f0:1722" file="f0" line="1722" endline="1722" inline="1">
  </Destructor>
  <OperatorMethod id="_3162" name="=" returns="_5451" artificial="1" throw="" context="_686" access="public" mangled="_ZN25xcb_get_atom_name_reply_taSERKS_" demangled="xcb_get_atom_name_reply_t::operator=(xcb_get_atom_name_reply_t const&amp;)" location="f0:1722" file="f0" line="1722" endline="1722" inline="1">
    <Argument type="_5452" location="f0:1722" file="f0" line="1722"/>
  </OperatorMethod>
  <Constructor id="_3163" name="xcb_get_atom_name_reply_t" artificial="1" throw="" context="_686" access="public" mangled="_ZN25xcb_get_atom_name_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_atom_name_reply_t::xcb_get_atom_name_reply_t(xcb_get_atom_name_reply_t const&amp;)" location="f0:1722" file="f0" line="1722" endline="1722" inline="1">
    <Argument type="_5452" location="f0:1722" file="f0" line="1722"/>
  </Constructor>
  <Constructor id="_3164" name="xcb_get_atom_name_reply_t" artificial="1" throw="" context="_686" access="public" mangled="_ZN25xcb_get_atom_name_reply_tC1Ev *INTERNAL* " demangled="xcb_get_atom_name_reply_t::xcb_get_atom_name_reply_t()" location="f0:1722" file="f0" line="1722" inline="1"/>
  <Field id="_3165" name="pixel" type="_699" offset="0" context="_688" access="public" location="f0:3529" file="f0" line="3529"/>
  <Field id="_3166" name="red" type="_1399" offset="32" context="_688" access="public" location="f0:3530" file="f0" line="3530"/>
  <Field id="_3167" name="green" type="_1399" offset="48" context="_688" access="public" location="f0:3531" file="f0" line="3531"/>
  <Field id="_3168" name="blue" type="_1399" offset="64" context="_688" access="public" location="f0:3532" file="f0" line="3532"/>
  <Field id="_3169" name="flags" type="_1478" offset="80" context="_688" access="public" location="f0:3533" file="f0" line="3533"/>
  <Field id="_3170" name="pad0" type="_1478" offset="88" context="_688" access="public" location="f0:3534" file="f0" line="3534"/>
  <Destructor id="_3171" name="xcb_coloritem_t" artificial="1" throw="" context="_688" access="public" mangled="_ZN15xcb_coloritem_tD1Ev *INTERNAL* " demangled="xcb_coloritem_t::~xcb_coloritem_t()" location="f0:3528" file="f0" line="3528" endline="3528" inline="1">
  </Destructor>
  <OperatorMethod id="_3172" name="=" returns="_5453" artificial="1" throw="" context="_688" access="public" mangled="_ZN15xcb_coloritem_taSERKS_" demangled="xcb_coloritem_t::operator=(xcb_coloritem_t const&amp;)" location="f0:3528" file="f0" line="3528" endline="3528" inline="1">
    <Argument type="_5454" location="f0:3528" file="f0" line="3528"/>
  </OperatorMethod>
  <Constructor id="_3173" name="xcb_coloritem_t" artificial="1" throw="" context="_688" access="public" mangled="_ZN15xcb_coloritem_tC1ERKS_ *INTERNAL* " demangled="xcb_coloritem_t::xcb_coloritem_t(xcb_coloritem_t const&amp;)" location="f0:3528" file="f0" line="3528" endline="3528" inline="1">
    <Argument type="_5454" location="f0:3528" file="f0" line="3528"/>
  </Constructor>
  <Constructor id="_3174" name="xcb_coloritem_t" artificial="1" throw="" context="_688" access="public" mangled="_ZN15xcb_coloritem_tC1Ev *INTERNAL* " demangled="xcb_coloritem_t::xcb_coloritem_t()" location="f0:3528" file="f0" line="3528" inline="1"/>
  <Field id="_3175" name="major_opcode" type="_1478" offset="0" context="_693" access="public" location="f0:3553" file="f0" line="3553"/>
  <Field id="_3176" name="pad0" type="_1478" offset="8" context="_693" access="public" location="f0:3554" file="f0" line="3554"/>
  <Field id="_3177" name="length" type="_1399" offset="16" context="_693" access="public" location="f0:3555" file="f0" line="3555"/>
  <Field id="_3178" name="cmap" type="_720" offset="32" context="_693" access="public" location="f0:3556" file="f0" line="3556"/>
  <Destructor id="_3179" name="xcb_store_colors_request_t" artificial="1" throw="" context="_693" access="public" mangled="_ZN26xcb_store_colors_request_tD1Ev *INTERNAL* " demangled="xcb_store_colors_request_t::~xcb_store_colors_request_t()" location="f0:3552" file="f0" line="3552" endline="3552" inline="1">
  </Destructor>
  <OperatorMethod id="_3180" name="=" returns="_5455" artificial="1" throw="" context="_693" access="public" mangled="_ZN26xcb_store_colors_request_taSERKS_" demangled="xcb_store_colors_request_t::operator=(xcb_store_colors_request_t const&amp;)" location="f0:3552" file="f0" line="3552" endline="3552" inline="1">
    <Argument type="_5456" location="f0:3552" file="f0" line="3552"/>
  </OperatorMethod>
  <Constructor id="_3181" name="xcb_store_colors_request_t" artificial="1" throw="" context="_693" access="public" mangled="_ZN26xcb_store_colors_request_tC1ERKS_ *INTERNAL* " demangled="xcb_store_colors_request_t::xcb_store_colors_request_t(xcb_store_colors_request_t const&amp;)" location="f0:3552" file="f0" line="3552" endline="3552" inline="1">
    <Argument type="_5456" location="f0:3552" file="f0" line="3552"/>
  </Constructor>
  <Constructor id="_3182" name="xcb_store_colors_request_t" artificial="1" throw="" context="_693" access="public" mangled="_ZN26xcb_store_colors_request_tC1Ev *INTERNAL* " demangled="xcb_store_colors_request_t::xcb_store_colors_request_t()" location="f0:3552" file="f0" line="3552" inline="1"/>
  <PointerType id="_3183" type="_1419" size="64" align="64"/>
  <Field id="_3184" name="major_opcode" type="_1478" offset="0" context="_701" access="public" location="f0:2827" file="f0" line="2827"/>
  <Field id="_3185" name="pad0" type="_1478" offset="8" context="_701" access="public" location="f0:2828" file="f0" line="2828"/>
  <Field id="_3186" name="length" type="_1399" offset="16" context="_701" access="public" location="f0:2829" file="f0" line="2829"/>
  <Field id="_3187" name="cid" type="_1792" offset="32" context="_701" access="public" location="f0:2830" file="f0" line="2830"/>
  <Field id="_3188" name="drawable" type="_878" offset="64" context="_701" access="public" location="f0:2831" file="f0" line="2831"/>
  <Field id="_3189" name="value_mask" type="_699" offset="96" context="_701" access="public" location="f0:2832" file="f0" line="2832"/>
  <Destructor id="_3190" name="xcb_create_gc_request_t" artificial="1" throw="" context="_701" access="public" mangled="_ZN23xcb_create_gc_request_tD1Ev *INTERNAL* " demangled="xcb_create_gc_request_t::~xcb_create_gc_request_t()" location="f0:2826" file="f0" line="2826" endline="2826" inline="1">
  </Destructor>
  <OperatorMethod id="_3191" name="=" returns="_5457" artificial="1" throw="" context="_701" access="public" mangled="_ZN23xcb_create_gc_request_taSERKS_" demangled="xcb_create_gc_request_t::operator=(xcb_create_gc_request_t const&amp;)" location="f0:2826" file="f0" line="2826" endline="2826" inline="1">
    <Argument type="_5458" location="f0:2826" file="f0" line="2826"/>
  </OperatorMethod>
  <Constructor id="_3192" name="xcb_create_gc_request_t" artificial="1" throw="" context="_701" access="public" mangled="_ZN23xcb_create_gc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_create_gc_request_t::xcb_create_gc_request_t(xcb_create_gc_request_t const&amp;)" location="f0:2826" file="f0" line="2826" endline="2826" inline="1">
    <Argument type="_5458" location="f0:2826" file="f0" line="2826"/>
  </Constructor>
  <Constructor id="_3193" name="xcb_create_gc_request_t" artificial="1" throw="" context="_701" access="public" mangled="_ZN23xcb_create_gc_request_tC1Ev *INTERNAL* " demangled="xcb_create_gc_request_t::xcb_create_gc_request_t()" location="f0:2826" file="f0" line="2826" inline="1"/>
  <Field id="_3194" name="x" type="_883" offset="0" context="_704" access="public" location="f0:213" file="f0" line="213"/>
  <Field id="_3195" name="y" type="_883" offset="16" context="_704" access="public" location="f0:214" file="f0" line="214"/>
  <Field id="_3196" name="width" type="_1399" offset="32" context="_704" access="public" location="f0:215" file="f0" line="215"/>
  <Field id="_3197" name="height" type="_1399" offset="48" context="_704" access="public" location="f0:216" file="f0" line="216"/>
  <Destructor id="_3198" name="xcb_rectangle_t" artificial="1" throw="" context="_704" access="public" mangled="_ZN15xcb_rectangle_tD1Ev *INTERNAL* " demangled="xcb_rectangle_t::~xcb_rectangle_t()" location="f0:212" file="f0" line="212" endline="212" inline="1">
  </Destructor>
  <OperatorMethod id="_3199" name="=" returns="_5459" artificial="1" throw="" context="_704" access="public" mangled="_ZN15xcb_rectangle_taSERKS_" demangled="xcb_rectangle_t::operator=(xcb_rectangle_t const&amp;)" location="f0:212" file="f0" line="212" endline="212" inline="1">
    <Argument type="_5460" location="f0:212" file="f0" line="212"/>
  </OperatorMethod>
  <Constructor id="_3200" name="xcb_rectangle_t" artificial="1" throw="" context="_704" access="public" mangled="_ZN15xcb_rectangle_tC1ERKS_ *INTERNAL* " demangled="xcb_rectangle_t::xcb_rectangle_t(xcb_rectangle_t const&amp;)" location="f0:212" file="f0" line="212" endline="212" inline="1">
    <Argument type="_5460" location="f0:212" file="f0" line="212"/>
  </Constructor>
  <Constructor id="_3201" name="xcb_rectangle_t" artificial="1" throw="" context="_704" access="public" mangled="_ZN15xcb_rectangle_tC1Ev *INTERNAL* " demangled="xcb_rectangle_t::xcb_rectangle_t()" location="f0:212" file="f0" line="212" inline="1"/>
  <PointerType id="_3202" type="_1510" size="64" align="64"/>
  <PointerType id="_3203" type="_1736c" size="64" align="64"/>
  <PointerType id="_3204" type="_435" size="64" align="64"/>
  <Field id="_3205" name="sequence" type="_151" offset="0" context="_715" access="public" location="f0:3760" file="f0" line="3760"/>
  <Destructor id="_3206" name="xcb_query_best_size_cookie_t" artificial="1" throw="" context="_715" access="public" mangled="_ZN28xcb_query_best_size_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_best_size_cookie_t::~xcb_query_best_size_cookie_t()" location="f0:3759" file="f0" line="3759" endline="3759" inline="1">
  </Destructor>
  <OperatorMethod id="_3207" name="=" returns="_5462" artificial="1" throw="" context="_715" access="public" mangled="_ZN28xcb_query_best_size_cookie_taSERKS_" demangled="xcb_query_best_size_cookie_t::operator=(xcb_query_best_size_cookie_t const&amp;)" location="f0:3759" file="f0" line="3759" endline="3759" inline="1">
    <Argument type="_5463" location="f0:3759" file="f0" line="3759"/>
  </OperatorMethod>
  <Constructor id="_3208" name="xcb_query_best_size_cookie_t" artificial="1" throw="" context="_715" access="public" mangled="_ZN28xcb_query_best_size_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_best_size_cookie_t::xcb_query_best_size_cookie_t(xcb_query_best_size_cookie_t const&amp;)" location="f0:3759" file="f0" line="3759" endline="3759" inline="1">
    <Argument type="_5463" location="f0:3759" file="f0" line="3759"/>
  </Constructor>
  <Constructor id="_3209" name="xcb_query_best_size_cookie_t" artificial="1" throw="" context="_715" access="public" mangled="_ZN28xcb_query_best_size_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_best_size_cookie_t::xcb_query_best_size_cookie_t()" location="f0:3759" file="f0" line="3759" inline="1"/>
  <Field id="_3210" name="response_type" type="_1478" offset="0" context="_722" access="public" location="f0:3895" file="f0" line="3895"/>
  <Field id="_3211" name="keysyms_per_keycode" type="_1478" offset="8" context="_722" access="public" location="f0:3896" file="f0" line="3896"/>
  <Field id="_3212" name="sequence" type="_1399" offset="16" context="_722" access="public" location="f0:3897" file="f0" line="3897"/>
  <Field id="_3213" name="length" type="_699" offset="32" context="_722" access="public" location="f0:3898" file="f0" line="3898"/>
  <Field id="_3214" name="pad0" type="_5426" offset="64" context="_722" access="public" location="f0:3899" file="f0" line="3899"/>
  <Destructor id="_3215" name="xcb_get_keyboard_mapping_reply_t" artificial="1" throw="" context="_722" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_tD1Ev *INTERNAL* " demangled="xcb_get_keyboard_mapping_reply_t::~xcb_get_keyboard_mapping_reply_t()" location="f0:3894" file="f0" line="3894" endline="3894" inline="1">
  </Destructor>
  <OperatorMethod id="_3216" name="=" returns="_5464" artificial="1" throw="" context="_722" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_taSERKS_" demangled="xcb_get_keyboard_mapping_reply_t::operator=(xcb_get_keyboard_mapping_reply_t const&amp;)" location="f0:3894" file="f0" line="3894" endline="3894" inline="1">
    <Argument type="_5465" location="f0:3894" file="f0" line="3894"/>
  </OperatorMethod>
  <Constructor id="_3217" name="xcb_get_keyboard_mapping_reply_t" artificial="1" throw="" context="_722" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_keyboard_mapping_reply_t::xcb_get_keyboard_mapping_reply_t(xcb_get_keyboard_mapping_reply_t const&amp;)" location="f0:3894" file="f0" line="3894" endline="3894" inline="1">
    <Argument type="_5465" location="f0:3894" file="f0" line="3894"/>
  </Constructor>
  <Constructor id="_3218" name="xcb_get_keyboard_mapping_reply_t" artificial="1" throw="" context="_722" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_tC1Ev *INTERNAL* " demangled="xcb_get_keyboard_mapping_reply_t::xcb_get_keyboard_mapping_reply_t()" location="f0:3894" file="f0" line="3894" inline="1"/>
  <Field id="_3219" name="_reply" type="_2241" offset="0" context="_725" access="public" location="f3:54" file="f3" line="54"/>
  <Field id="_3220" name="encoding" type="_1679" offset="64" context="_725" access="public" location="f3:56" file="f3" line="56"/>
  <Field id="_3221" name="name_len" type="_699" offset="96" context="_725" access="public" location="f3:58" file="f3" line="58"/>
  <Field id="_3222" name="name" type="_1121" offset="128" context="_725" access="public" location="f3:60" file="f3" line="60"/>
  <Field id="_3223" name="format" type="_1478" offset="192" context="_725" access="public" location="f3:62" file="f3" line="62"/>
  <Destructor id="_3224" name="._33" artificial="1" throw="" context="_725" access="public" mangled="_ZN35xcb_icccm_get_text_property_reply_tD1Ev *INTERNAL* " demangled="xcb_icccm_get_text_property_reply_t::~xcb_icccm_get_text_property_reply_t()" location="f3:63" file="f3" line="63" endline="63" inline="1">
  </Destructor>
  <OperatorMethod id="_3225" name="=" returns="_5466" artificial="1" throw="" context="_725" access="public" mangled="_ZN35xcb_icccm_get_text_property_reply_taSERKS_" demangled="xcb_icccm_get_text_property_reply_t::operator=(xcb_icccm_get_text_property_reply_t const&amp;)" location="f3:63" file="f3" line="63" endline="63" inline="1">
    <Argument type="_5467" location="f3:51" file="f3" line="51"/>
  </OperatorMethod>
  <Constructor id="_3226" name="._33" artificial="1" throw="" context="_725" access="public" mangled="_ZN35xcb_icccm_get_text_property_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_icccm_get_text_property_reply_t::xcb_icccm_get_text_property_reply_t(xcb_icccm_get_text_property_reply_t const&amp;)" location="f3:63" file="f3" line="63" endline="63" inline="1">
    <Argument type="_5467" location="f3:51" file="f3" line="51"/>
  </Constructor>
  <Constructor id="_3227" name="._33" artificial="1" throw="" context="_725" access="public" mangled="_ZN35xcb_icccm_get_text_property_reply_tC1Ev *INTERNAL* " demangled="xcb_icccm_get_text_property_reply_t::xcb_icccm_get_text_property_reply_t()" location="f3:63" file="f3" line="63" inline="1"/>
  <PointerType id="_3228" type="_41" size="64" align="64"/>
  <PointerType id="_3229" type="_253" size="64" align="64"/>
  <Field id="_3230" name="x" type="_883" offset="0" context="_730" access="public" location="f0:232" file="f0" line="232"/>
  <Field id="_3231" name="y" type="_883" offset="16" context="_730" access="public" location="f0:233" file="f0" line="233"/>
  <Field id="_3232" name="width" type="_1399" offset="32" context="_730" access="public" location="f0:234" file="f0" line="234"/>
  <Field id="_3233" name="height" type="_1399" offset="48" context="_730" access="public" location="f0:235" file="f0" line="235"/>
  <Field id="_3234" name="angle1" type="_883" offset="64" context="_730" access="public" location="f0:236" file="f0" line="236"/>
  <Field id="_3235" name="angle2" type="_883" offset="80" context="_730" access="public" location="f0:237" file="f0" line="237"/>
  <Destructor id="_3236" name="xcb_arc_t" artificial="1" throw="" context="_730" access="public" mangled="_ZN9xcb_arc_tD1Ev *INTERNAL* " demangled="xcb_arc_t::~xcb_arc_t()" location="f0:231" file="f0" line="231" endline="231" inline="1">
  </Destructor>
  <OperatorMethod id="_3237" name="=" returns="_5468" artificial="1" throw="" context="_730" access="public" mangled="_ZN9xcb_arc_taSERKS_" demangled="xcb_arc_t::operator=(xcb_arc_t const&amp;)" location="f0:231" file="f0" line="231" endline="231" inline="1">
    <Argument type="_5469" location="f0:231" file="f0" line="231"/>
  </OperatorMethod>
  <Constructor id="_3238" name="xcb_arc_t" artificial="1" throw="" context="_730" access="public" mangled="_ZN9xcb_arc_tC1ERKS_ *INTERNAL* " demangled="xcb_arc_t::xcb_arc_t(xcb_arc_t const&amp;)" location="f0:231" file="f0" line="231" endline="231" inline="1">
    <Argument type="_5469" location="f0:231" file="f0" line="231"/>
  </Constructor>
  <Constructor id="_3239" name="xcb_arc_t" artificial="1" throw="" context="_730" access="public" mangled="_ZN9xcb_arc_tC1Ev *INTERNAL* " demangled="xcb_arc_t::xcb_arc_t()" location="f0:231" file="f0" line="231" inline="1"/>
  <Field id="_3240" name="major_opcode" type="_1478" offset="0" context="_734" access="public" location="f0:3334" file="f0" line="3334"/>
  <Field id="_3241" name="pad0" type="_1478" offset="8" context="_734" access="public" location="f0:3335" file="f0" line="3335"/>
  <Field id="_3242" name="length" type="_1399" offset="16" context="_734" access="public" location="f0:3336" file="f0" line="3336"/>
  <Field id="_3243" name="window" type="_680" offset="32" context="_734" access="public" location="f0:3337" file="f0" line="3337"/>
  <Destructor id="_3244" name="xcb_list_installed_colormaps_request_t" artificial="1" throw="" context="_734" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_tD1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_request_t::~xcb_list_installed_colormaps_request_t()" location="f0:3333" file="f0" line="3333" endline="3333" inline="1">
  </Destructor>
  <OperatorMethod id="_3245" name="=" returns="_5470" artificial="1" throw="" context="_734" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_taSERKS_" demangled="xcb_list_installed_colormaps_request_t::operator=(xcb_list_installed_colormaps_request_t const&amp;)" location="f0:3333" file="f0" line="3333" endline="3333" inline="1">
    <Argument type="_5471" location="f0:3333" file="f0" line="3333"/>
  </OperatorMethod>
  <Constructor id="_3246" name="xcb_list_installed_colormaps_request_t" artificial="1" throw="" context="_734" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_tC1ERKS_ *INTERNAL* " demangled="xcb_list_installed_colormaps_request_t::xcb_list_installed_colormaps_request_t(xcb_list_installed_colormaps_request_t const&amp;)" location="f0:3333" file="f0" line="3333" endline="3333" inline="1">
    <Argument type="_5471" location="f0:3333" file="f0" line="3333"/>
  </Constructor>
  <Constructor id="_3247" name="xcb_list_installed_colormaps_request_t" artificial="1" throw="" context="_734" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_tC1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_request_t::xcb_list_installed_colormaps_request_t()" location="f0:3333" file="f0" line="3333" inline="1"/>
  <Field id="_3248" name="sequence" type="_151" offset="0" context="_738" access="public" location="f0:1947" file="f0" line="1947"/>
  <Destructor id="_3249" name="xcb_grab_pointer_cookie_t" artificial="1" throw="" context="_738" access="public" mangled="_ZN25xcb_grab_pointer_cookie_tD1Ev *INTERNAL* " demangled="xcb_grab_pointer_cookie_t::~xcb_grab_pointer_cookie_t()" location="f0:1946" file="f0" line="1946" endline="1946" inline="1">
  </Destructor>
  <OperatorMethod id="_3250" name="=" returns="_5472" artificial="1" throw="" context="_738" access="public" mangled="_ZN25xcb_grab_pointer_cookie_taSERKS_" demangled="xcb_grab_pointer_cookie_t::operator=(xcb_grab_pointer_cookie_t const&amp;)" location="f0:1946" file="f0" line="1946" endline="1946" inline="1">
    <Argument type="_5473" location="f0:1946" file="f0" line="1946"/>
  </OperatorMethod>
  <Constructor id="_3251" name="xcb_grab_pointer_cookie_t" artificial="1" throw="" context="_738" access="public" mangled="_ZN25xcb_grab_pointer_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_grab_pointer_cookie_t::xcb_grab_pointer_cookie_t(xcb_grab_pointer_cookie_t const&amp;)" location="f0:1946" file="f0" line="1946" endline="1946" inline="1">
    <Argument type="_5473" location="f0:1946" file="f0" line="1946"/>
  </Constructor>
  <Constructor id="_3252" name="xcb_grab_pointer_cookie_t" artificial="1" throw="" context="_738" access="public" mangled="_ZN25xcb_grab_pointer_cookie_tC1Ev *INTERNAL* " demangled="xcb_grab_pointer_cookie_t::xcb_grab_pointer_cookie_t()" location="f0:1946" file="f0" line="1946" inline="1"/>
  <PointerType id="_3253" type="_1505" size="64" align="64"/>
  <Field id="_3254" name="major_opcode" type="_1478" offset="0" context="_746" access="public" location="f0:3274" file="f0" line="3274"/>
  <Field id="_3255" name="pad0" type="_1478" offset="8" context="_746" access="public" location="f0:3275" file="f0" line="3275"/>
  <Field id="_3256" name="length" type="_1399" offset="16" context="_746" access="public" location="f0:3276" file="f0" line="3276"/>
  <Field id="_3257" name="cmap" type="_720" offset="32" context="_746" access="public" location="f0:3277" file="f0" line="3277"/>
  <Destructor id="_3258" name="xcb_free_colormap_request_t" artificial="1" throw="" context="_746" access="public" mangled="_ZN27xcb_free_colormap_request_tD1Ev *INTERNAL* " demangled="xcb_free_colormap_request_t::~xcb_free_colormap_request_t()" location="f0:3273" file="f0" line="3273" endline="3273" inline="1">
  </Destructor>
  <OperatorMethod id="_3259" name="=" returns="_5474" artificial="1" throw="" context="_746" access="public" mangled="_ZN27xcb_free_colormap_request_taSERKS_" demangled="xcb_free_colormap_request_t::operator=(xcb_free_colormap_request_t const&amp;)" location="f0:3273" file="f0" line="3273" endline="3273" inline="1">
    <Argument type="_5475" location="f0:3273" file="f0" line="3273"/>
  </OperatorMethod>
  <Constructor id="_3260" name="xcb_free_colormap_request_t" artificial="1" throw="" context="_746" access="public" mangled="_ZN27xcb_free_colormap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_free_colormap_request_t::xcb_free_colormap_request_t(xcb_free_colormap_request_t const&amp;)" location="f0:3273" file="f0" line="3273" endline="3273" inline="1">
    <Argument type="_5475" location="f0:3273" file="f0" line="3273"/>
  </Constructor>
  <Constructor id="_3261" name="xcb_free_colormap_request_t" artificial="1" throw="" context="_746" access="public" mangled="_ZN27xcb_free_colormap_request_tC1Ev *INTERNAL* " demangled="xcb_free_colormap_request_t::xcb_free_colormap_request_t()" location="f0:3273" file="f0" line="3273" inline="1"/>
  <Field id="_3262" name="response_type" type="_1478" offset="0" context="_749" access="public" location="f0:663" file="f0" line="663"/>
  <Field id="_3263" name="detail" type="_1478" offset="8" context="_749" access="public" location="f0:664" file="f0" line="664"/>
  <Field id="_3264" name="sequence" type="_1399" offset="16" context="_749" access="public" location="f0:665" file="f0" line="665"/>
  <Field id="_3265" name="event" type="_680" offset="32" context="_749" access="public" location="f0:666" file="f0" line="666"/>
  <Field id="_3266" name="mode" type="_1478" offset="64" context="_749" access="public" location="f0:667" file="f0" line="667"/>
  <Field id="_3267" name="pad0" type="_5162" offset="72" context="_749" access="public" location="f0:668" file="f0" line="668"/>
  <Destructor id="_3268" name="xcb_focus_in_event_t" artificial="1" throw="" context="_749" access="public" mangled="_ZN20xcb_focus_in_event_tD1Ev *INTERNAL* " demangled="xcb_focus_in_event_t::~xcb_focus_in_event_t()" location="f0:662" file="f0" line="662" endline="662" inline="1">
  </Destructor>
  <OperatorMethod id="_3269" name="=" returns="_5476" artificial="1" throw="" context="_749" access="public" mangled="_ZN20xcb_focus_in_event_taSERKS_" demangled="xcb_focus_in_event_t::operator=(xcb_focus_in_event_t const&amp;)" location="f0:662" file="f0" line="662" endline="662" inline="1">
    <Argument type="_5477" location="f0:662" file="f0" line="662"/>
  </OperatorMethod>
  <Constructor id="_3270" name="xcb_focus_in_event_t" artificial="1" throw="" context="_749" access="public" mangled="_ZN20xcb_focus_in_event_tC1ERKS_ *INTERNAL* " demangled="xcb_focus_in_event_t::xcb_focus_in_event_t(xcb_focus_in_event_t const&amp;)" location="f0:662" file="f0" line="662" endline="662" inline="1">
    <Argument type="_5477" location="f0:662" file="f0" line="662"/>
  </Constructor>
  <Constructor id="_3271" name="xcb_focus_in_event_t" artificial="1" throw="" context="_749" access="public" mangled="_ZN20xcb_focus_in_event_tC1Ev *INTERNAL* " demangled="xcb_focus_in_event_t::xcb_focus_in_event_t()" location="f0:662" file="f0" line="662" inline="1"/>
  <Field id="_3272" name="data" type="_503" offset="0" context="_751" access="public" location="f14:107" file="f14" line="107"/>
  <Field id="_3273" name="rem" type="_184" offset="64" context="_751" access="public" location="f14:108" file="f14" line="108"/>
  <Field id="_3274" name="index" type="_184" offset="96" context="_751" access="public" location="f14:109" file="f14" line="109"/>
  <Destructor id="_3275" name="._27" artificial="1" throw="" context="_751" access="public" mangled="_ZN22xcb_generic_iterator_tD1Ev *INTERNAL* " demangled="xcb_generic_iterator_t::~xcb_generic_iterator_t()" location="f14:110" file="f14" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_3276" name="=" returns="_5478" artificial="1" throw="" context="_751" access="public" mangled="_ZN22xcb_generic_iterator_taSERKS_" demangled="xcb_generic_iterator_t::operator=(xcb_generic_iterator_t const&amp;)" location="f14:110" file="f14" line="110" endline="110" inline="1">
    <Argument type="_5479" location="f14:106" file="f14" line="106"/>
  </OperatorMethod>
  <Constructor id="_3277" name="._27" artificial="1" throw="" context="_751" access="public" mangled="_ZN22xcb_generic_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_generic_iterator_t::xcb_generic_iterator_t(xcb_generic_iterator_t const&amp;)" location="f14:110" file="f14" line="110" endline="110" inline="1">
    <Argument type="_5479" location="f14:106" file="f14" line="106"/>
  </Constructor>
  <Constructor id="_3278" name="._27" artificial="1" throw="" context="_751" access="public" mangled="_ZN22xcb_generic_iterator_tC1Ev *INTERNAL* " demangled="xcb_generic_iterator_t::xcb_generic_iterator_t()" location="f14:110" file="f14" line="110" inline="1"/>
  <PointerType id="_3279" type="_28c" size="64" align="64"/>
  <Field id="_3280" name="major_opcode" type="_1478" offset="0" context="_755" access="public" location="f0:4253" file="f0" line="4253"/>
  <Field id="_3281" name="mode" type="_1478" offset="8" context="_755" access="public" location="f0:4254" file="f0" line="4254"/>
  <Field id="_3282" name="length" type="_1399" offset="16" context="_755" access="public" location="f0:4255" file="f0" line="4255"/>
  <Destructor id="_3283" name="xcb_force_screen_saver_request_t" artificial="1" throw="" context="_755" access="public" mangled="_ZN32xcb_force_screen_saver_request_tD1Ev *INTERNAL* " demangled="xcb_force_screen_saver_request_t::~xcb_force_screen_saver_request_t()" location="f0:4252" file="f0" line="4252" endline="4252" inline="1">
  </Destructor>
  <OperatorMethod id="_3284" name="=" returns="_5481" artificial="1" throw="" context="_755" access="public" mangled="_ZN32xcb_force_screen_saver_request_taSERKS_" demangled="xcb_force_screen_saver_request_t::operator=(xcb_force_screen_saver_request_t const&amp;)" location="f0:4252" file="f0" line="4252" endline="4252" inline="1">
    <Argument type="_5482" location="f0:4252" file="f0" line="4252"/>
  </OperatorMethod>
  <Constructor id="_3285" name="xcb_force_screen_saver_request_t" artificial="1" throw="" context="_755" access="public" mangled="_ZN32xcb_force_screen_saver_request_tC1ERKS_ *INTERNAL* " demangled="xcb_force_screen_saver_request_t::xcb_force_screen_saver_request_t(xcb_force_screen_saver_request_t const&amp;)" location="f0:4252" file="f0" line="4252" endline="4252" inline="1">
    <Argument type="_5482" location="f0:4252" file="f0" line="4252"/>
  </Constructor>
  <Constructor id="_3286" name="xcb_force_screen_saver_request_t" artificial="1" throw="" context="_755" access="public" mangled="_ZN32xcb_force_screen_saver_request_tC1Ev *INTERNAL* " demangled="xcb_force_screen_saver_request_t::xcb_force_screen_saver_request_t()" location="f0:4252" file="f0" line="4252" inline="1"/>
  <Field id="_3287" name="__prev" type="_5483" offset="0" context="_757" access="public" location="f9:63" file="f9" line="63"/>
  <Field id="_3288" name="__next" type="_5483" offset="64" context="_757" access="public" location="f9:64" file="f9" line="64"/>
  <Destructor id="_3289" name="__pthread_internal_list" artificial="1" throw="" context="_757" access="public" mangled="_ZN23__pthread_internal_listD1Ev *INTERNAL* " demangled="__pthread_internal_list::~__pthread_internal_list()" location="f9:62" file="f9" line="62" endline="62" inline="1">
  </Destructor>
  <OperatorMethod id="_3290" name="=" returns="_5484" artificial="1" throw="" context="_757" access="public" mangled="_ZN23__pthread_internal_listaSERKS_" demangled="__pthread_internal_list::operator=(__pthread_internal_list const&amp;)" location="f9:62" file="f9" line="62" endline="62" inline="1">
    <Argument type="_5485" location="f9:62" file="f9" line="62"/>
  </OperatorMethod>
  <Constructor id="_3291" name="__pthread_internal_list" artificial="1" throw="" context="_757" access="public" mangled="_ZN23__pthread_internal_listC1ERKS_ *INTERNAL* " demangled="__pthread_internal_list::__pthread_internal_list(__pthread_internal_list const&amp;)" location="f9:62" file="f9" line="62" endline="62" inline="1">
    <Argument type="_5485" location="f9:62" file="f9" line="62"/>
  </Constructor>
  <Constructor id="_3292" name="__pthread_internal_list" artificial="1" throw="" context="_757" access="public" mangled="_ZN23__pthread_internal_listC1Ev *INTERNAL* " demangled="__pthread_internal_list::__pthread_internal_list()" location="f9:62" file="f9" line="62" inline="1"/>
  <Field id="_3293" name="response_type" type="_1478" offset="0" context="_761" access="public" location="f0:4357" file="f0" line="4357"/>
  <Field id="_3294" name="status" type="_1478" offset="8" context="_761" access="public" location="f0:4358" file="f0" line="4358"/>
  <Field id="_3295" name="sequence" type="_1399" offset="16" context="_761" access="public" location="f0:4359" file="f0" line="4359"/>
  <Field id="_3296" name="length" type="_699" offset="32" context="_761" access="public" location="f0:4360" file="f0" line="4360"/>
  <Destructor id="_3297" name="xcb_set_modifier_mapping_reply_t" artificial="1" throw="" context="_761" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_tD1Ev *INTERNAL* " demangled="xcb_set_modifier_mapping_reply_t::~xcb_set_modifier_mapping_reply_t()" location="f0:4356" file="f0" line="4356" endline="4356" inline="1">
  </Destructor>
  <OperatorMethod id="_3298" name="=" returns="_5486" artificial="1" throw="" context="_761" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_taSERKS_" demangled="xcb_set_modifier_mapping_reply_t::operator=(xcb_set_modifier_mapping_reply_t const&amp;)" location="f0:4356" file="f0" line="4356" endline="4356" inline="1">
    <Argument type="_5487" location="f0:4356" file="f0" line="4356"/>
  </OperatorMethod>
  <Constructor id="_3299" name="xcb_set_modifier_mapping_reply_t" artificial="1" throw="" context="_761" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_set_modifier_mapping_reply_t::xcb_set_modifier_mapping_reply_t(xcb_set_modifier_mapping_reply_t const&amp;)" location="f0:4356" file="f0" line="4356" endline="4356" inline="1">
