<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Struct id="_1881" name="xcb_fill_poly_request_t" context="_1" mangled="23xcb_fill_poly_request_t" demangled="xcb_fill_poly_request_t" location="f0:3402" file="f0" line="3402" artificial="1" size="128" align="32" members="_5085 _5086 _5087 _5088 _5089 _5090 _5091 _5092 _5093 _5094 _5095 _5096 " bases=""/>
  <Typedef id="_1882" name="xcb_fill_poly_request_t" type="_1881" context="_1" location="f0:3411" file="f0" line="3411"/>
  <Function id="_1883" name="xcb_gcontext_end" returns="_754" context="_1" location="f0:4983" file="f0" line="4983" extern="1">
    <Argument name="i" type="_1876" location="f0:4983" file="f0" line="4983"/>
  </Function>
  <Typedef id="_1884" name="xcb_keysym_t" type="_705" context="_1" location="f0:159" file="f0" line="159"/>
  <Function id="_1885" name="pthread_mutexattr_setprotocol" returns="_188" throw="" context="_1" location="f3:838" file="f3" line="838" extern="1" attributes="__nonnull__()">
    <Argument name="__attr" type="_2401" location="f3:838" file="f3" line="838"/>
    <Argument name="__protocol" type="_188" location="f3:838" file="f3" line="838"/>
  </Function>
  <Struct id="_1886" name="xcb_set_access_control_request_t" context="_1" mangled="32xcb_set_access_control_request_t" demangled="xcb_set_access_control_request_t" location="f0:4507" file="f0" line="4507" artificial="1" size="32" align="16" members="_5097 _5098 _5099 _5100 _5101 _5102 _5103 " bases=""/>
  <Typedef id="_1887" name="xcb_set_access_control_request_t" type="_1886" context="_1" location="f0:4511" file="f0" line="4511"/>
  <Struct id="_1888" name="xcb_visualtype_t" context="_1" mangled="16xcb_visualtype_t" demangled="xcb_visualtype_t" location="f0:280" file="f0" line="280" artificial="1" size="192" align="32" members="_5104 _5105 _5106 _5107 _5108 _5109 _5110 _5111 _5112 _5113 _5114 _5115 " bases=""/>
  <Typedef id="_1889" name="xcb_visualtype_t" type="_1888" context="_1" location="f0:289" file="f0" line="289"/>
  <Function id="_1890" name="pthread_mutexattr_gettype" returns="_188" throw="" context="_1" location="f3:819" file="f3" line="819" extern="1" attributes="__nonnull__(,)">
    <Argument name="__attr" type="_1958r" location="f3:819" file="f3" line="819"/>
    <Argument name="__kind" type="_1942r" location="f3:819" file="f3" line="819"/>
  </Function>
  <Function id="_1891" name="xcb_get_atom_name_reply" returns="_5116" context="_1" location="f0:7645" file="f0" line="7645" extern="1">
    <Argument name="c" type="_1947" location="f0:7645" file="f0" line="7645"/>
    <Argument name="cookie" type="_1624" location="f0:7645" file="f0" line="7645"/>
    <Argument name="e" type="_2134" location="f0:7645" file="f0" line="7645"/>
  </Function>
  <Typedef id="_1892" name="__int32_t" type="_188" context="_1" location="f14:40" file="f14" line="40"/>
  <Struct id="_1893" name="xcb_font_iterator_t" context="_1" mangled="19xcb_font_iterator_t" demangled="xcb_font_iterator_t" location="f0:76" file="f0" line="76" artificial="1" size="96" align="32" members="_5117 _5118 _5119 _5120 _5121 _5122 _5123 " bases=""/>
  <Typedef id="_1894" name="xcb_font_iterator_t" type="_1893" context="_1" location="f0:80" file="f0" line="80"/>
  <Struct id="_1895" name="xcb_extension_t" context="_1" incomplete="1" mangled="15xcb_extension_t" demangled="xcb_extension_t" location="f15:348" file="f15" line="348" artificial="1" align="8"/>
  <Typedef id="_1896" name="xcb_extension_t" type="_1895" context="_1" location="f15:348" file="f15" line="348"/>
  <Function id="_1897" name="xcb_poly_line_checked" returns="_1013" context="_1" location="f0:12285" file="f0" line="12285" extern="1">
    <Argument name="c" type="_1947" location="f0:12285" file="f0" line="12285"/>
    <Argument name="coordinate_mode" type="_1473" location="f0:12285" file="f0" line="12285"/>
    <Argument name="drawable" type="_882" location="f0:12285" file="f0" line="12285"/>
    <Argument name="gc" type="_1801" location="f0:12285" file="f0" line="12285"/>
    <Argument name="points_len" type="_705" location="f0:12285" file="f0" line="12285"/>
    <Argument name="points" type="_2220" location="f0:12285" file="f0" line="12285"/>
  </Function>
  <Function id="_1898" name="xcb_free_colors_checked" returns="_1013" context="_1" location="f0:14371" file="f0" line="14371" extern="1">
    <Argument name="c" type="_1947" location="f0:14371" file="f0" line="14371"/>
    <Argument name="cmap" type="_724" location="f0:14371" file="f0" line="14371"/>
    <Argument name="plane_mask" type="_705" location="f0:14371" file="f0" line="14371"/>
    <Argument name="pixels_len" type="_705" location="f0:14371" file="f0" line="14371"/>
    <Argument name="pixels" type="_1956" location="f0:14371" file="f0" line="14371"/>
  </Function>
  <Function id="_1899" name="xcb_get_selection_owner_reply" returns="_5124" context="_1" location="f0:8281" file="f0" line="8281" extern="1">
    <Argument name="c" type="_1947" location="f0:8281" file="f0" line="8281"/>
    <Argument name="cookie" type="_1166" location="f0:8281" file="f0" line="8281"/>
    <Argument name="e" type="_2134" location="f0:8281" file="f0" line="8281"/>
  </Function>
  <Function id="_1900" name="xcb_grab_pointer_unchecked" returns="_742" context="_1" location="f0:8592" file="f0" line="8592" extern="1">
    <Argument name="c" type="_1947" location="f0:8592" file="f0" line="8592"/>
    <Argument name="owner_events" type="_1473" location="f0:8592" file="f0" line="8592"/>
    <Argument name="grab_window" type="_684" location="f0:8592" file="f0" line="8592"/>
    <Argument name="event_mask" type="_1398" location="f0:8592" file="f0" line="8592"/>
    <Argument name="pointer_mode" type="_1473" location="f0:8592" file="f0" line="8592"/>
    <Argument name="keyboard_mode" type="_1473" location="f0:8592" file="f0" line="8592"/>
    <Argument name="confine_to" type="_684" location="f0:8592" file="f0" line="8592"/>
    <Argument name="cursor" type="_1527" location="f0:8592" file="f0" line="8592"/>
    <Argument name="time" type="_1254" location="f0:8592" file="f0" line="8592"/>
  </Function>
  <Typedef id="_1901" name="__caddr_t" type="_1590" context="_1" location="f14:192" file="f14" line="192"/>
  <Field id="_1902" name="data" type="_5125" offset="0" context="_3" access="public" location="f0:3863" file="f0" line="3863"/>
  <Field id="_1903" name="rem" type="_188" offset="32" context="_3" access="public" location="f0:3864" file="f0" line="3864"/>
  <Field id="_1904" name="index" type="_188" offset="64" context="_3" access="public" location="f0:3865" file="f0" line="3865"/>
  <Destructor id="_1905" name="xcb_coloritem_iterator_t" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_tD1Ev *INTERNAL* " demangled="xcb_coloritem_iterator_t::~xcb_coloritem_iterator_t()" location="f0:3862" file="f0" line="3862" endline="3862" inline="1">
  </Destructor>
  <OperatorMethod id="_1906" name="=" returns="_5126" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_taSERKS_" demangled="xcb_coloritem_iterator_t::operator=(xcb_coloritem_iterator_t const&amp;)" location="f0:3862" file="f0" line="3862" endline="3862" inline="1">
    <Argument type="_5127" location="f0:3862" file="f0" line="3862"/>
  </OperatorMethod>
  <Constructor id="_1907" name="xcb_coloritem_iterator_t" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_coloritem_iterator_t::xcb_coloritem_iterator_t(xcb_coloritem_iterator_t const&amp;)" location="f0:3862" file="f0" line="3862" endline="3862" inline="1">
    <Argument type="_5127" location="f0:3862" file="f0" line="3862"/>
  </Constructor>
  <Constructor id="_1908" name="xcb_coloritem_iterator_t" artificial="1" throw="" context="_3" access="public" mangled="_ZN24xcb_coloritem_iterator_tC1Ev *INTERNAL* " demangled="xcb_coloritem_iterator_t::xcb_coloritem_iterator_t()" location="f0:3862" file="f0" line="3862" inline="1"/>
  <Field id="_1909" name="it_interval" type="_775" offset="0" context="_5" access="public" location="f1:163" file="f1" line="163"/>
  <Field id="_1910" name="it_value" type="_775" offset="64" context="_5" access="public" location="f1:164" file="f1" line="164"/>
  <Destructor id="_1911" name="itimerspec" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecD1Ev *INTERNAL* " demangled="itimerspec::~itimerspec()" location="f1:162" file="f1" line="162" endline="162" inline="1">
  </Destructor>
  <OperatorMethod id="_1912" name="=" returns="_5128" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecaSERKS_" demangled="itimerspec::operator=(itimerspec const&amp;)" location="f1:162" file="f1" line="162" endline="162" inline="1">
    <Argument type="_5129" location="f1:162" file="f1" line="162"/>
  </OperatorMethod>
  <Constructor id="_1913" name="itimerspec" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecC1ERKS_ *INTERNAL* " demangled="itimerspec::itimerspec(itimerspec const&amp;)" location="f1:162" file="f1" line="162" endline="162" inline="1">
    <Argument type="_5129" location="f1:162" file="f1" line="162"/>
  </Constructor>
  <Constructor id="_1914" name="itimerspec" artificial="1" throw="" context="_5" access="public" mangled="_ZN10itimerspecC1Ev *INTERNAL* " demangled="itimerspec::itimerspec()" location="f1:162" file="f1" line="162" inline="1"/>
  <Field id="_1915" name="response_type" type="_1473" offset="0" context="_8" access="public" location="f0:1748" file="f0" line="1748"/>
  <Field id="_1916" name="pad0" type="_1473" offset="8" context="_8" access="public" location="f0:1749" file="f0" line="1749"/>
  <Field id="_1917" name="sequence" type="_1398" offset="16" context="_8" access="public" location="f0:1750" file="f0" line="1750"/>
  <Field id="_1918" name="length" type="_705" offset="32" context="_8" access="public" location="f0:1751" file="f0" line="1751"/>
  <Field id="_1919" name="root" type="_684" offset="64" context="_8" access="public" location="f0:1752" file="f0" line="1752"/>
  <Field id="_1920" name="parent" type="_684" offset="96" context="_8" access="public" location="f0:1753" file="f0" line="1753"/>
  <Field id="_1921" name="children_len" type="_1398" offset="128" context="_8" access="public" location="f0:1754" file="f0" line="1754"/>
  <Field id="_1922" name="pad1" type="_5130" offset="144" context="_8" access="public" location="f0:1755" file="f0" line="1755"/>
  <Destructor id="_1923" name="xcb_query_tree_reply_t" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_tD1Ev *INTERNAL* " demangled="xcb_query_tree_reply_t::~xcb_query_tree_reply_t()" location="f0:1747" file="f0" line="1747" endline="1747" inline="1">
  </Destructor>
  <OperatorMethod id="_1924" name="=" returns="_5131" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_taSERKS_" demangled="xcb_query_tree_reply_t::operator=(xcb_query_tree_reply_t const&amp;)" location="f0:1747" file="f0" line="1747" endline="1747" inline="1">
    <Argument type="_5132" location="f0:1747" file="f0" line="1747"/>
  </OperatorMethod>
  <Constructor id="_1925" name="xcb_query_tree_reply_t" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_tree_reply_t::xcb_query_tree_reply_t(xcb_query_tree_reply_t const&amp;)" location="f0:1747" file="f0" line="1747" endline="1747" inline="1">
    <Argument type="_5132" location="f0:1747" file="f0" line="1747"/>
  </Constructor>
  <Constructor id="_1926" name="xcb_query_tree_reply_t" artificial="1" throw="" context="_8" access="public" mangled="_ZN22xcb_query_tree_reply_tC1Ev *INTERNAL* " demangled="xcb_query_tree_reply_t::xcb_query_tree_reply_t()" location="f0:1747" file="f0" line="1747" inline="1"/>
  <FundamentalType id="_1927" name="double" size="64" align="64"/>
  <PointerType id="_1928" type="_4718c" size="32" align="32"/>
  <Field id="_1929" name="major_opcode" type="_1473" offset="0" context="_11" access="public" location="f0:3482" file="f0" line="3482"/>
  <Field id="_1930" name="format" type="_1473" offset="8" context="_11" access="public" location="f0:3483" file="f0" line="3483"/>
  <Field id="_1931" name="length" type="_1398" offset="16" context="_11" access="public" location="f0:3484" file="f0" line="3484"/>
  <Field id="_1932" name="drawable" type="_882" offset="32" context="_11" access="public" location="f0:3485" file="f0" line="3485"/>
  <Field id="_1933" name="x" type="_887" offset="64" context="_11" access="public" location="f0:3486" file="f0" line="3486"/>
  <Field id="_1934" name="y" type="_887" offset="80" context="_11" access="public" location="f0:3487" file="f0" line="3487"/>
  <Field id="_1935" name="width" type="_1398" offset="96" context="_11" access="public" location="f0:3488" file="f0" line="3488"/>
  <Field id="_1936" name="height" type="_1398" offset="112" context="_11" access="public" location="f0:3489" file="f0" line="3489"/>
  <Field id="_1937" name="plane_mask" type="_705" offset="128" context="_11" access="public" location="f0:3490" file="f0" line="3490"/>
  <Destructor id="_1938" name="xcb_get_image_request_t" artificial="1" throw="" context="_11" access="public" mangled="_ZN23xcb_get_image_request_tD1Ev *INTERNAL* " demangled="xcb_get_image_request_t::~xcb_get_image_request_t()" location="f0:3481" file="f0" line="3481" endline="3481" inline="1">
  </Destructor>
  <OperatorMethod id="_1939" name="=" returns="_5134" artificial="1" throw="" context="_11" access="public" mangled="_ZN23xcb_get_image_request_taSERKS_" demangled="xcb_get_image_request_t::operator=(xcb_get_image_request_t const&amp;)" location="f0:3481" file="f0" line="3481" endline="3481" inline="1">
    <Argument type="_5135" location="f0:3481" file="f0" line="3481"/>
  </OperatorMethod>
  <Constructor id="_1940" name="xcb_get_image_request_t" artificial="1" throw="" context="_11" access="public" mangled="_ZN23xcb_get_image_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_image_request_t::xcb_get_image_request_t(xcb_get_image_request_t const&amp;)" location="f0:3481" file="f0" line="3481" endline="3481" inline="1">
    <Argument type="_5135" location="f0:3481" file="f0" line="3481"/>
  </Constructor>
  <Constructor id="_1941" name="xcb_get_image_request_t" artificial="1" throw="" context="_11" access="public" mangled="_ZN23xcb_get_image_request_tC1Ev *INTERNAL* " demangled="xcb_get_image_request_t::xcb_get_image_request_t()" location="f0:3481" file="f0" line="3481" inline="1"/>
  <PointerType id="_1942" type="_188" size="32" align="32"/>
  <CvQualifiedType id="_1942r" type="_1942" restrict="1"/>
  <PointerType id="_1944" type="_651" size="32" align="32"/>
  <CvQualifiedType id="_1944r" type="_1944" restrict="1"/>
  <FundamentalType id="_1946" name="float" size="32" align="32"/>
  <PointerType id="_1947" type="_1484" size="32" align="32"/>
  <FundamentalType id="_1948" name="long double" size="96" align="32"/>
  <PointerType id="_1949" type="_2016c" size="32" align="32"/>
  <Field id="_1950" name="tv_sec" type="_1057" offset="0" context="_18" access="public" location="f4:32" file="f4" line="32"/>
  <Field id="_1951" name="tv_usec" type="_205" offset="32" context="_18" access="public" location="f4:33" file="f4" line="33"/>
  <Destructor id="_1952" name="timeval" artificial="1" throw="" context="_18" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f4:31" file="f4" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1953" name="=" returns="_5137" artificial="1" throw="" context="_18" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f4:31" file="f4" line="31" endline="31" inline="1">
    <Argument type="_5138" location="f4:31" file="f4" line="31"/>
  </OperatorMethod>
  <Constructor id="_1954" name="timeval" artificial="1" throw="" context="_18" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f4:31" file="f4" line="31" endline="31" inline="1">
    <Argument type="_5138" location="f4:31" file="f4" line="31"/>
  </Constructor>
  <Constructor id="_1955" name="timeval" artificial="1" throw="" context="_18" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f4:31" file="f4" line="31" inline="1"/>
  <PointerType id="_1956" type="_705c" size="32" align="32"/>
  <PointerType id="_1957" type="_619" size="32" align="32"/>
  <PointerType id="_1958" type="_349c" size="32" align="32"/>
  <CvQualifiedType id="_1958r" type="_1958" restrict="1"/>
  <Field id="_1960" name="tm_sec" type="_188" offset="0" context="_27" access="public" location="f1:135" file="f1" line="135"/>
  <Field id="_1961" name="tm_min" type="_188" offset="32" context="_27" access="public" location="f1:136" file="f1" line="136"/>
  <Field id="_1962" name="tm_hour" type="_188" offset="64" context="_27" access="public" location="f1:137" file="f1" line="137"/>
  <Field id="_1963" name="tm_mday" type="_188" offset="96" context="_27" access="public" location="f1:138" file="f1" line="138"/>
  <Field id="_1964" name="tm_mon" type="_188" offset="128" context="_27" access="public" location="f1:139" file="f1" line="139"/>
  <Field id="_1965" name="tm_year" type="_188" offset="160" context="_27" access="public" location="f1:140" file="f1" line="140"/>
  <Field id="_1966" name="tm_wday" type="_188" offset="192" context="_27" access="public" location="f1:141" file="f1" line="141"/>
  <Field id="_1967" name="tm_yday" type="_188" offset="224" context="_27" access="public" location="f1:142" file="f1" line="142"/>
  <Field id="_1968" name="tm_isdst" type="_188" offset="256" context="_27" access="public" location="f1:143" file="f1" line="143"/>
  <Field id="_1969" name="tm_gmtoff" type="_31" offset="288" context="_27" access="public" location="f1:146" file="f1" line="146"/>
  <Field id="_1970" name="tm_zone" type="_1928" offset="320" context="_27" access="public" location="f1:147" file="f1" line="147"/>
  <Destructor id="_1971" name="tm" artificial="1" throw="" context="_27" access="public" mangled="_ZN2tmD1Ev *INTERNAL* " demangled="tm::~tm()" location="f1:134" file="f1" line="134" endline="134" inline="1">
  </Destructor>
  <OperatorMethod id="_1972" name="=" returns="_5141" artificial="1" throw="" context="_27" access="public" mangled="_ZN2tmaSERKS_" demangled="tm::operator=(tm const&amp;)" location="f1:134" file="f1" line="134" endline="134" inline="1">
    <Argument type="_5142" location="f1:134" file="f1" line="134"/>
  </OperatorMethod>
  <Constructor id="_1973" name="tm" artificial="1" throw="" context="_27" access="public" mangled="_ZN2tmC1ERKS_ *INTERNAL* " demangled="tm::tm(tm const&amp;)" location="f1:134" file="f1" line="134" endline="134" inline="1">
    <Argument type="_5142" location="f1:134" file="f1" line="134"/>
  </Constructor>
  <Constructor id="_1974" name="tm" artificial="1" throw="" context="_27" access="public" mangled="_ZN2tmC1Ev *INTERNAL* " demangled="tm::tm()" location="f1:134" file="f1" line="134" inline="1"/>
  <FundamentalType id="_1975" name="bool" size="8" align="8"/>
  <Field id="_1976" name="response_type" type="_1473" offset="0" context="_29" access="public" location="f0:1210" file="f0" line="1210"/>
  <Field id="_1977" name="error_code" type="_1473" offset="8" context="_29" access="public" location="f0:1211" file="f0" line="1211"/>
  <Field id="_1978" name="sequence" type="_1398" offset="16" context="_29" access="public" location="f0:1212" file="f0" line="1212"/>
  <Field id="_1979" name="bad_value" type="_705" offset="32" context="_29" access="public" location="f0:1213" file="f0" line="1213"/>
  <Field id="_1980" name="minor_opcode" type="_1398" offset="64" context="_29" access="public" location="f0:1214" file="f0" line="1214"/>
  <Field id="_1981" name="major_opcode" type="_1473" offset="80" context="_29" access="public" location="f0:1215" file="f0" line="1215"/>
  <Field id="_1982" name="pad0" type="_1473" offset="88" context="_29" access="public" location="f0:1216" file="f0" line="1216"/>
  <Destructor id="_1983" name="xcb_request_error_t" artificial="1" throw="" context="_29" access="public" mangled="_ZN19xcb_request_error_tD1Ev *INTERNAL* " demangled="xcb_request_error_t::~xcb_request_error_t()" location="f0:1209" file="f0" line="1209" endline="1209" inline="1">
  </Destructor>
  <OperatorMethod id="_1984" name="=" returns="_5143" artificial="1" throw="" context="_29" access="public" mangled="_ZN19xcb_request_error_taSERKS_" demangled="xcb_request_error_t::operator=(xcb_request_error_t const&amp;)" location="f0:1209" file="f0" line="1209" endline="1209" inline="1">
    <Argument type="_5144" location="f0:1209" file="f0" line="1209"/>
  </OperatorMethod>
  <Constructor id="_1985" name="xcb_request_error_t" artificial="1" throw="" context="_29" access="public" mangled="_ZN19xcb_request_error_tC1ERKS_ *INTERNAL* " demangled="xcb_request_error_t::xcb_request_error_t(xcb_request_error_t const&amp;)" location="f0:1209" file="f0" line="1209" endline="1209" inline="1">
    <Argument type="_5144" location="f0:1209" file="f0" line="1209"/>
  </Constructor>
  <Constructor id="_1986" name="xcb_request_error_t" artificial="1" throw="" context="_29" access="public" mangled="_ZN19xcb_request_error_tC1Ev *INTERNAL* " demangled="xcb_request_error_t::xcb_request_error_t()" location="f0:1209" file="f0" line="1209" inline="1"/>
  <Field id="_1987" name="major_opcode" type="_1473" offset="0" context="_35" access="public" location="f0:1888" file="f0" line="1888"/>
  <Field id="_1988" name="_delete" type="_1473" offset="8" context="_35" access="public" location="f0:1889" file="f0" line="1889"/>
  <Field id="_1989" name="length" type="_1398" offset="16" context="_35" access="public" location="f0:1890" file="f0" line="1890"/>
  <Field id="_1990" name="window" type="_684" offset="32" context="_35" access="public" location="f0:1891" file="f0" line="1891"/>
  <Field id="_1991" name="property" type="_1688" offset="64" context="_35" access="public" location="f0:1892" file="f0" line="1892"/>
  <Field id="_1992" name="type" type="_1688" offset="96" context="_35" access="public" location="f0:1893" file="f0" line="1893"/>
  <Field id="_1993" name="long_offset" type="_705" offset="128" context="_35" access="public" location="f0:1894" file="f0" line="1894"/>
  <Field id="_1994" name="long_length" type="_705" offset="160" context="_35" access="public" location="f0:1895" file="f0" line="1895"/>
  <Destructor id="_1995" name="xcb_get_property_request_t" artificial="1" throw="" context="_35" access="public" mangled="_ZN26xcb_get_property_request_tD1Ev *INTERNAL* " demangled="xcb_get_property_request_t::~xcb_get_property_request_t()" location="f0:1887" file="f0" line="1887" endline="1887" inline="1">
  </Destructor>
  <OperatorMethod id="_1996" name="=" returns="_5145" artificial="1" throw="" context="_35" access="public" mangled="_ZN26xcb_get_property_request_taSERKS_" demangled="xcb_get_property_request_t::operator=(xcb_get_property_request_t const&amp;)" location="f0:1887" file="f0" line="1887" endline="1887" inline="1">
    <Argument type="_5146" location="f0:1887" file="f0" line="1887"/>
  </OperatorMethod>
  <Constructor id="_1997" name="xcb_get_property_request_t" artificial="1" throw="" context="_35" access="public" mangled="_ZN26xcb_get_property_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_property_request_t::xcb_get_property_request_t(xcb_get_property_request_t const&amp;)" location="f0:1887" file="f0" line="1887" endline="1887" inline="1">
    <Argument type="_5146" location="f0:1887" file="f0" line="1887"/>
  </Constructor>
  <Constructor id="_1998" name="xcb_get_property_request_t" artificial="1" throw="" context="_35" access="public" mangled="_ZN26xcb_get_property_request_tC1Ev *INTERNAL* " demangled="xcb_get_property_request_t::xcb_get_property_request_t()" location="f0:1887" file="f0" line="1887" inline="1"/>
  <Field id="_1999" name="data" type="_5147" offset="0" context="_39" access="public" location="f0:3343" file="f0" line="3343"/>
  <Field id="_2000" name="rem" type="_188" offset="32" context="_39" access="public" location="f0:3344" file="f0" line="3344"/>
  <Field id="_2001" name="index" type="_188" offset="64" context="_39" access="public" location="f0:3345" file="f0" line="3345"/>
  <Destructor id="_2002" name="xcb_segment_iterator_t" artificial="1" throw="" context="_39" access="public" mangled="_ZN22xcb_segment_iterator_tD1Ev *INTERNAL* " demangled="xcb_segment_iterator_t::~xcb_segment_iterator_t()" location="f0:3342" file="f0" line="3342" endline="3342" inline="1">
  </Destructor>
  <OperatorMethod id="_2003" name="=" returns="_5148" artificial="1" throw="" context="_39" access="public" mangled="_ZN22xcb_segment_iterator_taSERKS_" demangled="xcb_segment_iterator_t::operator=(xcb_segment_iterator_t const&amp;)" location="f0:3342" file="f0" line="3342" endline="3342" inline="1">
    <Argument type="_5149" location="f0:3342" file="f0" line="3342"/>
  </OperatorMethod>
  <Constructor id="_2004" name="xcb_segment_iterator_t" artificial="1" throw="" context="_39" access="public" mangled="_ZN22xcb_segment_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_segment_iterator_t::xcb_segment_iterator_t(xcb_segment_iterator_t const&amp;)" location="f0:3342" file="f0" line="3342" endline="3342" inline="1">
    <Argument type="_5149" location="f0:3342" file="f0" line="3342"/>
  </Constructor>
  <Constructor id="_2005" name="xcb_segment_iterator_t" artificial="1" throw="" context="_39" access="public" mangled="_ZN22xcb_segment_iterator_tC1Ev *INTERNAL* " demangled="xcb_segment_iterator_t::xcb_segment_iterator_t()" location="f0:3342" file="f0" line="3342" inline="1"/>
  <PointerType id="_2006" type="_368" size="32" align="32"/>
  <FundamentalType id="_2007" name="complex float" size="64" align="32"/>
  <FundamentalType id="_2008" name="complex long double" size="192" align="32"/>
  <Field id="_2009" name="data" type="_5150" offset="0" context="_51" access="public" location="f0:204" file="f0" line="204"/>
  <Field id="_2010" name="rem" type="_188" offset="32" context="_51" access="public" location="f0:205" file="f0" line="205"/>
  <Field id="_2011" name="index" type="_188" offset="64" context="_51" access="public" location="f0:206" file="f0" line="206"/>
  <Destructor id="_2012" name="xcb_point_iterator_t" artificial="1" throw="" context="_51" access="public" mangled="_ZN20xcb_point_iterator_tD1Ev *INTERNAL* " demangled="xcb_point_iterator_t::~xcb_point_iterator_t()" location="f0:203" file="f0" line="203" endline="203" inline="1">
  </Destructor>
  <OperatorMethod id="_2013" name="=" returns="_5151" artificial="1" throw="" context="_51" access="public" mangled="_ZN20xcb_point_iterator_taSERKS_" demangled="xcb_point_iterator_t::operator=(xcb_point_iterator_t const&amp;)" location="f0:203" file="f0" line="203" endline="203" inline="1">
    <Argument type="_5152" location="f0:203" file="f0" line="203"/>
  </OperatorMethod>
  <Constructor id="_2014" name="xcb_point_iterator_t" artificial="1" throw="" context="_51" access="public" mangled="_ZN20xcb_point_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_point_iterator_t::xcb_point_iterator_t(xcb_point_iterator_t const&amp;)" location="f0:203" file="f0" line="203" endline="203" inline="1">
    <Argument type="_5152" location="f0:203" file="f0" line="203"/>
  </Constructor>
  <Constructor id="_2015" name="xcb_point_iterator_t" artificial="1" throw="" context="_51" access="public" mangled="_ZN20xcb_point_iterator_tC1Ev *INTERNAL* " demangled="xcb_point_iterator_t::xcb_point_iterator_t()" location="f0:203" file="f0" line="203" inline="1"/>
  <FundamentalType id="_2016" name="void" align="8"/>
  <Field id="_2017" name="major_opcode" type="_1473" offset="0" context="_55" access="public" location="f0:3801" file="f0" line="3801"/>
  <Field id="_2018" name="contiguous" type="_1473" offset="8" context="_55" access="public" location="f0:3802" file="f0" line="3802"/>
  <Field id="_2019" name="length" type="_1398" offset="16" context="_55" access="public" location="f0:3803" file="f0" line="3803"/>
  <Field id="_2020" name="cmap" type="_724" offset="32" context="_55" access="public" location="f0:3804" file="f0" line="3804"/>
  <Field id="_2021" name="colors" type="_1398" offset="64" context="_55" access="public" location="f0:3805" file="f0" line="3805"/>
  <Field id="_2022" name="reds" type="_1398" offset="80" context="_55" access="public" location="f0:3806" file="f0" line="3806"/>
  <Field id="_2023" name="greens" type="_1398" offset="96" context="_55" access="public" location="f0:3807" file="f0" line="3807"/>
  <Field id="_2024" name="blues" type="_1398" offset="112" context="_55" access="public" location="f0:3808" file="f0" line="3808"/>
  <Destructor id="_2025" name="xcb_alloc_color_planes_request_t" artificial="1" throw="" context="_55" access="public" mangled="_ZN32xcb_alloc_color_planes_request_tD1Ev *INTERNAL* " demangled="xcb_alloc_color_planes_request_t::~xcb_alloc_color_planes_request_t()" location="f0:3800" file="f0" line="3800" endline="3800" inline="1">
  </Destructor>
  <OperatorMethod id="_2026" name="=" returns="_5153" artificial="1" throw="" context="_55" access="public" mangled="_ZN32xcb_alloc_color_planes_request_taSERKS_" demangled="xcb_alloc_color_planes_request_t::operator=(xcb_alloc_color_planes_request_t const&amp;)" location="f0:3800" file="f0" line="3800" endline="3800" inline="1">
    <Argument type="_5154" location="f0:3800" file="f0" line="3800"/>
  </OperatorMethod>
  <Constructor id="_2027" name="xcb_alloc_color_planes_request_t" artificial="1" throw="" context="_55" access="public" mangled="_ZN32xcb_alloc_color_planes_request_tC1ERKS_ *INTERNAL* " demangled="xcb_alloc_color_planes_request_t::xcb_alloc_color_planes_request_t(xcb_alloc_color_planes_request_t const&amp;)" location="f0:3800" file="f0" line="3800" endline="3800" inline="1">
    <Argument type="_5154" location="f0:3800" file="f0" line="3800"/>
  </Constructor>
  <Constructor id="_2028" name="xcb_alloc_color_planes_request_t" artificial="1" throw="" context="_55" access="public" mangled="_ZN32xcb_alloc_color_planes_request_tC1Ev *INTERNAL* " demangled="xcb_alloc_color_planes_request_t::xcb_alloc_color_planes_request_t()" location="f0:3800" file="f0" line="3800" inline="1"/>
  <Field id="_2029" name="__size" type="_5155" offset="0" context="_60" access="public" location="f9:148" file="f9" line="148"/>
  <Field id="_2030" name="__align" type="_188" offset="0" context="_60" access="public" location="f9:149" file="f9" line="149"/>
  <Destructor id="_2031" name="._8" artificial="1" throw="" context="_60" access="public" mangled="_ZN18pthread_condattr_tD1Ev *INTERNAL* " demangled="pthread_condattr_t::~pthread_condattr_t()" location="f9:150" file="f9" line="150" endline="150" inline="1">
  </Destructor>
  <OperatorMethod id="_2032" name="=" returns="_5156" artificial="1" throw="" context="_60" access="public" mangled="_ZN18pthread_condattr_taSERKS_" demangled="pthread_condattr_t::operator=(pthread_condattr_t const&amp;)" location="f9:150" file="f9" line="150" endline="150" inline="1">
    <Argument type="_5157" location="f9:147" file="f9" line="147"/>
  </OperatorMethod>
  <Constructor id="_2033" name="._8" artificial="1" throw="" context="_60" access="public" mangled="_ZN18pthread_condattr_tC1ERKS_ *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t(pthread_condattr_t const&amp;)" location="f9:150" file="f9" line="150" endline="150" inline="1">
    <Argument type="_5157" location="f9:147" file="f9" line="147"/>
  </Constructor>
  <Constructor id="_2034" name="._8" artificial="1" throw="" context="_60" access="public" mangled="_ZN18pthread_condattr_tC1Ev *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t()" location="f9:150" file="f9" line="150" inline="1"/>
  <PointerType id="_2035" type="_711c" size="32" align="32"/>
  <Field id="_2036" name="major_opcode" type="_1473" offset="0" context="_62" access="public" location="f0:3544" file="f0" line="3544"/>
  <Field id="_2037" name="string_len" type="_1473" offset="8" context="_62" access="public" location="f0:3545" file="f0" line="3545"/>
  <Field id="_2038" name="length" type="_1398" offset="16" context="_62" access="public" location="f0:3546" file="f0" line="3546"/>
  <Field id="_2039" name="drawable" type="_882" offset="32" context="_62" access="public" location="f0:3547" file="f0" line="3547"/>
  <Field id="_2040" name="gc" type="_1801" offset="64" context="_62" access="public" location="f0:3548" file="f0" line="3548"/>
  <Field id="_2041" name="x" type="_887" offset="96" context="_62" access="public" location="f0:3549" file="f0" line="3549"/>
  <Field id="_2042" name="y" type="_887" offset="112" context="_62" access="public" location="f0:3550" file="f0" line="3550"/>
  <Destructor id="_2043" name="xcb_image_text_8_request_t" artificial="1" throw="" context="_62" access="public" mangled="_ZN26xcb_image_text_8_request_tD1Ev *INTERNAL* " demangled="xcb_image_text_8_request_t::~xcb_image_text_8_request_t()" location="f0:3543" file="f0" line="3543" endline="3543" inline="1">
  </Destructor>
  <OperatorMethod id="_2044" name="=" returns="_5159" artificial="1" throw="" context="_62" access="public" mangled="_ZN26xcb_image_text_8_request_taSERKS_" demangled="xcb_image_text_8_request_t::operator=(xcb_image_text_8_request_t const&amp;)" location="f0:3543" file="f0" line="3543" endline="3543" inline="1">
    <Argument type="_5160" location="f0:3543" file="f0" line="3543"/>
  </OperatorMethod>
  <Constructor id="_2045" name="xcb_image_text_8_request_t" artificial="1" throw="" context="_62" access="public" mangled="_ZN26xcb_image_text_8_request_tC1ERKS_ *INTERNAL* " demangled="xcb_image_text_8_request_t::xcb_image_text_8_request_t(xcb_image_text_8_request_t const&amp;)" location="f0:3543" file="f0" line="3543" endline="3543" inline="1">
    <Argument type="_5160" location="f0:3543" file="f0" line="3543"/>
  </Constructor>
  <Constructor id="_2046" name="xcb_image_text_8_request_t" artificial="1" throw="" context="_62" access="public" mangled="_ZN26xcb_image_text_8_request_tC1Ev *INTERNAL* " demangled="xcb_image_text_8_request_t::xcb_image_text_8_request_t()" location="f0:3543" file="f0" line="3543" inline="1"/>
  <PointerType id="_2047" type="_1473" size="32" align="32"/>
  <PointerType id="_2048" type="_1880c" size="32" align="32"/>
  <Field id="_2049" name="sequence" type="_100" offset="0" context="_65" access="public" location="f0:2682" file="f0" line="2682"/>
  <Destructor id="_2050" name="xcb_query_font_cookie_t" artificial="1" throw="" context="_65" access="public" mangled="_ZN23xcb_query_font_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_font_cookie_t::~xcb_query_font_cookie_t()" location="f0:2681" file="f0" line="2681" endline="2681" inline="1">
  </Destructor>
  <OperatorMethod id="_2051" name="=" returns="_5162" artificial="1" throw="" context="_65" access="public" mangled="_ZN23xcb_query_font_cookie_taSERKS_" demangled="xcb_query_font_cookie_t::operator=(xcb_query_font_cookie_t const&amp;)" location="f0:2681" file="f0" line="2681" endline="2681" inline="1">
    <Argument type="_5163" location="f0:2681" file="f0" line="2681"/>
  </OperatorMethod>
  <Constructor id="_2052" name="xcb_query_font_cookie_t" artificial="1" throw="" context="_65" access="public" mangled="_ZN23xcb_query_font_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_font_cookie_t::xcb_query_font_cookie_t(xcb_query_font_cookie_t const&amp;)" location="f0:2681" file="f0" line="2681" endline="2681" inline="1">
    <Argument type="_5163" location="f0:2681" file="f0" line="2681"/>
  </Constructor>
  <Constructor id="_2053" name="xcb_query_font_cookie_t" artificial="1" throw="" context="_65" access="public" mangled="_ZN23xcb_query_font_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_font_cookie_t::xcb_query_font_cookie_t()" location="f0:2681" file="f0" line="2681" inline="1"/>
  <PointerType id="_2054" type="_911c" size="32" align="32"/>
  <Field id="_2055" name="major_opcode" type="_1473" offset="0" context="_70" access="public" location="f0:3962" file="f0" line="3962"/>
  <Field id="_2056" name="pad0" type="_1473" offset="8" context="_70" access="public" location="f0:3963" file="f0" line="3963"/>
  <Field id="_2057" name="length" type="_1398" offset="16" context="_70" access="public" location="f0:3964" file="f0" line="3964"/>
  <Field id="_2058" name="cmap" type="_724" offset="32" context="_70" access="public" location="f0:3965" file="f0" line="3965"/>
  <Field id="_2059" name="name_len" type="_1398" offset="64" context="_70" access="public" location="f0:3966" file="f0" line="3966"/>
  <Field id="_2060" name="pad1" type="_5165" offset="80" context="_70" access="public" location="f0:3967" file="f0" line="3967"/>
  <Destructor id="_2061" name="xcb_lookup_color_request_t" artificial="1" throw="" context="_70" access="public" mangled="_ZN26xcb_lookup_color_request_tD1Ev *INTERNAL* " demangled="xcb_lookup_color_request_t::~xcb_lookup_color_request_t()" location="f0:3961" file="f0" line="3961" endline="3961" inline="1">
  </Destructor>
  <OperatorMethod id="_2062" name="=" returns="_5166" artificial="1" throw="" context="_70" access="public" mangled="_ZN26xcb_lookup_color_request_taSERKS_" demangled="xcb_lookup_color_request_t::operator=(xcb_lookup_color_request_t const&amp;)" location="f0:3961" file="f0" line="3961" endline="3961" inline="1">
    <Argument type="_5167" location="f0:3961" file="f0" line="3961"/>
  </OperatorMethod>
  <Constructor id="_2063" name="xcb_lookup_color_request_t" artificial="1" throw="" context="_70" access="public" mangled="_ZN26xcb_lookup_color_request_tC1ERKS_ *INTERNAL* " demangled="xcb_lookup_color_request_t::xcb_lookup_color_request_t(xcb_lookup_color_request_t const&amp;)" location="f0:3961" file="f0" line="3961" endline="3961" inline="1">
    <Argument type="_5167" location="f0:3961" file="f0" line="3961"/>
  </Constructor>
  <Constructor id="_2064" name="xcb_lookup_color_request_t" artificial="1" throw="" context="_70" access="public" mangled="_ZN26xcb_lookup_color_request_tC1Ev *INTERNAL* " demangled="xcb_lookup_color_request_t::xcb_lookup_color_request_t()" location="f0:3961" file="f0" line="3961" inline="1"/>
  <Field id="_2065" name="major_opcode" type="_1473" offset="0" context="_72" access="public" location="f0:1562" file="f0" line="1562"/>
  <Field id="_2066" name="mode" type="_1473" offset="8" context="_72" access="public" location="f0:1563" file="f0" line="1563"/>
  <Field id="_2067" name="length" type="_1398" offset="16" context="_72" access="public" location="f0:1564" file="f0" line="1564"/>
  <Field id="_2068" name="window" type="_684" offset="32" context="_72" access="public" location="f0:1565" file="f0" line="1565"/>
  <Destructor id="_2069" name="xcb_change_save_set_request_t" artificial="1" throw="" context="_72" access="public" mangled="_ZN29xcb_change_save_set_request_tD1Ev *INTERNAL* " demangled="xcb_change_save_set_request_t::~xcb_change_save_set_request_t()" location="f0:1561" file="f0" line="1561" endline="1561" inline="1">
  </Destructor>
  <OperatorMethod id="_2070" name="=" returns="_5168" artificial="1" throw="" context="_72" access="public" mangled="_ZN29xcb_change_save_set_request_taSERKS_" demangled="xcb_change_save_set_request_t::operator=(xcb_change_save_set_request_t const&amp;)" location="f0:1561" file="f0" line="1561" endline="1561" inline="1">
    <Argument type="_5169" location="f0:1561" file="f0" line="1561"/>
  </OperatorMethod>
  <Constructor id="_2071" name="xcb_change_save_set_request_t" artificial="1" throw="" context="_72" access="public" mangled="_ZN29xcb_change_save_set_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_save_set_request_t::xcb_change_save_set_request_t(xcb_change_save_set_request_t const&amp;)" location="f0:1561" file="f0" line="1561" endline="1561" inline="1">
    <Argument type="_5169" location="f0:1561" file="f0" line="1561"/>
  </Constructor>
  <Constructor id="_2072" name="xcb_change_save_set_request_t" artificial="1" throw="" context="_72" access="public" mangled="_ZN29xcb_change_save_set_request_tC1Ev *INTERNAL* " demangled="xcb_change_save_set_request_t::xcb_change_save_set_request_t()" location="f0:1561" file="f0" line="1561" inline="1"/>
  <PointerType id="_2073" type="_1473c" size="32" align="32"/>
  <Field id="_2074" name="response_type" type="_1473" offset="0" context="_77" access="public" location="f0:806" file="f0" line="806"/>
  <Field id="_2075" name="pad0" type="_1473" offset="8" context="_77" access="public" location="f0:807" file="f0" line="807"/>
  <Field id="_2076" name="sequence" type="_1398" offset="16" context="_77" access="public" location="f0:808" file="f0" line="808"/>
  <Field id="_2077" name="event" type="_684" offset="32" context="_77" access="public" location="f0:809" file="f0" line="809"/>
  <Field id="_2078" name="window" type="_684" offset="64" context="_77" access="public" location="f0:810" file="f0" line="810"/>
  <Field id="_2079" name="from_configure" type="_1473" offset="96" context="_77" access="public" location="f0:811" file="f0" line="811"/>
  <Field id="_2080" name="pad1" type="_5171" offset="104" context="_77" access="public" location="f0:812" file="f0" line="812"/>
  <Destructor id="_2081" name="xcb_unmap_notify_event_t" artificial="1" throw="" context="_77" access="public" mangled="_ZN24xcb_unmap_notify_event_tD1Ev *INTERNAL* " demangled="xcb_unmap_notify_event_t::~xcb_unmap_notify_event_t()" location="f0:805" file="f0" line="805" endline="805" inline="1">
  </Destructor>
  <OperatorMethod id="_2082" name="=" returns="_5172" artificial="1" throw="" context="_77" access="public" mangled="_ZN24xcb_unmap_notify_event_taSERKS_" demangled="xcb_unmap_notify_event_t::operator=(xcb_unmap_notify_event_t const&amp;)" location="f0:805" file="f0" line="805" endline="805" inline="1">
    <Argument type="_5173" location="f0:805" file="f0" line="805"/>
  </OperatorMethod>
  <Constructor id="_2083" name="xcb_unmap_notify_event_t" artificial="1" throw="" context="_77" access="public" mangled="_ZN24xcb_unmap_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_unmap_notify_event_t::xcb_unmap_notify_event_t(xcb_unmap_notify_event_t const&amp;)" location="f0:805" file="f0" line="805" endline="805" inline="1">
    <Argument type="_5173" location="f0:805" file="f0" line="805"/>
  </Constructor>
  <Constructor id="_2084" name="xcb_unmap_notify_event_t" artificial="1" throw="" context="_77" access="public" mangled="_ZN24xcb_unmap_notify_event_tC1Ev *INTERNAL* " demangled="xcb_unmap_notify_event_t::xcb_unmap_notify_event_t()" location="f0:805" file="f0" line="805" inline="1"/>
  <PointerType id="_2085" type="_705" size="32" align="32"/>
  <PointerType id="_2086" type="_1019c" size="32" align="32"/>
  <PointerType id="_2087" type="_532" size="32" align="32"/>
  <PointerType id="_2088" type="_1042" size="32" align="32"/>
  <PointerType id="_2089" type="_163" size="32" align="32"/>
  <Field id="_2090" name="response_type" type="_1473" offset="0" context="_89" access="public" location="f0:524" file="f0" line="524"/>
  <Field id="_2091" name="detail" type="_911" offset="8" context="_89" access="public" location="f0:525" file="f0" line="525"/>
  <Field id="_2092" name="sequence" type="_1398" offset="16" context="_89" access="public" location="f0:526" file="f0" line="526"/>
  <Field id="_2093" name="time" type="_1254" offset="32" context="_89" access="public" location="f0:527" file="f0" line="527"/>
  <Field id="_2094" name="root" type="_684" offset="64" context="_89" access="public" location="f0:528" file="f0" line="528"/>
  <Field id="_2095" name="event" type="_684" offset="96" context="_89" access="public" location="f0:529" file="f0" line="529"/>
  <Field id="_2096" name="child" type="_684" offset="128" context="_89" access="public" location="f0:530" file="f0" line="530"/>
  <Field id="_2097" name="root_x" type="_887" offset="160" context="_89" access="public" location="f0:531" file="f0" line="531"/>
  <Field id="_2098" name="root_y" type="_887" offset="176" context="_89" access="public" location="f0:532" file="f0" line="532"/>
  <Field id="_2099" name="event_x" type="_887" offset="192" context="_89" access="public" location="f0:533" file="f0" line="533"/>
  <Field id="_2100" name="event_y" type="_887" offset="208" context="_89" access="public" location="f0:534" file="f0" line="534"/>
  <Field id="_2101" name="state" type="_1398" offset="224" context="_89" access="public" location="f0:535" file="f0" line="535"/>
  <Field id="_2102" name="same_screen" type="_1473" offset="240" context="_89" access="public" location="f0:536" file="f0" line="536"/>
  <Field id="_2103" name="pad0" type="_1473" offset="248" context="_89" access="public" location="f0:537" file="f0" line="537"/>
  <Destructor id="_2104" name="xcb_key_press_event_t" artificial="1" throw="" context="_89" access="public" mangled="_ZN21xcb_key_press_event_tD1Ev *INTERNAL* " demangled="xcb_key_press_event_t::~xcb_key_press_event_t()" location="f0:523" file="f0" line="523" endline="523" inline="1">
  </Destructor>
  <OperatorMethod id="_2105" name="=" returns="_5175" artificial="1" throw="" context="_89" access="public" mangled="_ZN21xcb_key_press_event_taSERKS_" demangled="xcb_key_press_event_t::operator=(xcb_key_press_event_t const&amp;)" location="f0:523" file="f0" line="523" endline="523" inline="1">
    <Argument type="_5176" location="f0:523" file="f0" line="523"/>
  </OperatorMethod>
  <Constructor id="_2106" name="xcb_key_press_event_t" artificial="1" throw="" context="_89" access="public" mangled="_ZN21xcb_key_press_event_tC1ERKS_ *INTERNAL* " demangled="xcb_key_press_event_t::xcb_key_press_event_t(xcb_key_press_event_t const&amp;)" location="f0:523" file="f0" line="523" endline="523" inline="1">
    <Argument type="_5176" location="f0:523" file="f0" line="523"/>
  </Constructor>
  <Constructor id="_2107" name="xcb_key_press_event_t" artificial="1" throw="" context="_89" access="public" mangled="_ZN21xcb_key_press_event_tC1Ev *INTERNAL* " demangled="xcb_key_press_event_t::xcb_key_press_event_t()" location="f0:523" file="f0" line="523" inline="1"/>
  <Field id="_2108" name="response_type" type="_1473" offset="0" context="_91" access="public" location="f0:2200" file="f0" line="2200"/>
  <Field id="_2109" name="status" type="_1473" offset="8" context="_91" access="public" location="f0:2201" file="f0" line="2201"/>
  <Field id="_2110" name="sequence" type="_1398" offset="16" context="_91" access="public" location="f0:2202" file="f0" line="2202"/>
  <Field id="_2111" name="length" type="_705" offset="32" context="_91" access="public" location="f0:2203" file="f0" line="2203"/>
  <Destructor id="_2112" name="xcb_grab_keyboard_reply_t" artificial="1" throw="" context="_91" access="public" mangled="_ZN25xcb_grab_keyboard_reply_tD1Ev *INTERNAL* " demangled="xcb_grab_keyboard_reply_t::~xcb_grab_keyboard_reply_t()" location="f0:2199" file="f0" line="2199" endline="2199" inline="1">
  </Destructor>
  <OperatorMethod id="_2113" name="=" returns="_5177" artificial="1" throw="" context="_91" access="public" mangled="_ZN25xcb_grab_keyboard_reply_taSERKS_" demangled="xcb_grab_keyboard_reply_t::operator=(xcb_grab_keyboard_reply_t const&amp;)" location="f0:2199" file="f0" line="2199" endline="2199" inline="1">
    <Argument type="_5178" location="f0:2199" file="f0" line="2199"/>
  </OperatorMethod>
  <Constructor id="_2114" name="xcb_grab_keyboard_reply_t" artificial="1" throw="" context="_91" access="public" mangled="_ZN25xcb_grab_keyboard_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_grab_keyboard_reply_t::xcb_grab_keyboard_reply_t(xcb_grab_keyboard_reply_t const&amp;)" location="f0:2199" file="f0" line="2199" endline="2199" inline="1">
    <Argument type="_5178" location="f0:2199" file="f0" line="2199"/>
  </Constructor>
  <Constructor id="_2115" name="xcb_grab_keyboard_reply_t" artificial="1" throw="" context="_91" access="public" mangled="_ZN25xcb_grab_keyboard_reply_tC1Ev *INTERNAL* " demangled="xcb_grab_keyboard_reply_t::xcb_grab_keyboard_reply_t()" location="f0:2199" file="f0" line="2199" inline="1"/>
  <PointerType id="_2116" type="_695c" size="32" align="32"/>
  <Field id="_2117" name="sequence" type="_100" offset="0" context="_95" access="public" location="f0:2873" file="f0" line="2873"/>
  <Destructor id="_2118" name="xcb_get_font_path_cookie_t" artificial="1" throw="" context="_95" access="public" mangled="_ZN26xcb_get_font_path_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_font_path_cookie_t::~xcb_get_font_path_cookie_t()" location="f0:2872" file="f0" line="2872" endline="2872" inline="1">
  </Destructor>
  <OperatorMethod id="_2119" name="=" returns="_5180" artificial="1" throw="" context="_95" access="public" mangled="_ZN26xcb_get_font_path_cookie_taSERKS_" demangled="xcb_get_font_path_cookie_t::operator=(xcb_get_font_path_cookie_t const&amp;)" location="f0:2872" file="f0" line="2872" endline="2872" inline="1">
    <Argument type="_5181" location="f0:2872" file="f0" line="2872"/>
  </OperatorMethod>
  <Constructor id="_2120" name="xcb_get_font_path_cookie_t" artificial="1" throw="" context="_95" access="public" mangled="_ZN26xcb_get_font_path_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_font_path_cookie_t::xcb_get_font_path_cookie_t(xcb_get_font_path_cookie_t const&amp;)" location="f0:2872" file="f0" line="2872" endline="2872" inline="1">
    <Argument type="_5181" location="f0:2872" file="f0" line="2872"/>
  </Constructor>
  <Constructor id="_2121" name="xcb_get_font_path_cookie_t" artificial="1" throw="" context="_95" access="public" mangled="_ZN26xcb_get_font_path_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_font_path_cookie_t::xcb_get_font_path_cookie_t()" location="f0:2872" file="f0" line="2872" inline="1"/>
  <PointerType id="_2122" type="_1894" size="32" align="32"/>
  <Field id="_2123" name="response_type" type="_1473" offset="0" context="_102" access="public" location="f0:2892" file="f0" line="2892"/>
  <Field id="_2124" name="pad0" type="_1473" offset="8" context="_102" access="public" location="f0:2893" file="f0" line="2893"/>
  <Field id="_2125" name="sequence" type="_1398" offset="16" context="_102" access="public" location="f0:2894" file="f0" line="2894"/>
  <Field id="_2126" name="length" type="_705" offset="32" context="_102" access="public" location="f0:2895" file="f0" line="2895"/>
  <Field id="_2127" name="path_len" type="_1398" offset="64" context="_102" access="public" location="f0:2896" file="f0" line="2896"/>
  <Field id="_2128" name="pad1" type="_5182" offset="80" context="_102" access="public" location="f0:2897" file="f0" line="2897"/>
  <Destructor id="_2129" name="xcb_get_font_path_reply_t" artificial="1" throw="" context="_102" access="public" mangled="_ZN25xcb_get_font_path_reply_tD1Ev *INTERNAL* " demangled="xcb_get_font_path_reply_t::~xcb_get_font_path_reply_t()" location="f0:2891" file="f0" line="2891" endline="2891" inline="1">
  </Destructor>
  <OperatorMethod id="_2130" name="=" returns="_5183" artificial="1" throw="" context="_102" access="public" mangled="_ZN25xcb_get_font_path_reply_taSERKS_" demangled="xcb_get_font_path_reply_t::operator=(xcb_get_font_path_reply_t const&amp;)" location="f0:2891" file="f0" line="2891" endline="2891" inline="1">
    <Argument type="_5184" location="f0:2891" file="f0" line="2891"/>
  </OperatorMethod>
  <Constructor id="_2131" name="xcb_get_font_path_reply_t" artificial="1" throw="" context="_102" access="public" mangled="_ZN25xcb_get_font_path_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_font_path_reply_t::xcb_get_font_path_reply_t(xcb_get_font_path_reply_t const&amp;)" location="f0:2891" file="f0" line="2891" endline="2891" inline="1">
    <Argument type="_5184" location="f0:2891" file="f0" line="2891"/>
  </Constructor>
  <Constructor id="_2132" name="xcb_get_font_path_reply_t" artificial="1" throw="" context="_102" access="public" mangled="_ZN25xcb_get_font_path_reply_tC1Ev *INTERNAL* " demangled="xcb_get_font_path_reply_t::xcb_get_font_path_reply_t()" location="f0:2891" file="f0" line="2891" inline="1"/>
  <PointerType id="_2133" type="_199" size="32" align="32"/>
  <PointerType id="_2134" type="_3975" size="32" align="32"/>
  <Field id="_2135" name="major_opcode" type="_1473" offset="0" context="_107" access="public" location="f0:3277" file="f0" line="3277"/>
  <Field id="_2136" name="pad0" type="_1473" offset="8" context="_107" access="public" location="f0:3278" file="f0" line="3278"/>
  <Field id="_2137" name="length" type="_1398" offset="16" context="_107" access="public" location="f0:3279" file="f0" line="3279"/>
  <Field id="_2138" name="src_drawable" type="_882" offset="32" context="_107" access="public" location="f0:3280" file="f0" line="3280"/>
  <Field id="_2139" name="dst_drawable" type="_882" offset="64" context="_107" access="public" location="f0:3281" file="f0" line="3281"/>
  <Field id="_2140" name="gc" type="_1801" offset="96" context="_107" access="public" location="f0:3282" file="f0" line="3282"/>
  <Field id="_2141" name="src_x" type="_887" offset="128" context="_107" access="public" location="f0:3283" file="f0" line="3283"/>
  <Field id="_2142" name="src_y" type="_887" offset="144" context="_107" access="public" location="f0:3284" file="f0" line="3284"/>
  <Field id="_2143" name="dst_x" type="_887" offset="160" context="_107" access="public" location="f0:3285" file="f0" line="3285"/>
  <Field id="_2144" name="dst_y" type="_887" offset="176" context="_107" access="public" location="f0:3286" file="f0" line="3286"/>
  <Field id="_2145" name="width" type="_1398" offset="192" context="_107" access="public" location="f0:3287" file="f0" line="3287"/>
  <Field id="_2146" name="height" type="_1398" offset="208" context="_107" access="public" location="f0:3288" file="f0" line="3288"/>
  <Field id="_2147" name="bit_plane" type="_705" offset="224" context="_107" access="public" location="f0:3289" file="f0" line="3289"/>
  <Destructor id="_2148" name="xcb_copy_plane_request_t" artificial="1" throw="" context="_107" access="public" mangled="_ZN24xcb_copy_plane_request_tD1Ev *INTERNAL* " demangled="xcb_copy_plane_request_t::~xcb_copy_plane_request_t()" location="f0:3276" file="f0" line="3276" endline="3276" inline="1">
  </Destructor>
  <OperatorMethod id="_2149" name="=" returns="_5185" artificial="1" throw="" context="_107" access="public" mangled="_ZN24xcb_copy_plane_request_taSERKS_" demangled="xcb_copy_plane_request_t::operator=(xcb_copy_plane_request_t const&amp;)" location="f0:3276" file="f0" line="3276" endline="3276" inline="1">
    <Argument type="_5186" location="f0:3276" file="f0" line="3276"/>
  </OperatorMethod>
  <Constructor id="_2150" name="xcb_copy_plane_request_t" artificial="1" throw="" context="_107" access="public" mangled="_ZN24xcb_copy_plane_request_tC1ERKS_ *INTERNAL* " demangled="xcb_copy_plane_request_t::xcb_copy_plane_request_t(xcb_copy_plane_request_t const&amp;)" location="f0:3276" file="f0" line="3276" endline="3276" inline="1">
    <Argument type="_5186" location="f0:3276" file="f0" line="3276"/>
  </Constructor>
  <Constructor id="_2151" name="xcb_copy_plane_request_t" artificial="1" throw="" context="_107" access="public" mangled="_ZN24xcb_copy_plane_request_tC1Ev *INTERNAL* " demangled="xcb_copy_plane_request_t::xcb_copy_plane_request_t()" location="f0:3276" file="f0" line="3276" inline="1"/>
  <Field id="_2152" name="major_opcode" type="_1473" offset="0" context="_110" access="public" location="f0:3239" file="f0" line="3239"/>
  <Field id="_2153" name="exposures" type="_1473" offset="8" context="_110" access="public" location="f0:3240" file="f0" line="3240"/>
  <Field id="_2154" name="length" type="_1398" offset="16" context="_110" access="public" location="f0:3241" file="f0" line="3241"/>
  <Field id="_2155" name="window" type="_684" offset="32" context="_110" access="public" location="f0:3242" file="f0" line="3242"/>
  <Field id="_2156" name="x" type="_887" offset="64" context="_110" access="public" location="f0:3243" file="f0" line="3243"/>
  <Field id="_2157" name="y" type="_887" offset="80" context="_110" access="public" location="f0:3244" file="f0" line="3244"/>
  <Field id="_2158" name="width" type="_1398" offset="96" context="_110" access="public" location="f0:3245" file="f0" line="3245"/>
  <Field id="_2159" name="height" type="_1398" offset="112" context="_110" access="public" location="f0:3246" file="f0" line="3246"/>
  <Destructor id="_2160" name="xcb_clear_area_request_t" artificial="1" throw="" context="_110" access="public" mangled="_ZN24xcb_clear_area_request_tD1Ev *INTERNAL* " demangled="xcb_clear_area_request_t::~xcb_clear_area_request_t()" location="f0:3238" file="f0" line="3238" endline="3238" inline="1">
  </Destructor>
  <OperatorMethod id="_2161" name="=" returns="_5187" artificial="1" throw="" context="_110" access="public" mangled="_ZN24xcb_clear_area_request_taSERKS_" demangled="xcb_clear_area_request_t::operator=(xcb_clear_area_request_t const&amp;)" location="f0:3238" file="f0" line="3238" endline="3238" inline="1">
    <Argument type="_5188" location="f0:3238" file="f0" line="3238"/>
  </OperatorMethod>
  <Constructor id="_2162" name="xcb_clear_area_request_t" artificial="1" throw="" context="_110" access="public" mangled="_ZN24xcb_clear_area_request_tC1ERKS_ *INTERNAL* " demangled="xcb_clear_area_request_t::xcb_clear_area_request_t(xcb_clear_area_request_t const&amp;)" location="f0:3238" file="f0" line="3238" endline="3238" inline="1">
    <Argument type="_5188" location="f0:3238" file="f0" line="3238"/>
  </Constructor>
  <Constructor id="_2163" name="xcb_clear_area_request_t" artificial="1" throw="" context="_110" access="public" mangled="_ZN24xcb_clear_area_request_tC1Ev *INTERNAL* " demangled="xcb_clear_area_request_t::xcb_clear_area_request_t()" location="f0:3238" file="f0" line="3238" inline="1"/>
  <PointerType id="_2164" type="_1825" size="32" align="32"/>
  <Field id="_2165" name="response_type" type="_1473" offset="0" context="_121" access="public" location="f0:1090" file="f0" line="1090"/>
  <Field id="_2166" name="pad0" type="_1473" offset="8" context="_121" access="public" location="f0:1091" file="f0" line="1091"/>
  <Field id="_2167" name="sequence" type="_1398" offset="16" context="_121" access="public" location="f0:1092" file="f0" line="1092"/>
  <Field id="_2168" name="time" type="_1254" offset="32" context="_121" access="public" location="f0:1093" file="f0" line="1093"/>
  <Field id="_2169" name="owner" type="_684" offset="64" context="_121" access="public" location="f0:1094" file="f0" line="1094"/>
  <Field id="_2170" name="requestor" type="_684" offset="96" context="_121" access="public" location="f0:1095" file="f0" line="1095"/>
  <Field id="_2171" name="selection" type="_1688" offset="128" context="_121" access="public" location="f0:1096" file="f0" line="1096"/>
  <Field id="_2172" name="target" type="_1688" offset="160" context="_121" access="public" location="f0:1097" file="f0" line="1097"/>
  <Field id="_2173" name="property" type="_1688" offset="192" context="_121" access="public" location="f0:1098" file="f0" line="1098"/>
  <Destructor id="_2174" name="xcb_selection_request_event_t" artificial="1" throw="" context="_121" access="public" mangled="_ZN29xcb_selection_request_event_tD1Ev *INTERNAL* " demangled="xcb_selection_request_event_t::~xcb_selection_request_event_t()" location="f0:1089" file="f0" line="1089" endline="1089" inline="1">
  </Destructor>
  <OperatorMethod id="_2175" name="=" returns="_5189" artificial="1" throw="" context="_121" access="public" mangled="_ZN29xcb_selection_request_event_taSERKS_" demangled="xcb_selection_request_event_t::operator=(xcb_selection_request_event_t const&amp;)" location="f0:1089" file="f0" line="1089" endline="1089" inline="1">
    <Argument type="_5190" location="f0:1089" file="f0" line="1089"/>
  </OperatorMethod>
  <Constructor id="_2176" name="xcb_selection_request_event_t" artificial="1" throw="" context="_121" access="public" mangled="_ZN29xcb_selection_request_event_tC1ERKS_ *INTERNAL* " demangled="xcb_selection_request_event_t::xcb_selection_request_event_t(xcb_selection_request_event_t const&amp;)" location="f0:1089" file="f0" line="1089" endline="1089" inline="1">
    <Argument type="_5190" location="f0:1089" file="f0" line="1089"/>
  </Constructor>
  <Constructor id="_2177" name="xcb_selection_request_event_t" artificial="1" throw="" context="_121" access="public" mangled="_ZN29xcb_selection_request_event_tC1Ev *INTERNAL* " demangled="xcb_selection_request_event_t::xcb_selection_request_event_t()" location="f0:1089" file="f0" line="1089" inline="1"/>
  <PointerType id="_2178" type="_568c" size="32" align="32"/>
  <Field id="_2179" name="major_opcode" type="_1473" offset="0" context="_126" access="public" location="f0:2923" file="f0" line="2923"/>
  <Field id="_2180" name="pad0" type="_1473" offset="8" context="_126" access="public" location="f0:2924" file="f0" line="2924"/>
  <Field id="_2181" name="length" type="_1398" offset="16" context="_126" access="public" location="f0:2925" file="f0" line="2925"/>
  <Field id="_2182" name="pixmap" type="_1770" offset="32" context="_126" access="public" location="f0:2926" file="f0" line="2926"/>
  <Destructor id="_2183" name="xcb_free_pixmap_request_t" artificial="1" throw="" context="_126" access="public" mangled="_ZN25xcb_free_pixmap_request_tD1Ev *INTERNAL* " demangled="xcb_free_pixmap_request_t::~xcb_free_pixmap_request_t()" location="f0:2922" file="f0" line="2922" endline="2922" inline="1">
  </Destructor>
  <OperatorMethod id="_2184" name="=" returns="_5192" artificial="1" throw="" context="_126" access="public" mangled="_ZN25xcb_free_pixmap_request_taSERKS_" demangled="xcb_free_pixmap_request_t::operator=(xcb_free_pixmap_request_t const&amp;)" location="f0:2922" file="f0" line="2922" endline="2922" inline="1">
    <Argument type="_5193" location="f0:2922" file="f0" line="2922"/>
  </OperatorMethod>
  <Constructor id="_2185" name="xcb_free_pixmap_request_t" artificial="1" throw="" context="_126" access="public" mangled="_ZN25xcb_free_pixmap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_free_pixmap_request_t::xcb_free_pixmap_request_t(xcb_free_pixmap_request_t const&amp;)" location="f0:2922" file="f0" line="2922" endline="2922" inline="1">
    <Argument type="_5193" location="f0:2922" file="f0" line="2922"/>
  </Constructor>
  <Constructor id="_2186" name="xcb_free_pixmap_request_t" artificial="1" throw="" context="_126" access="public" mangled="_ZN25xcb_free_pixmap_request_tC1Ev *INTERNAL* " demangled="xcb_free_pixmap_request_t::xcb_free_pixmap_request_t()" location="f0:2922" file="f0" line="2922" inline="1"/>
  <Field id="_2187" name="response_type" type="_1473" offset="0" context="_129" access="public" location="f0:822" file="f0" line="822"/>
  <Field id="_2188" name="pad0" type="_1473" offset="8" context="_129" access="public" location="f0:823" file="f0" line="823"/>
  <Field id="_2189" name="sequence" type="_1398" offset="16" context="_129" access="public" location="f0:824" file="f0" line="824"/>
  <Field id="_2190" name="event" type="_684" offset="32" context="_129" access="public" location="f0:825" file="f0" line="825"/>
  <Field id="_2191" name="window" type="_684" offset="64" context="_129" access="public" location="f0:826" file="f0" line="826"/>
  <Field id="_2192" name="override_redirect" type="_1473" offset="96" context="_129" access="public" location="f0:827" file="f0" line="827"/>
  <Field id="_2193" name="pad1" type="_5171" offset="104" context="_129" access="public" location="f0:828" file="f0" line="828"/>
  <Destructor id="_2194" name="xcb_map_notify_event_t" artificial="1" throw="" context="_129" access="public" mangled="_ZN22xcb_map_notify_event_tD1Ev *INTERNAL* " demangled="xcb_map_notify_event_t::~xcb_map_notify_event_t()" location="f0:821" file="f0" line="821" endline="821" inline="1">
  </Destructor>
  <OperatorMethod id="_2195" name="=" returns="_5194" artificial="1" throw="" context="_129" access="public" mangled="_ZN22xcb_map_notify_event_taSERKS_" demangled="xcb_map_notify_event_t::operator=(xcb_map_notify_event_t const&amp;)" location="f0:821" file="f0" line="821" endline="821" inline="1">
    <Argument type="_5195" location="f0:821" file="f0" line="821"/>
  </OperatorMethod>
  <Constructor id="_2196" name="xcb_map_notify_event_t" artificial="1" throw="" context="_129" access="public" mangled="_ZN22xcb_map_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_map_notify_event_t::xcb_map_notify_event_t(xcb_map_notify_event_t const&amp;)" location="f0:821" file="f0" line="821" endline="821" inline="1">
    <Argument type="_5195" location="f0:821" file="f0" line="821"/>
  </Constructor>
  <Constructor id="_2197" name="xcb_map_notify_event_t" artificial="1" throw="" context="_129" access="public" mangled="_ZN22xcb_map_notify_event_tC1Ev *INTERNAL* " demangled="xcb_map_notify_event_t::xcb_map_notify_event_t()" location="f0:821" file="f0" line="821" inline="1"/>
  <Field id="_2198" name="__val" type="_5196" offset="0" context="_131" access="public" location="f11:30" file="f11" line="30"/>
  <Destructor id="_2199" name="._1" artificial="1" throw="" context="_131" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f11:31" file="f11" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_2200" name="=" returns="_5197" artificial="1" throw="" context="_131" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f11:31" file="f11" line="31" endline="31" inline="1">
    <Argument type="_5198" location="f11:29" file="f11" line="29"/>
  </OperatorMethod>
  <Constructor id="_2201" name="._1" artificial="1" throw="" context="_131" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f11:31" file="f11" line="31" endline="31" inline="1">
    <Argument type="_5198" location="f11:29" file="f11" line="29"/>
  </Constructor>
  <Constructor id="_2202" name="._1" artificial="1" throw="" context="_131" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f11:31" file="f11" line="31" inline="1"/>
  <Field id="_2203" name="__next" type="_5199" offset="0" context="_133" access="public" location="f9:83" file="f9" line="83"/>
  <Destructor id="_2204" name="__pthread_internal_slist" artificial="1" throw="" context="_133" access="public" mangled="_ZN24__pthread_internal_slistD1Ev *INTERNAL* " demangled="__pthread_internal_slist::~__pthread_internal_slist()" location="f9:82" file="f9" line="82" endline="82" inline="1">
  </Destructor>
  <OperatorMethod id="_2205" name="=" returns="_5200" artificial="1" throw="" context="_133" access="public" mangled="_ZN24__pthread_internal_slistaSERKS_" demangled="__pthread_internal_slist::operator=(__pthread_internal_slist const&amp;)" location="f9:82" file="f9" line="82" endline="82" inline="1">
    <Argument type="_5201" location="f9:82" file="f9" line="82"/>
  </OperatorMethod>
  <Constructor id="_2206" name="__pthread_internal_slist" artificial="1" throw="" context="_133" access="public" mangled="_ZN24__pthread_internal_slistC1ERKS_ *INTERNAL* " demangled="__pthread_internal_slist::__pthread_internal_slist(__pthread_internal_slist const&amp;)" location="f9:82" file="f9" line="82" endline="82" inline="1">
    <Argument type="_5201" location="f9:82" file="f9" line="82"/>
  </Constructor>
  <Constructor id="_2207" name="__pthread_internal_slist" artificial="1" throw="" context="_133" access="public" mangled="_ZN24__pthread_internal_slistC1Ev *INTERNAL* " demangled="__pthread_internal_slist::__pthread_internal_slist()" location="f9:82" file="f9" line="82" inline="1"/>
  <PointerType id="_2208" type="_1048" size="32" align="32"/>
  <Field id="_2209" name="response_type" type="_1473" offset="0" context="_145" access="public" location="f0:1226" file="f0" line="1226"/>
  <Field id="_2210" name="error_code" type="_1473" offset="8" context="_145" access="public" location="f0:1227" file="f0" line="1227"/>
  <Field id="_2211" name="sequence" type="_1398" offset="16" context="_145" access="public" location="f0:1228" file="f0" line="1228"/>
  <Field id="_2212" name="bad_value" type="_705" offset="32" context="_145" access="public" location="f0:1229" file="f0" line="1229"/>
  <Field id="_2213" name="minor_opcode" type="_1398" offset="64" context="_145" access="public" location="f0:1230" file="f0" line="1230"/>
  <Field id="_2214" name="major_opcode" type="_1473" offset="80" context="_145" access="public" location="f0:1231" file="f0" line="1231"/>
  <Field id="_2215" name="pad0" type="_1473" offset="88" context="_145" access="public" location="f0:1232" file="f0" line="1232"/>
  <Destructor id="_2216" name="xcb_value_error_t" artificial="1" throw="" context="_145" access="public" mangled="_ZN17xcb_value_error_tD1Ev *INTERNAL* " demangled="xcb_value_error_t::~xcb_value_error_t()" location="f0:1225" file="f0" line="1225" endline="1225" inline="1">
  </Destructor>
  <OperatorMethod id="_2217" name="=" returns="_5202" artificial="1" throw="" context="_145" access="public" mangled="_ZN17xcb_value_error_taSERKS_" demangled="xcb_value_error_t::operator=(xcb_value_error_t const&amp;)" location="f0:1225" file="f0" line="1225" endline="1225" inline="1">
    <Argument type="_5203" location="f0:1225" file="f0" line="1225"/>
  </OperatorMethod>
  <Constructor id="_2218" name="xcb_value_error_t" artificial="1" throw="" context="_145" access="public" mangled="_ZN17xcb_value_error_tC1ERKS_ *INTERNAL* " demangled="xcb_value_error_t::xcb_value_error_t(xcb_value_error_t const&amp;)" location="f0:1225" file="f0" line="1225" endline="1225" inline="1">
    <Argument type="_5203" location="f0:1225" file="f0" line="1225"/>
  </Constructor>
  <Constructor id="_2219" name="xcb_value_error_t" artificial="1" throw="" context="_145" access="public" mangled="_ZN17xcb_value_error_tC1Ev *INTERNAL* " demangled="xcb_value_error_t::xcb_value_error_t()" location="f0:1225" file="f0" line="1225" inline="1"/>
  <PointerType id="_2220" type="_1302c" size="32" align="32"/>
  <Field id="_2221" name="major_opcode" type="_1473" offset="0" context="_148" access="public" location="f0:4253" file="f0" line="4253"/>
  <Field id="_2222" name="pad0" type="_1473" offset="8" context="_148" access="public" location="f0:4254" file="f0" line="4254"/>
  <Field id="_2223" name="length" type="_1398" offset="16" context="_148" access="public" location="f0:4255" file="f0" line="4255"/>
  <Field id="_2224" name="value_mask" type="_705" offset="32" context="_148" access="public" location="f0:4256" file="f0" line="4256"/>
  <Destructor id="_2225" name="xcb_change_keyboard_control_request_t" artificial="1" throw="" context="_148" access="public" mangled="_ZN37xcb_change_keyboard_control_request_tD1Ev *INTERNAL* " demangled="xcb_change_keyboard_control_request_t::~xcb_change_keyboard_control_request_t()" location="f0:4252" file="f0" line="4252" endline="4252" inline="1">
  </Destructor>
  <OperatorMethod id="_2226" name="=" returns="_5205" artificial="1" throw="" context="_148" access="public" mangled="_ZN37xcb_change_keyboard_control_request_taSERKS_" demangled="xcb_change_keyboard_control_request_t::operator=(xcb_change_keyboard_control_request_t const&amp;)" location="f0:4252" file="f0" line="4252" endline="4252" inline="1">
    <Argument type="_5206" location="f0:4252" file="f0" line="4252"/>
  </OperatorMethod>
  <Constructor id="_2227" name="xcb_change_keyboard_control_request_t" artificial="1" throw="" context="_148" access="public" mangled="_ZN37xcb_change_keyboard_control_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_keyboard_control_request_t::xcb_change_keyboard_control_request_t(xcb_change_keyboard_control_request_t const&amp;)" location="f0:4252" file="f0" line="4252" endline="4252" inline="1">
    <Argument type="_5206" location="f0:4252" file="f0" line="4252"/>
  </Constructor>
  <Constructor id="_2228" name="xcb_change_keyboard_control_request_t" artificial="1" throw="" context="_148" access="public" mangled="_ZN37xcb_change_keyboard_control_request_tC1Ev *INTERNAL* " demangled="xcb_change_keyboard_control_request_t::xcb_change_keyboard_control_request_t()" location="f0:4252" file="f0" line="4252" inline="1"/>
  <FundamentalType id="_2229" name="complex double" size="128" align="64"/>
  <PointerType id="_2230" type="_467" size="32" align="32"/>
  <Field id="_2231" name="data" type="_5207" offset="0" context="_162" access="public" location="f0:2771" file="f0" line="2771"/>
  <Field id="_2232" name="rem" type="_188" offset="32" context="_162" access="public" location="f0:2772" file="f0" line="2772"/>
  <Field id="_2233" name="index" type="_188" offset="64" context="_162" access="public" location="f0:2773" file="f0" line="2773"/>
  <Destructor id="_2234" name="xcb_str_iterator_t" artificial="1" throw="" context="_162" access="public" mangled="_ZN18xcb_str_iterator_tD1Ev *INTERNAL* " demangled="xcb_str_iterator_t::~xcb_str_iterator_t()" location="f0:2770" file="f0" line="2770" endline="2770" inline="1">
  </Destructor>
  <OperatorMethod id="_2235" name="=" returns="_5208" artificial="1" throw="" context="_162" access="public" mangled="_ZN18xcb_str_iterator_taSERKS_" demangled="xcb_str_iterator_t::operator=(xcb_str_iterator_t const&amp;)" location="f0:2770" file="f0" line="2770" endline="2770" inline="1">
    <Argument type="_5209" location="f0:2770" file="f0" line="2770"/>
  </OperatorMethod>
  <Constructor id="_2236" name="xcb_str_iterator_t" artificial="1" throw="" context="_162" access="public" mangled="_ZN18xcb_str_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_str_iterator_t::xcb_str_iterator_t(xcb_str_iterator_t const&amp;)" location="f0:2770" file="f0" line="2770" endline="2770" inline="1">
    <Argument type="_5209" location="f0:2770" file="f0" line="2770"/>
  </Constructor>
  <Constructor id="_2237" name="xcb_str_iterator_t" artificial="1" throw="" context="_162" access="public" mangled="_ZN18xcb_str_iterator_tC1Ev *INTERNAL* " demangled="xcb_str_iterator_t::xcb_str_iterator_t()" location="f0:2770" file="f0" line="2770" inline="1"/>
  <PointerType id="_2238" type="_342c" size="32" align="32"/>
  <PointerType id="_2239" type="_1688c" size="32" align="32"/>
  <Field id="_2240" name="major_opcode" type="_1473" offset="0" context="_167" access="public" location="f0:3160" file="f0" line="3160"/>
  <Field id="_2241" name="pad0" type="_1473" offset="8" context="_167" access="public" location="f0:3161" file="f0" line="3161"/>
  <Field id="_2242" name="length" type="_1398" offset="16" context="_167" access="public" location="f0:3162" file="f0" line="3162"/>
  <Field id="_2243" name="gc" type="_1801" offset="32" context="_167" access="public" location="f0:3163" file="f0" line="3163"/>
  <Field id="_2244" name="value_mask" type="_705" offset="64" context="_167" access="public" location="f0:3164" file="f0" line="3164"/>
  <Destructor id="_2245" name="xcb_change_gc_request_t" artificial="1" throw="" context="_167" access="public" mangled="_ZN23xcb_change_gc_request_tD1Ev *INTERNAL* " demangled="xcb_change_gc_request_t::~xcb_change_gc_request_t()" location="f0:3159" file="f0" line="3159" endline="3159" inline="1">
  </Destructor>
  <OperatorMethod id="_2246" name="=" returns="_5212" artificial="1" throw="" context="_167" access="public" mangled="_ZN23xcb_change_gc_request_taSERKS_" demangled="xcb_change_gc_request_t::operator=(xcb_change_gc_request_t const&amp;)" location="f0:3159" file="f0" line="3159" endline="3159" inline="1">
    <Argument type="_5213" location="f0:3159" file="f0" line="3159"/>
  </OperatorMethod>
  <Constructor id="_2247" name="xcb_change_gc_request_t" artificial="1" throw="" context="_167" access="public" mangled="_ZN23xcb_change_gc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_gc_request_t::xcb_change_gc_request_t(xcb_change_gc_request_t const&amp;)" location="f0:3159" file="f0" line="3159" endline="3159" inline="1">
    <Argument type="_5213" location="f0:3159" file="f0" line="3159"/>
  </Constructor>
  <Constructor id="_2248" name="xcb_change_gc_request_t" artificial="1" throw="" context="_167" access="public" mangled="_ZN23xcb_change_gc_request_tC1Ev *INTERNAL* " demangled="xcb_change_gc_request_t::xcb_change_gc_request_t()" location="f0:3159" file="f0" line="3159" inline="1"/>
  <PointerType id="_2249" type="_684" size="32" align="32"/>
  <PointerType id="_2250" type="_342" size="32" align="32"/>
  <PointerType id="_2251" type="_1278" size="32" align="32"/>
  <PointerType id="_2252" type="_1309c" size="32" align="32"/>
  <Field id="_2253" name="sequence" type="_100" offset="0" context="_176" access="public" location="f0:2581" file="f0" line="2581"/>
  <Destructor id="_2254" name="xcb_query_keymap_cookie_t" artificial="1" throw="" context="_176" access="public" mangled="_ZN25xcb_query_keymap_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_keymap_cookie_t::~xcb_query_keymap_cookie_t()" location="f0:2580" file="f0" line="2580" endline="2580" inline="1">
  </Destructor>
  <OperatorMethod id="_2255" name="=" returns="_5215" artificial="1" throw="" context="_176" access="public" mangled="_ZN25xcb_query_keymap_cookie_taSERKS_" demangled="xcb_query_keymap_cookie_t::operator=(xcb_query_keymap_cookie_t const&amp;)" location="f0:2580" file="f0" line="2580" endline="2580" inline="1">
    <Argument type="_5216" location="f0:2580" file="f0" line="2580"/>
  </OperatorMethod>
  <Constructor id="_2256" name="xcb_query_keymap_cookie_t" artificial="1" throw="" context="_176" access="public" mangled="_ZN25xcb_query_keymap_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_keymap_cookie_t::xcb_query_keymap_cookie_t(xcb_query_keymap_cookie_t const&amp;)" location="f0:2580" file="f0" line="2580" endline="2580" inline="1">
    <Argument type="_5216" location="f0:2580" file="f0" line="2580"/>
  </Constructor>
  <Constructor id="_2257" name="xcb_query_keymap_cookie_t" artificial="1" throw="" context="_176" access="public" mangled="_ZN25xcb_query_keymap_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_keymap_cookie_t::xcb_query_keymap_cookie_t()" location="f0:2580" file="f0" line="2580" inline="1"/>
  <PointerType id="_2258" type="_1578" size="32" align="32"/>
  <Field id="_2259" name="response_type" type="_1473" offset="0" context="_179" access="public" location="f0:713" file="f0" line="713"/>
  <Field id="_2260" name="pad0" type="_1473" offset="8" context="_179" access="public" location="f0:714" file="f0" line="714"/>
  <Field id="_2261" name="sequence" type="_1398" offset="16" context="_179" access="public" location="f0:715" file="f0" line="715"/>
  <Field id="_2262" name="drawable" type="_882" offset="32" context="_179" access="public" location="f0:716" file="f0" line="716"/>
  <Field id="_2263" name="x" type="_1398" offset="64" context="_179" access="public" location="f0:717" file="f0" line="717"/>
  <Field id="_2264" name="y" type="_1398" offset="80" context="_179" access="public" location="f0:718" file="f0" line="718"/>
  <Field id="_2265" name="width" type="_1398" offset="96" context="_179" access="public" location="f0:719" file="f0" line="719"/>
  <Field id="_2266" name="height" type="_1398" offset="112" context="_179" access="public" location="f0:720" file="f0" line="720"/>
  <Field id="_2267" name="minor_opcode" type="_1398" offset="128" context="_179" access="public" location="f0:721" file="f0" line="721"/>
  <Field id="_2268" name="count" type="_1398" offset="144" context="_179" access="public" location="f0:722" file="f0" line="722"/>
  <Field id="_2269" name="major_opcode" type="_1473" offset="160" context="_179" access="public" location="f0:723" file="f0" line="723"/>
  <Field id="_2270" name="pad1" type="_5171" offset="168" context="_179" access="public" location="f0:724" file="f0" line="724"/>
  <Destructor id="_2271" name="xcb_graphics_exposure_event_t" artificial="1" throw="" context="_179" access="public" mangled="_ZN29xcb_graphics_exposure_event_tD1Ev *INTERNAL* " demangled="xcb_graphics_exposure_event_t::~xcb_graphics_exposure_event_t()" location="f0:712" file="f0" line="712" endline="712" inline="1">
  </Destructor>
  <OperatorMethod id="_2272" name="=" returns="_5217" artificial="1" throw="" context="_179" access="public" mangled="_ZN29xcb_graphics_exposure_event_taSERKS_" demangled="xcb_graphics_exposure_event_t::operator=(xcb_graphics_exposure_event_t const&amp;)" location="f0:712" file="f0" line="712" endline="712" inline="1">
    <Argument type="_5218" location="f0:712" file="f0" line="712"/>
  </OperatorMethod>
  <Constructor id="_2273" name="xcb_graphics_exposure_event_t" artificial="1" throw="" context="_179" access="public" mangled="_ZN29xcb_graphics_exposure_event_tC1ERKS_ *INTERNAL* " demangled="xcb_graphics_exposure_event_t::xcb_graphics_exposure_event_t(xcb_graphics_exposure_event_t const&amp;)" location="f0:712" file="f0" line="712" endline="712" inline="1">
    <Argument type="_5218" location="f0:712" file="f0" line="712"/>
  </Constructor>
  <Constructor id="_2274" name="xcb_graphics_exposure_event_t" artificial="1" throw="" context="_179" access="public" mangled="_ZN29xcb_graphics_exposure_event_tC1Ev *INTERNAL* " demangled="xcb_graphics_exposure_event_t::xcb_graphics_exposure_event_t()" location="f0:712" file="f0" line="712" inline="1"/>
  <Field id="_2275" name="sequence" type="_100" offset="0" context="_182" access="public" location="f0:2780" file="f0" line="2780"/>
  <Destructor id="_2276" name="xcb_list_fonts_cookie_t" artificial="1" throw="" context="_182" access="public" mangled="_ZN23xcb_list_fonts_cookie_tD1Ev *INTERNAL* " demangled="xcb_list_fonts_cookie_t::~xcb_list_fonts_cookie_t()" location="f0:2779" file="f0" line="2779" endline="2779" inline="1">
  </Destructor>
  <OperatorMethod id="_2277" name="=" returns="_5219" artificial="1" throw="" context="_182" access="public" mangled="_ZN23xcb_list_fonts_cookie_taSERKS_" demangled="xcb_list_fonts_cookie_t::operator=(xcb_list_fonts_cookie_t const&amp;)" location="f0:2779" file="f0" line="2779" endline="2779" inline="1">
    <Argument type="_5220" location="f0:2779" file="f0" line="2779"/>
  </OperatorMethod>
  <Constructor id="_2278" name="xcb_list_fonts_cookie_t" artificial="1" throw="" context="_182" access="public" mangled="_ZN23xcb_list_fonts_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_list_fonts_cookie_t::xcb_list_fonts_cookie_t(xcb_list_fonts_cookie_t const&amp;)" location="f0:2779" file="f0" line="2779" endline="2779" inline="1">
    <Argument type="_5220" location="f0:2779" file="f0" line="2779"/>
  </Constructor>
  <Constructor id="_2279" name="xcb_list_fonts_cookie_t" artificial="1" throw="" context="_182" access="public" mangled="_ZN23xcb_list_fonts_cookie_tC1Ev *INTERNAL* " demangled="xcb_list_fonts_cookie_t::xcb_list_fonts_cookie_t()" location="f0:2779" file="f0" line="2779" inline="1"/>
  <PointerType id="_2280" type="_60" size="32" align="32"/>
  <PointerType id="_2281" type="_1776" size="32" align="32"/>
  <CvQualifiedType id="_2281r" type="_2281" restrict="1"/>
  <PointerType id="_2283" type="_1278c" size="32" align="32"/>
  <CvQualifiedType id="_2283r" type="_2283" restrict="1"/>
  <PointerType id="_2285" type="_5222" size="32" align="32"/>
  <CvQualifiedType id="_507r" type="_507" restrict="1"/>
  <Field id="_2287" name="response_type" type="_1473" offset="0" context="_196" access="public" location="f0:4488" file="f0" line="4488"/>
  <Field id="_2288" name="mode" type="_1473" offset="8" context="_196" access="public" location="f0:4489" file="f0" line="4489"/>
  <Field id="_2289" name="sequence" type="_1398" offset="16" context="_196" access="public" location="f0:4490" file="f0" line="4490"/>
  <Field id="_2290" name="length" type="_705" offset="32" context="_196" access="public" location="f0:4491" file="f0" line="4491"/>
  <Field id="_2291" name="hosts_len" type="_1398" offset="64" context="_196" access="public" location="f0:4492" file="f0" line="4492"/>
  <Field id="_2292" name="pad0" type="_5182" offset="80" context="_196" access="public" location="f0:4493" file="f0" line="4493"/>
  <Destructor id="_2293" name="xcb_list_hosts_reply_t" artificial="1" throw="" context="_196" access="public" mangled="_ZN22xcb_list_hosts_reply_tD1Ev *INTERNAL* " demangled="xcb_list_hosts_reply_t::~xcb_list_hosts_reply_t()" location="f0:4487" file="f0" line="4487" endline="4487" inline="1">
  </Destructor>
  <OperatorMethod id="_2294" name="=" returns="_5223" artificial="1" throw="" context="_196" access="public" mangled="_ZN22xcb_list_hosts_reply_taSERKS_" demangled="xcb_list_hosts_reply_t::operator=(xcb_list_hosts_reply_t const&amp;)" location="f0:4487" file="f0" line="4487" endline="4487" inline="1">
    <Argument type="_5224" location="f0:4487" file="f0" line="4487"/>
  </OperatorMethod>
  <Constructor id="_2295" name="xcb_list_hosts_reply_t" artificial="1" throw="" context="_196" access="public" mangled="_ZN22xcb_list_hosts_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_list_hosts_reply_t::xcb_list_hosts_reply_t(xcb_list_hosts_reply_t const&amp;)" location="f0:4487" file="f0" line="4487" endline="4487" inline="1">
    <Argument type="_5224" location="f0:4487" file="f0" line="4487"/>
  </Constructor>
  <Constructor id="_2296" name="xcb_list_hosts_reply_t" artificial="1" throw="" context="_196" access="public" mangled="_ZN22xcb_list_hosts_reply_tC1Ev *INTERNAL* " demangled="xcb_list_hosts_reply_t::xcb_list_hosts_reply_t()" location="f0:4487" file="f0" line="4487" inline="1"/>
  <Field id="_2297" name="atoms_len" type="_705" offset="0" context="_199" access="public" location="f5:980" file="f5" line="980"/>
  <Field id="_2298" name="atoms" type="_2383" offset="32" context="_199" access="public" location="f5:982" file="f5" line="982"/>
  <Field id="_2299" name="_reply" type="_2250" offset="64" context="_199" access="public" location="f5:985" file="f5" line="985"/>
  <Destructor id="_2300" name="._41" artificial="1" throw="" context="_199" access="public" mangled="_ZN34xcb_icccm_get_wm_protocols_reply_tD1Ev *INTERNAL* " demangled="xcb_icccm_get_wm_protocols_reply_t::~xcb_icccm_get_wm_protocols_reply_t()" location="f5:986" file="f5" line="986" endline="986" inline="1">
  </Destructor>
  <OperatorMethod id="_2301" name="=" returns="_5225" artificial="1" throw="" context="_199" access="public" mangled="_ZN34xcb_icccm_get_wm_protocols_reply_taSERKS_" demangled="xcb_icccm_get_wm_protocols_reply_t::operator=(xcb_icccm_get_wm_protocols_reply_t const&amp;)" location="f5:986" file="f5" line="986" endline="986" inline="1">
    <Argument type="_5226" location="f5:978" file="f5" line="978"/>
  </OperatorMethod>
  <Constructor id="_2302" name="._41" artificial="1" throw="" context="_199" access="public" mangled="_ZN34xcb_icccm_get_wm_protocols_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_icccm_get_wm_protocols_reply_t::xcb_icccm_get_wm_protocols_reply_t(xcb_icccm_get_wm_protocols_reply_t const&amp;)" location="f5:986" file="f5" line="986" endline="986" inline="1">
    <Argument type="_5226" location="f5:978" file="f5" line="978"/>
  </Constructor>
  <Constructor id="_2303" name="._41" artificial="1" throw="" context="_199" access="public" mangled="_ZN34xcb_icccm_get_wm_protocols_reply_tC1Ev *INTERNAL* " demangled="xcb_icccm_get_wm_protocols_reply_t::xcb_icccm_get_wm_protocols_reply_t()" location="f5:986" file="f5" line="986" inline="1"/>
  <Field id="_2304" name="response_type" type="_1473" offset="0" context="_201" access="public" location="f0:771" file="f0" line="771"/>
  <Field id="_2305" name="pad0" type="_1473" offset="8" context="_201" access="public" location="f0:772" file="f0" line="772"/>
  <Field id="_2306" name="sequence" type="_1398" offset="16" context="_201" access="public" location="f0:773" file="f0" line="773"/>
  <Field id="_2307" name="parent" type="_684" offset="32" context="_201" access="public" location="f0:774" file="f0" line="774"/>
  <Field id="_2308" name="window" type="_684" offset="64" context="_201" access="public" location="f0:775" file="f0" line="775"/>
  <Field id="_2309" name="x" type="_887" offset="96" context="_201" access="public" location="f0:776" file="f0" line="776"/>
  <Field id="_2310" name="y" type="_887" offset="112" context="_201" access="public" location="f0:777" file="f0" line="777"/>
  <Field id="_2311" name="width" type="_1398" offset="128" context="_201" access="public" location="f0:778" file="f0" line="778"/>
  <Field id="_2312" name="height" type="_1398" offset="144" context="_201" access="public" location="f0:779" file="f0" line="779"/>
  <Field id="_2313" name="border_width" type="_1398" offset="160" context="_201" access="public" location="f0:780" file="f0" line="780"/>
  <Field id="_2314" name="override_redirect" type="_1473" offset="176" context="_201" access="public" location="f0:781" file="f0" line="781"/>
  <Field id="_2315" name="pad1" type="_1473" offset="184" context="_201" access="public" location="f0:782" file="f0" line="782"/>
  <Destructor id="_2316" name="xcb_create_notify_event_t" artificial="1" throw="" context="_201" access="public" mangled="_ZN25xcb_create_notify_event_tD1Ev *INTERNAL* " demangled="xcb_create_notify_event_t::~xcb_create_notify_event_t()" location="f0:770" file="f0" line="770" endline="770" inline="1">
  </Destructor>
  <OperatorMethod id="_2317" name="=" returns="_5227" artificial="1" throw="" context="_201" access="public" mangled="_ZN25xcb_create_notify_event_taSERKS_" demangled="xcb_create_notify_event_t::operator=(xcb_create_notify_event_t const&amp;)" location="f0:770" file="f0" line="770" endline="770" inline="1">
    <Argument type="_5228" location="f0:770" file="f0" line="770"/>
  </OperatorMethod>
  <Constructor id="_2318" name="xcb_create_notify_event_t" artificial="1" throw="" context="_201" access="public" mangled="_ZN25xcb_create_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_create_notify_event_t::xcb_create_notify_event_t(xcb_create_notify_event_t const&amp;)" location="f0:770" file="f0" line="770" endline="770" inline="1">
    <Argument type="_5228" location="f0:770" file="f0" line="770"/>
  </Constructor>
  <Constructor id="_2319" name="xcb_create_notify_event_t" artificial="1" throw="" context="_201" access="public" mangled="_ZN25xcb_create_notify_event_tC1Ev *INTERNAL* " demangled="xcb_create_notify_event_t::xcb_create_notify_event_t()" location="f0:770" file="f0" line="770" inline="1"/>
  <PointerType id="_2320" type="_1242" size="32" align="32"/>
  <PointerType id="_2321" type="_60c" size="32" align="32"/>
  <CvQualifiedType id="_2321r" type="_2321" restrict="1"/>
  <PointerType id="_2323" type="_1167" size="32" align="32"/>
  <CvQualifiedType id="_2323r" type="_2323" restrict="1"/>
  <Field id="_2325" name="response_type" type="_1473" offset="0" context="_208" access="public" location="f0:4609" file="f0" line="4609"/>
  <Field id="_2326" name="status" type="_1473" offset="8" context="_208" access="public" location="f0:4610" file="f0" line="4610"/>
  <Field id="_2327" name="sequence" type="_1398" offset="16" context="_208" access="public" location="f0:4611" file="f0" line="4611"/>
  <Field id="_2328" name="length" type="_705" offset="32" context="_208" access="public" location="f0:4612" file="f0" line="4612"/>
  <Destructor id="_2329" name="xcb_set_pointer_mapping_reply_t" artificial="1" throw="" context="_208" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_tD1Ev *INTERNAL* " demangled="xcb_set_pointer_mapping_reply_t::~xcb_set_pointer_mapping_reply_t()" location="f0:4608" file="f0" line="4608" endline="4608" inline="1">
  </Destructor>
  <OperatorMethod id="_2330" name="=" returns="_5230" artificial="1" throw="" context="_208" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_taSERKS_" demangled="xcb_set_pointer_mapping_reply_t::operator=(xcb_set_pointer_mapping_reply_t const&amp;)" location="f0:4608" file="f0" line="4608" endline="4608" inline="1">
    <Argument type="_5231" location="f0:4608" file="f0" line="4608"/>
  </OperatorMethod>
  <Constructor id="_2331" name="xcb_set_pointer_mapping_reply_t" artificial="1" throw="" context="_208" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_set_pointer_mapping_reply_t::xcb_set_pointer_mapping_reply_t(xcb_set_pointer_mapping_reply_t const&amp;)" location="f0:4608" file="f0" line="4608" endline="4608" inline="1">
    <Argument type="_5231" location="f0:4608" file="f0" line="4608"/>
  </Constructor>
  <Constructor id="_2332" name="xcb_set_pointer_mapping_reply_t" artificial="1" throw="" context="_208" access="public" mangled="_ZN31xcb_set_pointer_mapping_reply_tC1Ev *INTERNAL* " demangled="xcb_set_pointer_mapping_reply_t::xcb_set_pointer_mapping_reply_t()" location="f0:4608" file="f0" line="4608" inline="1"/>
  <PointerType id="_2333" type="_389c" size="32" align="32"/>
  <Field id="_2334" name="data" type="_2249" offset="0" context="_217" access="public" location="f0:44" file="f0" line="44"/>
  <Field id="_2335" name="rem" type="_188" offset="32" context="_217" access="public" location="f0:45" file="f0" line="45"/>
  <Field id="_2336" name="index" type="_188" offset="64" context="_217" access="public" location="f0:46" file="f0" line="46"/>
  <Destructor id="_2337" name="xcb_window_iterator_t" artificial="1" throw="" context="_217" access="public" mangled="_ZN21xcb_window_iterator_tD1Ev *INTERNAL* " demangled="xcb_window_iterator_t::~xcb_window_iterator_t()" location="f0:43" file="f0" line="43" endline="43" inline="1">
  </Destructor>
  <OperatorMethod id="_2338" name="=" returns="_5233" artificial="1" throw="" context="_217" access="public" mangled="_ZN21xcb_window_iterator_taSERKS_" demangled="xcb_window_iterator_t::operator=(xcb_window_iterator_t const&amp;)" location="f0:43" file="f0" line="43" endline="43" inline="1">
    <Argument type="_5234" location="f0:43" file="f0" line="43"/>
  </OperatorMethod>
  <Constructor id="_2339" name="xcb_window_iterator_t" artificial="1" throw="" context="_217" access="public" mangled="_ZN21xcb_window_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_window_iterator_t::xcb_window_iterator_t(xcb_window_iterator_t const&amp;)" location="f0:43" file="f0" line="43" endline="43" inline="1">
    <Argument type="_5234" location="f0:43" file="f0" line="43"/>
  </Constructor>
  <Constructor id="_2340" name="xcb_window_iterator_t" artificial="1" throw="" context="_217" access="public" mangled="_ZN21xcb_window_iterator_tC1Ev *INTERNAL* " demangled="xcb_window_iterator_t::xcb_window_iterator_t()" location="f0:43" file="f0" line="43" inline="1"/>
  <Field id="_2341" name="response_type" type="_1473" offset="0" context="_219" access="public" location="f0:1936" file="f0" line="1936"/>
  <Field id="_2342" name="pad0" type="_1473" offset="8" context="_219" access="public" location="f0:1937" file="f0" line="1937"/>
  <Field id="_2343" name="sequence" type="_1398" offset="16" context="_219" access="public" location="f0:1938" file="f0" line="1938"/>
  <Field id="_2344" name="length" type="_705" offset="32" context="_219" access="public" location="f0:1939" file="f0" line="1939"/>
  <Field id="_2345" name="atoms_len" type="_1398" offset="64" context="_219" access="public" location="f0:1940" file="f0" line="1940"/>
  <Field id="_2346" name="pad1" type="_5182" offset="80" context="_219" access="public" location="f0:1941" file="f0" line="1941"/>
  <Destructor id="_2347" name="xcb_list_properties_reply_t" artificial="1" throw="" context="_219" access="public" mangled="_ZN27xcb_list_properties_reply_tD1Ev *INTERNAL* " demangled="xcb_list_properties_reply_t::~xcb_list_properties_reply_t()" location="f0:1935" file="f0" line="1935" endline="1935" inline="1">
  </Destructor>
  <OperatorMethod id="_2348" name="=" returns="_5235" artificial="1" throw="" context="_219" access="public" mangled="_ZN27xcb_list_properties_reply_taSERKS_" demangled="xcb_list_properties_reply_t::operator=(xcb_list_properties_reply_t const&amp;)" location="f0:1935" file="f0" line="1935" endline="1935" inline="1">
    <Argument type="_5236" location="f0:1935" file="f0" line="1935"/>
  </OperatorMethod>
  <Constructor id="_2349" name="xcb_list_properties_reply_t" artificial="1" throw="" context="_219" access="public" mangled="_ZN27xcb_list_properties_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_list_properties_reply_t::xcb_list_properties_reply_t(xcb_list_properties_reply_t const&amp;)" location="f0:1935" file="f0" line="1935" endline="1935" inline="1">
    <Argument type="_5236" location="f0:1935" file="f0" line="1935"/>
  </Constructor>
  <Constructor id="_2350" name="xcb_list_properties_reply_t" artificial="1" throw="" context="_219" access="public" mangled="_ZN27xcb_list_properties_reply_tC1Ev *INTERNAL* " demangled="xcb_list_properties_reply_t::xcb_list_properties_reply_t()" location="f0:1935" file="f0" line="1935" inline="1"/>
  <PointerType id="_2351" type="_1685" size="32" align="32"/>
  <PointerType id="_2352" type="_1478c" size="32" align="32"/>
  <Field id="_2353" name="sequence" type="_100" offset="0" context="_235" access="public" location="f0:2176" file="f0" line="2176"/>
  <Destructor id="_2354" name="xcb_grab_keyboard_cookie_t" artificial="1" throw="" context="_235" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_tD1Ev *INTERNAL* " demangled="xcb_grab_keyboard_cookie_t::~xcb_grab_keyboard_cookie_t()" location="f0:2175" file="f0" line="2175" endline="2175" inline="1">
  </Destructor>
  <OperatorMethod id="_2355" name="=" returns="_5238" artificial="1" throw="" context="_235" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_taSERKS_" demangled="xcb_grab_keyboard_cookie_t::operator=(xcb_grab_keyboard_cookie_t const&amp;)" location="f0:2175" file="f0" line="2175" endline="2175" inline="1">
    <Argument type="_5239" location="f0:2175" file="f0" line="2175"/>
  </OperatorMethod>
  <Constructor id="_2356" name="xcb_grab_keyboard_cookie_t" artificial="1" throw="" context="_235" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_grab_keyboard_cookie_t::xcb_grab_keyboard_cookie_t(xcb_grab_keyboard_cookie_t const&amp;)" location="f0:2175" file="f0" line="2175" endline="2175" inline="1">
    <Argument type="_5239" location="f0:2175" file="f0" line="2175"/>
  </Constructor>
  <Constructor id="_2357" name="xcb_grab_keyboard_cookie_t" artificial="1" throw="" context="_235" access="public" mangled="_ZN26xcb_grab_keyboard_cookie_tC1Ev *INTERNAL* " demangled="xcb_grab_keyboard_cookie_t::xcb_grab_keyboard_cookie_t()" location="f0:2175" file="f0" line="2175" inline="1"/>
  <PointerType id="_2358" type="_27" size="32" align="32"/>
  <PointerType id="_2359" type="_593" size="32" align="32"/>
  <Field id="_2360" name="sequence" type="_100" offset="0" context="_246" access="public" location="f0:1691" file="f0" line="1691"/>
  <Destructor id="_2361" name="xcb_get_geometry_cookie_t" artificial="1" throw="" context="_246" access="public" mangled="_ZN25xcb_get_geometry_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_geometry_cookie_t::~xcb_get_geometry_cookie_t()" location="f0:1690" file="f0" line="1690" endline="1690" inline="1">
  </Destructor>
  <OperatorMethod id="_2362" name="=" returns="_5240" artificial="1" throw="" context="_246" access="public" mangled="_ZN25xcb_get_geometry_cookie_taSERKS_" demangled="xcb_get_geometry_cookie_t::operator=(xcb_get_geometry_cookie_t const&amp;)" location="f0:1690" file="f0" line="1690" endline="1690" inline="1">
    <Argument type="_5241" location="f0:1690" file="f0" line="1690"/>
  </OperatorMethod>
  <Constructor id="_2363" name="xcb_get_geometry_cookie_t" artificial="1" throw="" context="_246" access="public" mangled="_ZN25xcb_get_geometry_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_geometry_cookie_t::xcb_get_geometry_cookie_t(xcb_get_geometry_cookie_t const&amp;)" location="f0:1690" file="f0" line="1690" endline="1690" inline="1">
    <Argument type="_5241" location="f0:1690" file="f0" line="1690"/>
  </Constructor>
  <Constructor id="_2364" name="xcb_get_geometry_cookie_t" artificial="1" throw="" context="_246" access="public" mangled="_ZN25xcb_get_geometry_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_geometry_cookie_t::xcb_get_geometry_cookie_t()" location="f0:1690" file="f0" line="1690" inline="1"/>
  <PointerType id="_2365" type="_940" size="32" align="32"/>
  <Field id="_2366" name="data" type="_5242" offset="0" context="_255" access="public" location="f0:380" file="f0" line="380"/>
  <Field id="_2367" name="rem" type="_188" offset="32" context="_255" access="public" location="f0:381" file="f0" line="381"/>
  <Field id="_2368" name="index" type="_188" offset="64" context="_255" access="public" location="f0:382" file="f0" line="382"/>
  <Destructor id="_2369" name="xcb_screen_iterator_t" artificial="1" throw="" context="_255" access="public" mangled="_ZN21xcb_screen_iterator_tD1Ev *INTERNAL* " demangled="xcb_screen_iterator_t::~xcb_screen_iterator_t()" location="f0:379" file="f0" line="379" endline="379" inline="1">
  </Destructor>
  <OperatorMethod id="_2370" name="=" returns="_5243" artificial="1" throw="" context="_255" access="public" mangled="_ZN21xcb_screen_iterator_taSERKS_" demangled="xcb_screen_iterator_t::operator=(xcb_screen_iterator_t const&amp;)" location="f0:379" file="f0" line="379" endline="379" inline="1">
    <Argument type="_5244" location="f0:379" file="f0" line="379"/>
  </OperatorMethod>
  <Constructor id="_2371" name="xcb_screen_iterator_t" artificial="1" throw="" context="_255" access="public" mangled="_ZN21xcb_screen_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_screen_iterator_t::xcb_screen_iterator_t(xcb_screen_iterator_t const&amp;)" location="f0:379" file="f0" line="379" endline="379" inline="1">
    <Argument type="_5244" location="f0:379" file="f0" line="379"/>
  </Constructor>
  <Constructor id="_2372" name="xcb_screen_iterator_t" artificial="1" throw="" context="_255" access="public" mangled="_ZN21xcb_screen_iterator_tC1Ev *INTERNAL* " demangled="xcb_screen_iterator_t::xcb_screen_iterator_t()" location="f0:379" file="f0" line="379" inline="1"/>
  <PointerType id="_2373" type="_507" size="32" align="32"/>
  <PointerType id="_2374" type="_734c" size="32" align="32"/>
  <Field id="_2375" name="data" type="_5246" offset="0" context="_266" access="public" location="f0:480" file="f0" line="480"/>
  <Field id="_2376" name="rem" type="_188" offset="32" context="_266" access="public" location="f0:481" file="f0" line="481"/>
  <Field id="_2377" name="index" type="_188" offset="64" context="_266" access="public" location="f0:482" file="f0" line="482"/>
  <Destructor id="_2378" name="xcb_setup_iterator_t" artificial="1" throw="" context="_266" access="public" mangled="_ZN20xcb_setup_iterator_tD1Ev *INTERNAL* " demangled="xcb_setup_iterator_t::~xcb_setup_iterator_t()" location="f0:479" file="f0" line="479" endline="479" inline="1">
  </Destructor>
  <OperatorMethod id="_2379" name="=" returns="_5247" artificial="1" throw="" context="_266" access="public" mangled="_ZN20xcb_setup_iterator_taSERKS_" demangled="xcb_setup_iterator_t::operator=(xcb_setup_iterator_t const&amp;)" location="f0:479" file="f0" line="479" endline="479" inline="1">
    <Argument type="_5248" location="f0:479" file="f0" line="479"/>
  </OperatorMethod>
  <Constructor id="_2380" name="xcb_setup_iterator_t" artificial="1" throw="" context="_266" access="public" mangled="_ZN20xcb_setup_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_iterator_t::xcb_setup_iterator_t(xcb_setup_iterator_t const&amp;)" location="f0:479" file="f0" line="479" endline="479" inline="1">
    <Argument type="_5248" location="f0:479" file="f0" line="479"/>
  </Constructor>
  <Constructor id="_2381" name="xcb_setup_iterator_t" artificial="1" throw="" context="_266" access="public" mangled="_ZN20xcb_setup_iterator_tC1Ev *INTERNAL* " demangled="xcb_setup_iterator_t::xcb_setup_iterator_t()" location="f0:479" file="f0" line="479" inline="1"/>
  <PointerType id="_2382" type="_543" size="32" align="32"/>
  <PointerType id="_2383" type="_1688" size="32" align="32"/>
  <Field id="_2384" name="instance_name" type="_1590" offset="0" context="_283" access="public" location="f5:407" file="f5" line="407"/>
  <Field id="_2385" name="class_name" type="_1590" offset="32" context="_283" access="public" location="f5:409" file="f5" line="409"/>
  <Field id="_2386" name="_reply" type="_2250" offset="64" context="_283" access="public" location="f5:412" file="f5" line="412"/>
  <Destructor id="_2387" name="._35" artificial="1" throw="" context="_283" access="public" mangled="_ZN30xcb_icccm_get_wm_class_reply_tD1Ev *INTERNAL* " demangled="xcb_icccm_get_wm_class_reply_t::~xcb_icccm_get_wm_class_reply_t()" location="f5:413" file="f5" line="413" endline="413" inline="1">
  </Destructor>
  <OperatorMethod id="_2388" name="=" returns="_5249" artificial="1" throw="" context="_283" access="public" mangled="_ZN30xcb_icccm_get_wm_class_reply_taSERKS_" demangled="xcb_icccm_get_wm_class_reply_t::operator=(xcb_icccm_get_wm_class_reply_t const&amp;)" location="f5:413" file="f5" line="413" endline="413" inline="1">
    <Argument type="_5250" location="f5:405" file="f5" line="405"/>
  </OperatorMethod>
  <Constructor id="_2389" name="._35" artificial="1" throw="" context="_283" access="public" mangled="_ZN30xcb_icccm_get_wm_class_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_icccm_get_wm_class_reply_t::xcb_icccm_get_wm_class_reply_t(xcb_icccm_get_wm_class_reply_t const&amp;)" location="f5:413" file="f5" line="413" endline="413" inline="1">
    <Argument type="_5250" location="f5:405" file="f5" line="405"/>
  </Constructor>
  <Constructor id="_2390" name="._35" artificial="1" throw="" context="_283" access="public" mangled="_ZN30xcb_icccm_get_wm_class_reply_tC1Ev *INTERNAL* " demangled="xcb_icccm_get_wm_class_reply_t::xcb_icccm_get_wm_class_reply_t()" location="f5:413" file="f5" line="413" inline="1"/>
  <PointerType id="_2391" type="_220c" size="32" align="32"/>
  <PointerType id="_2392" type="_1503c" size="32" align="32"/>
  <Field id="_2393" name="major_opcode" type="_1473" offset="0" context="_288" access="public" location="f0:1973" file="f0" line="1973"/>
  <Field id="_2394" name="pad0" type="_1473" offset="8" context="_288" access="public" location="f0:1974" file="f0" line="1974"/>
  <Field id="_2395" name="length" type="_1398" offset="16" context="_288" access="public" location="f0:1975" file="f0" line="1975"/>
  <Field id="_2396" name="selection" type="_1688" offset="32" context="_288" access="public" location="f0:1976" file="f0" line="1976"/>
  <Destructor id="_2397" name="xcb_get_selection_owner_request_t" artificial="1" throw="" context="_288" access="public" mangled="_ZN33xcb_get_selection_owner_request_tD1Ev *INTERNAL* " demangled="xcb_get_selection_owner_request_t::~xcb_get_selection_owner_request_t()" location="f0:1972" file="f0" line="1972" endline="1972" inline="1">
  </Destructor>
  <OperatorMethod id="_2398" name="=" returns="_5253" artificial="1" throw="" context="_288" access="public" mangled="_ZN33xcb_get_selection_owner_request_taSERKS_" demangled="xcb_get_selection_owner_request_t::operator=(xcb_get_selection_owner_request_t const&amp;)" location="f0:1972" file="f0" line="1972" endline="1972" inline="1">
    <Argument type="_5254" location="f0:1972" file="f0" line="1972"/>
  </OperatorMethod>
  <Constructor id="_2399" name="xcb_get_selection_owner_request_t" artificial="1" throw="" context="_288" access="public" mangled="_ZN33xcb_get_selection_owner_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_selection_owner_request_t::xcb_get_selection_owner_request_t(xcb_get_selection_owner_request_t const&amp;)" location="f0:1972" file="f0" line="1972" endline="1972" inline="1">
    <Argument type="_5254" location="f0:1972" file="f0" line="1972"/>
  </Constructor>
  <Constructor id="_2400" name="xcb_get_selection_owner_request_t" artificial="1" throw="" context="_288" access="public" mangled="_ZN33xcb_get_selection_owner_request_tC1Ev *INTERNAL* " demangled="xcb_get_selection_owner_request_t::xcb_get_selection_owner_request_t()" location="f0:1972" file="f0" line="1972" inline="1"/>
  <PointerType id="_2401" type="_349" size="32" align="32"/>
  <Field id="_2402" name="major_opcode" type="_1473" offset="0" context="_292" access="public" location="f0:4273" file="f0" line="4273"/>
  <Field id="_2403" name="pad0" type="_1473" offset="8" context="_292" access="public" location="f0:4274" file="f0" line="4274"/>
  <Field id="_2404" name="length" type="_1398" offset="16" context="_292" access="public" location="f0:4275" file="f0" line="4275"/>
  <Destructor id="_2405" name="xcb_get_keyboard_control_request_t" artificial="1" throw="" context="_292" access="public" mangled="_ZN34xcb_get_keyboard_control_request_tD1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_request_t::~xcb_get_keyboard_control_request_t()" location="f0:4272" file="f0" line="4272" endline="4272" inline="1">
  </Destructor>
  <OperatorMethod id="_2406" name="=" returns="_5255" artificial="1" throw="" context="_292" access="public" mangled="_ZN34xcb_get_keyboard_control_request_taSERKS_" demangled="xcb_get_keyboard_control_request_t::operator=(xcb_get_keyboard_control_request_t const&amp;)" location="f0:4272" file="f0" line="4272" endline="4272" inline="1">
    <Argument type="_5256" location="f0:4272" file="f0" line="4272"/>
  </OperatorMethod>
  <Constructor id="_2407" name="xcb_get_keyboard_control_request_t" artificial="1" throw="" context="_292" access="public" mangled="_ZN34xcb_get_keyboard_control_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_keyboard_control_request_t::xcb_get_keyboard_control_request_t(xcb_get_keyboard_control_request_t const&amp;)" location="f0:4272" file="f0" line="4272" endline="4272" inline="1">
    <Argument type="_5256" location="f0:4272" file="f0" line="4272"/>
  </Constructor>
  <Constructor id="_2408" name="xcb_get_keyboard_control_request_t" artificial="1" throw="" context="_292" access="public" mangled="_ZN34xcb_get_keyboard_control_request_tC1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_request_t::xcb_get_keyboard_control_request_t()" location="f0:4272" file="f0" line="4272" inline="1"/>
  <PointerType id="_2409" type="_1096c" size="32" align="32"/>
  <PointerType id="_2410" type="_683" size="32" align="32"/>
  <PointerType id="_2411" type="_658c" size="32" align="32"/>
  <Field id="_2412" name="major_opcode" type="_1473" offset="0" context="_301" access="public" location="f0:3636" file="f0" line="3636"/>
  <Field id="_2413" name="pad0" type="_1473" offset="8" context="_301" access="public" location="f0:3637" file="f0" line="3637"/>
  <Field id="_2414" name="length" type="_1398" offset="16" context="_301" access="public" location="f0:3638" file="f0" line="3638"/>
  <Field id="_2415" name="cmap" type="_724" offset="32" context="_301" access="public" location="f0:3639" file="f0" line="3639"/>
  <Destructor id="_2416" name="xcb_uninstall_colormap_request_t" artificial="1" throw="" context="_301" access="public" mangled="_ZN32xcb_uninstall_colormap_request_tD1Ev *INTERNAL* " demangled="xcb_uninstall_colormap_request_t::~xcb_uninstall_colormap_request_t()" location="f0:3635" file="f0" line="3635" endline="3635" inline="1">
  </Destructor>
  <OperatorMethod id="_2417" name="=" returns="_5259" artificial="1" throw="" context="_301" access="public" mangled="_ZN32xcb_uninstall_colormap_request_taSERKS_" demangled="xcb_uninstall_colormap_request_t::operator=(xcb_uninstall_colormap_request_t const&amp;)" location="f0:3635" file="f0" line="3635" endline="3635" inline="1">
    <Argument type="_5260" location="f0:3635" file="f0" line="3635"/>
  </OperatorMethod>
  <Constructor id="_2418" name="xcb_uninstall_colormap_request_t" artificial="1" throw="" context="_301" access="public" mangled="_ZN32xcb_uninstall_colormap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_uninstall_colormap_request_t::xcb_uninstall_colormap_request_t(xcb_uninstall_colormap_request_t const&amp;)" location="f0:3635" file="f0" line="3635" endline="3635" inline="1">
    <Argument type="_5260" location="f0:3635" file="f0" line="3635"/>
  </Constructor>
  <Constructor id="_2419" name="xcb_uninstall_colormap_request_t" artificial="1" throw="" context="_301" access="public" mangled="_ZN32xcb_uninstall_colormap_request_tC1Ev *INTERNAL* " demangled="xcb_uninstall_colormap_request_t::xcb_uninstall_colormap_request_t()" location="f0:3635" file="f0" line="3635" inline="1"/>
  <CvQualifiedType id="_2006r" type="_2006" restrict="1"/>
  <PointerType id="_2421" type="_775c" size="32" align="32"/>
  <CvQualifiedType id="_2421r" type="_2421" restrict="1"/>
  <PointerType id="_2423" type="_1759" size="32" align="32"/>
  <PointerType id="_2424" type="_550" size="32" align="32"/>
  <PointerType id="_2425" type="_727" size="32" align="32"/>
  <Field id="_2426" name="major_opcode" type="_1473" offset="0" context="_310" access="public" location="f0:4555" file="f0" line="4555"/>
  <Field id="_2427" name="pad0" type="_1473" offset="8" context="_310" access="public" location="f0:4556" file="f0" line="4556"/>
  <Field id="_2428" name="length" type="_1398" offset="16" context="_310" access="public" location="f0:4557" file="f0" line="4557"/>
  <Field id="_2429" name="window" type="_684" offset="32" context="_310" access="public" location="f0:4558" file="f0" line="4558"/>
  <Field id="_2430" name="atoms_len" type="_1398" offset="64" context="_310" access="public" location="f0:4559" file="f0" line="4559"/>
  <Field id="_2431" name="delta" type="_887" offset="80" context="_310" access="public" location="f0:4560" file="f0" line="4560"/>
  <Destructor id="_2432" name="xcb_rotate_properties_request_t" artificial="1" throw="" context="_310" access="public" mangled="_ZN31xcb_rotate_properties_request_tD1Ev *INTERNAL* " demangled="xcb_rotate_properties_request_t::~xcb_rotate_properties_request_t()" location="f0:4554" file="f0" line="4554" endline="4554" inline="1">
  </Destructor>
  <OperatorMethod id="_2433" name="=" returns="_5262" artificial="1" throw="" context="_310" access="public" mangled="_ZN31xcb_rotate_properties_request_taSERKS_" demangled="xcb_rotate_properties_request_t::operator=(xcb_rotate_properties_request_t const&amp;)" location="f0:4554" file="f0" line="4554" endline="4554" inline="1">
    <Argument type="_5263" location="f0:4554" file="f0" line="4554"/>
  </OperatorMethod>
  <Constructor id="_2434" name="xcb_rotate_properties_request_t" artificial="1" throw="" context="_310" access="public" mangled="_ZN31xcb_rotate_properties_request_tC1ERKS_ *INTERNAL* " demangled="xcb_rotate_properties_request_t::xcb_rotate_properties_request_t(xcb_rotate_properties_request_t const&amp;)" location="f0:4554" file="f0" line="4554" endline="4554" inline="1">
    <Argument type="_5263" location="f0:4554" file="f0" line="4554"/>
  </Constructor>
  <Constructor id="_2435" name="xcb_rotate_properties_request_t" artificial="1" throw="" context="_310" access="public" mangled="_ZN31xcb_rotate_properties_request_tC1Ev *INTERNAL* " demangled="xcb_rotate_properties_request_t::xcb_rotate_properties_request_t()" location="f0:4554" file="f0" line="4554" inline="1"/>
  <PointerType id="_2436" type="_890" size="32" align="32"/>
  <Field id="_2437" name="major_opcode" type="_1473" offset="0" context="_314" access="public" location="f0:2364" file="f0" line="2364"/>
  <Field id="_2438" name="pad0" type="_1473" offset="8" context="_314" access="public" location="f0:2365" file="f0" line="2365"/>
  <Field id="_2439" name="length" type="_1398" offset="16" context="_314" access="public" location="f0:2366" file="f0" line="2366"/>
  <Destructor id="_2440" name="xcb_ungrab_server_request_t" artificial="1" throw="" context="_314" access="public" mangled="_ZN27xcb_ungrab_server_request_tD1Ev *INTERNAL* " demangled="xcb_ungrab_server_request_t::~xcb_ungrab_server_request_t()" location="f0:2363" file="f0" line="2363" endline="2363" inline="1">
  </Destructor>
  <OperatorMethod id="_2441" name="=" returns="_5264" artificial="1" throw="" context="_314" access="public" mangled="_ZN27xcb_ungrab_server_request_taSERKS_" demangled="xcb_ungrab_server_request_t::operator=(xcb_ungrab_server_request_t const&amp;)" location="f0:2363" file="f0" line="2363" endline="2363" inline="1">
    <Argument type="_5265" location="f0:2363" file="f0" line="2363"/>
  </OperatorMethod>
  <Constructor id="_2442" name="xcb_ungrab_server_request_t" artificial="1" throw="" context="_314" access="public" mangled="_ZN27xcb_ungrab_server_request_tC1ERKS_ *INTERNAL* " demangled="xcb_ungrab_server_request_t::xcb_ungrab_server_request_t(xcb_ungrab_server_request_t const&amp;)" location="f0:2363" file="f0" line="2363" endline="2363" inline="1">
    <Argument type="_5265" location="f0:2363" file="f0" line="2363"/>
  </Constructor>
  <Constructor id="_2443" name="xcb_ungrab_server_request_t" artificial="1" throw="" context="_314" access="public" mangled="_ZN27xcb_ungrab_server_request_tC1Ev *INTERNAL* " demangled="xcb_ungrab_server_request_t::xcb_ungrab_server_request_t()" location="f0:2363" file="f0" line="2363" inline="1"/>
  <PointerType id="_2444" type="_1745" size="32" align="32"/>
  <PointerType id="_2445" type="_9c" size="32" align="32"/>
  <ArrayType id="_2446" min="0" max="1u" type="_1590" size="64" align="32"/>
  <Field id="_2447" name="response_type" type="_1473" offset="0" context="_324" access="public" location="f0:838" file="f0" line="838"/>
  <Field id="_2448" name="pad0" type="_1473" offset="8" context="_324" access="public" location="f0:839" file="f0" line="839"/>
  <Field id="_2449" name="sequence" type="_1398" offset="16" context="_324" access="public" location="f0:840" file="f0" line="840"/>
  <Field id="_2450" name="parent" type="_684" offset="32" context="_324" access="public" location="f0:841" file="f0" line="841"/>
  <Field id="_2451" name="window" type="_684" offset="64" context="_324" access="public" location="f0:842" file="f0" line="842"/>
  <Destructor id="_2452" name="xcb_map_request_event_t" artificial="1" throw="" context="_324" access="public" mangled="_ZN23xcb_map_request_event_tD1Ev *INTERNAL* " demangled="xcb_map_request_event_t::~xcb_map_request_event_t()" location="f0:837" file="f0" line="837" endline="837" inline="1">
  </Destructor>
  <OperatorMethod id="_2453" name="=" returns="_5267" artificial="1" throw="" context="_324" access="public" mangled="_ZN23xcb_map_request_event_taSERKS_" demangled="xcb_map_request_event_t::operator=(xcb_map_request_event_t const&amp;)" location="f0:837" file="f0" line="837" endline="837" inline="1">
    <Argument type="_5268" location="f0:837" file="f0" line="837"/>
  </OperatorMethod>
  <Constructor id="_2454" name="xcb_map_request_event_t" artificial="1" throw="" context="_324" access="public" mangled="_ZN23xcb_map_request_event_tC1ERKS_ *INTERNAL* " demangled="xcb_map_request_event_t::xcb_map_request_event_t(xcb_map_request_event_t const&amp;)" location="f0:837" file="f0" line="837" endline="837" inline="1">
    <Argument type="_5268" location="f0:837" file="f0" line="837"/>
  </Constructor>
  <Constructor id="_2455" name="xcb_map_request_event_t" artificial="1" throw="" context="_324" access="public" mangled="_ZN23xcb_map_request_event_tC1Ev *INTERNAL* " demangled="xcb_map_request_event_t::xcb_map_request_event_t()" location="f0:837" file="f0" line="837" inline="1"/>
  <Field id="_2456" name="sequence" type="_100" offset="0" context="_326" access="public" location="f0:1483" file="f0" line="1483"/>
  <Destructor id="_2457" name="xcb_get_window_attributes_cookie_t" artificial="1" throw="" context="_326" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_window_attributes_cookie_t::~xcb_get_window_attributes_cookie_t()" location="f0:1482" file="f0" line="1482" endline="1482" inline="1">
  </Destructor>
  <OperatorMethod id="_2458" name="=" returns="_5269" artificial="1" throw="" context="_326" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_taSERKS_" demangled="xcb_get_window_attributes_cookie_t::operator=(xcb_get_window_attributes_cookie_t const&amp;)" location="f0:1482" file="f0" line="1482" endline="1482" inline="1">
    <Argument type="_5270" location="f0:1482" file="f0" line="1482"/>
  </OperatorMethod>
  <Constructor id="_2459" name="xcb_get_window_attributes_cookie_t" artificial="1" throw="" context="_326" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_window_attributes_cookie_t::xcb_get_window_attributes_cookie_t(xcb_get_window_attributes_cookie_t const&amp;)" location="f0:1482" file="f0" line="1482" endline="1482" inline="1">
    <Argument type="_5270" location="f0:1482" file="f0" line="1482"/>
  </Constructor>
  <Constructor id="_2460" name="xcb_get_window_attributes_cookie_t" artificial="1" throw="" context="_326" access="public" mangled="_ZN34xcb_get_window_attributes_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_window_attributes_cookie_t::xcb_get_window_attributes_cookie_t()" location="f0:1482" file="f0" line="1482" inline="1"/>
  <Field id="_2461" name="data8" type="_5271" offset="0" context="_338" access="public" location="f0:1152" file="f0" line="1152"/>
  <Field id="_2462" name="data16" type="_5272" offset="0" context="_338" access="public" location="f0:1153" file="f0" line="1153"/>
  <Field id="_2463" name="data32" type="_5273" offset="0" context="_338" access="public" location="f0:1154" file="f0" line="1154"/>
  <Destructor id="_2464" name="xcb_client_message_data_t" artificial="1" throw="" context="_338" access="public" mangled="_ZN25xcb_client_message_data_tD1Ev *INTERNAL* " demangled="xcb_client_message_data_t::~xcb_client_message_data_t()" location="f0:1151" file="f0" line="1151" endline="1151" inline="1">
  </Destructor>
  <OperatorMethod id="_2465" name="=" returns="_5274" artificial="1" throw="" context="_338" access="public" mangled="_ZN25xcb_client_message_data_taSERKS_" demangled="xcb_client_message_data_t::operator=(xcb_client_message_data_t const&amp;)" location="f0:1151" file="f0" line="1151" endline="1151" inline="1">
    <Argument type="_5275" location="f0:1151" file="f0" line="1151"/>
  </OperatorMethod>
  <Constructor id="_2466" name="xcb_client_message_data_t" artificial="1" throw="" context="_338" access="public" mangled="_ZN25xcb_client_message_data_tC1ERKS_ *INTERNAL* " demangled="xcb_client_message_data_t::xcb_client_message_data_t(xcb_client_message_data_t const&amp;)" location="f0:1151" file="f0" line="1151" endline="1151" inline="1">
    <Argument type="_5275" location="f0:1151" file="f0" line="1151"/>
  </Constructor>
  <Constructor id="_2467" name="xcb_client_message_data_t" artificial="1" throw="" context="_338" access="public" mangled="_ZN25xcb_client_message_data_tC1Ev *INTERNAL* " demangled="xcb_client_message_data_t::xcb_client_message_data_t()" location="f0:1151" file="f0" line="1151" inline="1"/>
  <Field id="_2468" name="response_type" type="_1473" offset="0" context="_341" access="public" location="f0:1902" file="f0" line="1902"/>
  <Field id="_2469" name="format" type="_1473" offset="8" context="_341" access="public" location="f0:1903" file="f0" line="1903"/>
  <Field id="_2470" name="sequence" type="_1398" offset="16" context="_341" access="public" location="f0:1904" file="f0" line="1904"/>
  <Field id="_2471" name="length" type="_705" offset="32" context="_341" access="public" location="f0:1905" file="f0" line="1905"/>
  <Field id="_2472" name="type" type="_1688" offset="64" context="_341" access="public" location="f0:1906" file="f0" line="1906"/>
  <Field id="_2473" name="bytes_after" type="_705" offset="96" context="_341" access="public" location="f0:1907" file="f0" line="1907"/>
  <Field id="_2474" name="value_len" type="_705" offset="128" context="_341" access="public" location="f0:1908" file="f0" line="1908"/>
  <Field id="_2475" name="pad0" type="_5276" offset="160" context="_341" access="public" location="f0:1909" file="f0" line="1909"/>
  <Destructor id="_2476" name="xcb_get_property_reply_t" artificial="1" throw="" context="_341" access="public" mangled="_ZN24xcb_get_property_reply_tD1Ev *INTERNAL* " demangled="xcb_get_property_reply_t::~xcb_get_property_reply_t()" location="f0:1901" file="f0" line="1901" endline="1901" inline="1">
  </Destructor>
  <OperatorMethod id="_2477" name="=" returns="_5277" artificial="1" throw="" context="_341" access="public" mangled="_ZN24xcb_get_property_reply_taSERKS_" demangled="xcb_get_property_reply_t::operator=(xcb_get_property_reply_t const&amp;)" location="f0:1901" file="f0" line="1901" endline="1901" inline="1">
    <Argument type="_5278" location="f0:1901" file="f0" line="1901"/>
  </OperatorMethod>
  <Constructor id="_2478" name="xcb_get_property_reply_t" artificial="1" throw="" context="_341" access="public" mangled="_ZN24xcb_get_property_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_property_reply_t::xcb_get_property_reply_t(xcb_get_property_reply_t const&amp;)" location="f0:1901" file="f0" line="1901" endline="1901" inline="1">
    <Argument type="_5278" location="f0:1901" file="f0" line="1901"/>
  </Constructor>
  <Constructor id="_2479" name="xcb_get_property_reply_t" artificial="1" throw="" context="_341" access="public" mangled="_ZN24xcb_get_property_reply_tC1Ev *INTERNAL* " demangled="xcb_get_property_reply_t::xcb_get_property_reply_t()" location="f0:1901" file="f0" line="1901" inline="1"/>
  <Field id="_2480" name="sequence" type="_100" offset="0" context="_344" access="public" location="f0:4263" file="f0" line="4263"/>
  <Destructor id="_2481" name="xcb_get_keyboard_control_cookie_t" artificial="1" throw="" context="_344" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_cookie_t::~xcb_get_keyboard_control_cookie_t()" location="f0:4262" file="f0" line="4262" endline="4262" inline="1">
  </Destructor>
  <OperatorMethod id="_2482" name="=" returns="_5279" artificial="1" throw="" context="_344" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_taSERKS_" demangled="xcb_get_keyboard_control_cookie_t::operator=(xcb_get_keyboard_control_cookie_t const&amp;)" location="f0:4262" file="f0" line="4262" endline="4262" inline="1">
    <Argument type="_5280" location="f0:4262" file="f0" line="4262"/>
  </OperatorMethod>
  <Constructor id="_2483" name="xcb_get_keyboard_control_cookie_t" artificial="1" throw="" context="_344" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_keyboard_control_cookie_t::xcb_get_keyboard_control_cookie_t(xcb_get_keyboard_control_cookie_t const&amp;)" location="f0:4262" file="f0" line="4262" endline="4262" inline="1">
    <Argument type="_5280" location="f0:4262" file="f0" line="4262"/>
  </Constructor>
  <Constructor id="_2484" name="xcb_get_keyboard_control_cookie_t" artificial="1" throw="" context="_344" access="public" mangled="_ZN33xcb_get_keyboard_control_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_keyboard_control_cookie_t::xcb_get_keyboard_control_cookie_t()" location="f0:4262" file="f0" line="4262" inline="1"/>
  <Field id="_2485" name="__size" type="_5155" offset="0" context="_349" access="public" location="f9:122" file="f9" line="122"/>
  <Field id="_2486" name="__align" type="_188" offset="0" context="_349" access="public" location="f9:123" file="f9" line="123"/>
  <Destructor id="_2487" name="._5" artificial="1" throw="" context="_349" access="public" mangled="_ZN19pthread_mutexattr_tD1Ev *INTERNAL* " demangled="pthread_mutexattr_t::~pthread_mutexattr_t()" location="f9:124" file="f9" line="124" endline="124" inline="1">
  </Destructor>
  <OperatorMethod id="_2488" name="=" returns="_5281" artificial="1" throw="" context="_349" access="public" mangled="_ZN19pthread_mutexattr_taSERKS_" demangled="pthread_mutexattr_t::operator=(pthread_mutexattr_t const&amp;)" location="f9:124" file="f9" line="124" endline="124" inline="1">
    <Argument type="_5282" location="f9:121" file="f9" line="121"/>
  </OperatorMethod>
  <Constructor id="_2489" name="._5" artificial="1" throw="" context="_349" access="public" mangled="_ZN19pthread_mutexattr_tC1ERKS_ *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t(pthread_mutexattr_t const&amp;)" location="f9:124" file="f9" line="124" endline="124" inline="1">
    <Argument type="_5282" location="f9:121" file="f9" line="121"/>
  </Constructor>
  <Constructor id="_2490" name="._5" artificial="1" throw="" context="_349" access="public" mangled="_ZN19pthread_mutexattr_tC1Ev *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t()" location="f9:124" file="f9" line="124" inline="1"/>
  <PointerType id="_2491" type="_103" size="32" align="32"/>
  <Field id="_2492" name="response_type" type="_1473" offset="0" context="_354" access="public" location="f0:954" file="f0" line="954"/>
  <Field id="_2493" name="pad0" type="_1473" offset="8" context="_354" access="public" location="f0:955" file="f0" line="955"/>
  <Field id="_2494" name="sequence" type="_1398" offset="16" context="_354" access="public" location="f0:956" file="f0" line="956"/>
  <Field id="_2495" name="event" type="_684" offset="32" context="_354" access="public" location="f0:957" file="f0" line="957"/>
  <Field id="_2496" name="window" type="_684" offset="64" context="_354" access="public" location="f0:958" file="f0" line="958"/>
  <Field id="_2497" name="pad1" type="_5283" offset="96" context="_354" access="public" location="f0:959" file="f0" line="959"/>
  <Field id="_2498" name="place" type="_1473" offset="128" context="_354" access="public" location="f0:960" file="f0" line="960"/>
  <Field id="_2499" name="pad2" type="_5171" offset="136" context="_354" access="public" location="f0:961" file="f0" line="961"/>
  <Destructor id="_2500" name="xcb_circulate_notify_event_t" artificial="1" throw="" context="_354" access="public" mangled="_ZN28xcb_circulate_notify_event_tD1Ev *INTERNAL* " demangled="xcb_circulate_notify_event_t::~xcb_circulate_notify_event_t()" location="f0:953" file="f0" line="953" endline="953" inline="1">
  </Destructor>
  <OperatorMethod id="_2501" name="=" returns="_5284" artificial="1" throw="" context="_354" access="public" mangled="_ZN28xcb_circulate_notify_event_taSERKS_" demangled="xcb_circulate_notify_event_t::operator=(xcb_circulate_notify_event_t const&amp;)" location="f0:953" file="f0" line="953" endline="953" inline="1">
    <Argument type="_5285" location="f0:953" file="f0" line="953"/>
  </OperatorMethod>
  <Constructor id="_2502" name="xcb_circulate_notify_event_t" artificial="1" throw="" context="_354" access="public" mangled="_ZN28xcb_circulate_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_circulate_notify_event_t::xcb_circulate_notify_event_t(xcb_circulate_notify_event_t const&amp;)" location="f0:953" file="f0" line="953" endline="953" inline="1">
    <Argument type="_5285" location="f0:953" file="f0" line="953"/>
  </Constructor>
  <Constructor id="_2503" name="xcb_circulate_notify_event_t" artificial="1" throw="" context="_354" access="public" mangled="_ZN28xcb_circulate_notify_event_tC1Ev *INTERNAL* " demangled="xcb_circulate_notify_event_t::xcb_circulate_notify_event_t()" location="f0:953" file="f0" line="953" inline="1"/>
  <Field id="_2504" name="response_type" type="_1473" offset="0" context="_356" access="public" location="f0:594" file="f0" line="594"/>
  <Field id="_2505" name="detail" type="_1473" offset="8" context="_356" access="public" location="f0:595" file="f0" line="595"/>
  <Field id="_2506" name="sequence" type="_1398" offset="16" context="_356" access="public" location="f0:596" file="f0" line="596"/>
  <Field id="_2507" name="time" type="_1254" offset="32" context="_356" access="public" location="f0:597" file="f0" line="597"/>
  <Field id="_2508" name="root" type="_684" offset="64" context="_356" access="public" location="f0:598" file="f0" line="598"/>
  <Field id="_2509" name="event" type="_684" offset="96" context="_356" access="public" location="f0:599" file="f0" line="599"/>
  <Field id="_2510" name="child" type="_684" offset="128" context="_356" access="public" location="f0:600" file="f0" line="600"/>
  <Field id="_2511" name="root_x" type="_887" offset="160" context="_356" access="public" location="f0:601" file="f0" line="601"/>
  <Field id="_2512" name="root_y" type="_887" offset="176" context="_356" access="public" location="f0:602" file="f0" line="602"/>
  <Field id="_2513" name="event_x" type="_887" offset="192" context="_356" access="public" location="f0:603" file="f0" line="603"/>
  <Field id="_2514" name="event_y" type="_887" offset="208" context="_356" access="public" location="f0:604" file="f0" line="604"/>
  <Field id="_2515" name="state" type="_1398" offset="224" context="_356" access="public" location="f0:605" file="f0" line="605"/>
  <Field id="_2516" name="same_screen" type="_1473" offset="240" context="_356" access="public" location="f0:606" file="f0" line="606"/>
  <Field id="_2517" name="pad0" type="_1473" offset="248" context="_356" access="public" location="f0:607" file="f0" line="607"/>
  <Destructor id="_2518" name="xcb_motion_notify_event_t" artificial="1" throw="" context="_356" access="public" mangled="_ZN25xcb_motion_notify_event_tD1Ev *INTERNAL* " demangled="xcb_motion_notify_event_t::~xcb_motion_notify_event_t()" location="f0:593" file="f0" line="593" endline="593" inline="1">
  </Destructor>
  <OperatorMethod id="_2519" name="=" returns="_5286" artificial="1" throw="" context="_356" access="public" mangled="_ZN25xcb_motion_notify_event_taSERKS_" demangled="xcb_motion_notify_event_t::operator=(xcb_motion_notify_event_t const&amp;)" location="f0:593" file="f0" line="593" endline="593" inline="1">
    <Argument type="_5287" location="f0:593" file="f0" line="593"/>
  </OperatorMethod>
  <Constructor id="_2520" name="xcb_motion_notify_event_t" artificial="1" throw="" context="_356" access="public" mangled="_ZN25xcb_motion_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_motion_notify_event_t::xcb_motion_notify_event_t(xcb_motion_notify_event_t const&amp;)" location="f0:593" file="f0" line="593" endline="593" inline="1">
    <Argument type="_5287" location="f0:593" file="f0" line="593"/>
  </Constructor>
  <Constructor id="_2521" name="xcb_motion_notify_event_t" artificial="1" throw="" context="_356" access="public" mangled="_ZN25xcb_motion_notify_event_tC1Ev *INTERNAL* " demangled="xcb_motion_notify_event_t::xcb_motion_notify_event_t()" location="f0:593" file="f0" line="593" inline="1"/>
  <PointerType id="_2522" type="_1235" size="32" align="32"/>
  <PointerType id="_2523" type="_385" size="32" align="32"/>
  <PointerType id="_2524" type="_675" size="32" align="32"/>
  <Field id="_2525" name="fds_bits" type="_5288" offset="0" context="_366" access="public" location="f12:69" file="f12" line="69"/>
  <Destructor id="_2526" name="._2" artificial="1" throw="" context="_366" access="public" mangled="_ZN6fd_setD1Ev *INTERNAL* " demangled="fd_set::~fd_set()" location="f12:75" file="f12" line="75" endline="75" inline="1">
  </Destructor>
  <OperatorMethod id="_2527" name="=" returns="_5289" artificial="1" throw="" context="_366" access="public" mangled="_ZN6fd_setaSERKS_" demangled="fd_set::operator=(fd_set const&amp;)" location="f12:75" file="f12" line="75" endline="75" inline="1">
    <Argument type="_5290" location="f12:65" file="f12" line="65"/>
  </OperatorMethod>
  <Constructor id="_2528" name="._2" artificial="1" throw="" context="_366" access="public" mangled="_ZN6fd_setC1ERKS_ *INTERNAL* " demangled="fd_set::fd_set(fd_set const&amp;)" location="f12:75" file="f12" line="75" endline="75" inline="1">
    <Argument type="_5290" location="f12:65" file="f12" line="65"/>
  </Constructor>
  <Constructor id="_2529" name="._2" artificial="1" throw="" context="_366" access="public" mangled="_ZN6fd_setC1Ev *INTERNAL* " demangled="fd_set::fd_set()" location="f12:75" file="f12" line="75" inline="1"/>
  <Field id="_2530" name="__data" type="_2533" offset="0" context="_368" access="public" location="f9:115" file="f9" line="115"/>
  <Field id="_2531" name="__size" type="_5291" offset="0" context="_368" access="public" location="f9:116" file="f9" line="116"/>
  <Field id="_2532" name="__align" type="_31" offset="0" context="_368" access="public" location="f9:117" file="f9" line="117"/>
  <Struct id="_2533" name="__pthread_mutex_s" context="_368" access="public" mangled="N15pthread_mutex_t17__pthread_mutex_sE" demangled="pthread_mutex_t::__pthread_mutex_s" location="f9:93" file="f9" line="93" artificial="1" size="192" align="32" members="_5292 _5293 _5294 _5295 _5296 _5297 _5298 _5299 _5300 _5301 _5302 " bases=""/>
  <Destructor id="_2534" name="._3" artificial="1" throw="" context="_368" access="public" mangled="_ZN15pthread_mutex_tD1Ev *INTERNAL* " demangled="pthread_mutex_t::~pthread_mutex_t()" location="f9:118" file="f9" line="118" endline="118" inline="1">
  </Destructor>
  <OperatorMethod id="_2535" name="=" returns="_5303" artificial="1" throw="" context="_368" access="public" mangled="_ZN15pthread_mutex_taSERKS_" demangled="pthread_mutex_t::operator=(pthread_mutex_t const&amp;)" location="f9:118" file="f9" line="118" endline="118" inline="1">
    <Argument type="_5304" location="f9:91" file="f9" line="91"/>
  </OperatorMethod>
  <Constructor id="_2536" name="._3" artificial="1" throw="" context="_368" access="public" mangled="_ZN15pthread_mutex_tC1ERKS_ *INTERNAL* " demangled="pthread_mutex_t::pthread_mutex_t(pthread_mutex_t const&amp;)" location="f9:118" file="f9" line="118" endline="118" inline="1">
    <Argument type="_5304" location="f9:91" file="f9" line="91"/>
  </Constructor>
  <Constructor id="_2537" name="._3" artificial="1" throw="" context="_368" access="public" mangled="_ZN15pthread_mutex_tC1Ev *INTERNAL* " demangled="pthread_mutex_t::pthread_mutex_t()" location="f9:118" file="f9" line="118" inline="1"/>
  <PointerType id="_2538" type="_218" size="32" align="32"/>
  <Field id="_2539" name="sequence" type="_100" offset="0" context="_372" access="public" location="f0:3920" file="f0" line="3920"/>
  <Destructor id="_2540" name="xcb_query_colors_cookie_t" artificial="1" throw="" context="_372" access="public" mangled="_ZN25xcb_query_colors_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_colors_cookie_t::~xcb_query_colors_cookie_t()" location="f0:3919" file="f0" line="3919" endline="3919" inline="1">
  </Destructor>
  <OperatorMethod id="_2541" name="=" returns="_5305" artificial="1" throw="" context="_372" access="public" mangled="_ZN25xcb_query_colors_cookie_taSERKS_" demangled="xcb_query_colors_cookie_t::operator=(xcb_query_colors_cookie_t const&amp;)" location="f0:3919" file="f0" line="3919" endline="3919" inline="1">
    <Argument type="_5306" location="f0:3919" file="f0" line="3919"/>
  </OperatorMethod>
  <Constructor id="_2542" name="xcb_query_colors_cookie_t" artificial="1" throw="" context="_372" access="public" mangled="_ZN25xcb_query_colors_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_colors_cookie_t::xcb_query_colors_cookie_t(xcb_query_colors_cookie_t const&amp;)" location="f0:3919" file="f0" line="3919" endline="3919" inline="1">
    <Argument type="_5306" location="f0:3919" file="f0" line="3919"/>
  </Constructor>
  <Constructor id="_2543" name="xcb_query_colors_cookie_t" artificial="1" throw="" context="_372" access="public" mangled="_ZN25xcb_query_colors_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_colors_cookie_t::xcb_query_colors_cookie_t()" location="f0:3919" file="f0" line="3919" inline="1"/>
  <PointerType id="_2544" type="_197" size="32" align="32"/>
  <PointerType id="_2545" type="_181c" size="32" align="32"/>
  <Field id="_2546" name="sequence" type="_100" offset="0" context="_382" access="public" location="f0:1878" file="f0" line="1878"/>
  <Destructor id="_2547" name="xcb_get_property_cookie_t" artificial="1" throw="" context="_382" access="public" mangled="_ZN25xcb_get_property_cookie_tD1Ev *INTERNAL* " demangled="xcb_get_property_cookie_t::~xcb_get_property_cookie_t()" location="f0:1877" file="f0" line="1877" endline="1877" inline="1">
  </Destructor>
  <OperatorMethod id="_2548" name="=" returns="_5308" artificial="1" throw="" context="_382" access="public" mangled="_ZN25xcb_get_property_cookie_taSERKS_" demangled="xcb_get_property_cookie_t::operator=(xcb_get_property_cookie_t const&amp;)" location="f0:1877" file="f0" line="1877" endline="1877" inline="1">
    <Argument type="_5309" location="f0:1877" file="f0" line="1877"/>
  </OperatorMethod>
  <Constructor id="_2549" name="xcb_get_property_cookie_t" artificial="1" throw="" context="_382" access="public" mangled="_ZN25xcb_get_property_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_get_property_cookie_t::xcb_get_property_cookie_t(xcb_get_property_cookie_t const&amp;)" location="f0:1877" file="f0" line="1877" endline="1877" inline="1">
    <Argument type="_5309" location="f0:1877" file="f0" line="1877"/>
  </Constructor>
  <Constructor id="_2550" name="xcb_get_property_cookie_t" artificial="1" throw="" context="_382" access="public" mangled="_ZN25xcb_get_property_cookie_tC1Ev *INTERNAL* " demangled="xcb_get_property_cookie_t::xcb_get_property_cookie_t()" location="f0:1877" file="f0" line="1877" inline="1"/>
  <Field id="_2551" name="__data" type="_2554" offset="0" context="_385" access="public" location="f9:200" file="f9" line="200"/>
  <Field id="_2552" name="__size" type="_5310" offset="0" context="_385" access="public" location="f9:202" file="f9" line="202"/>
  <Field id="_2553" name="__align" type="_31" offset="0" context="_385" access="public" location="f9:203" file="f9" line="203"/>
  <Struct id="_2554" context="_385" access="public" mangled="N16pthread_rwlock_t4._10E" demangled="pthread_rwlock_t::._10" location="f9:186" file="f9" line="186" artificial="1" size="256" align="32" members="_5311 _5312 _5313 _5314 _5315 _5316 _5317 _5318 _5319 _5320 _5321 _5322 _5323 _5324 _5325 " bases=""/>
  <Destructor id="_2555" name="._9" artificial="1" throw="" context="_385" access="public" mangled="_ZN16pthread_rwlock_tD1Ev *INTERNAL* " demangled="pthread_rwlock_t::~pthread_rwlock_t()" location="f9:204" file="f9" line="204" endline="204" inline="1">
  </Destructor>
  <OperatorMethod id="_2556" name="=" returns="_5326" artificial="1" throw="" context="_385" access="public" mangled="_ZN16pthread_rwlock_taSERKS_" demangled="pthread_rwlock_t::operator=(pthread_rwlock_t const&amp;)" location="f9:204" file="f9" line="204" endline="204" inline="1">
    <Argument type="_5327" location="f9:165" file="f9" line="165"/>
  </OperatorMethod>
  <Constructor id="_2557" name="._9" artificial="1" throw="" context="_385" access="public" mangled="_ZN16pthread_rwlock_tC1ERKS_ *INTERNAL* " demangled="pthread_rwlock_t::pthread_rwlock_t(pthread_rwlock_t const&amp;)" location="f9:204" file="f9" line="204" endline="204" inline="1">
    <Argument type="_5327" location="f9:165" file="f9" line="165"/>
  </Constructor>
  <Constructor id="_2558" name="._9" artificial="1" throw="" context="_385" access="public" mangled="_ZN16pthread_rwlock_tC1Ev *INTERNAL* " demangled="pthread_rwlock_t::pthread_rwlock_t()" location="f9:204" file="f9" line="204" inline="1"/>
  <Field id="_2559" name="major_opcode" type="_1473" offset="0" context="_386" access="public" location="f0:3174" file="f0" line="3174"/>
  <Field id="_2560" name="pad0" type="_1473" offset="8" context="_386" access="public" location="f0:3175" file="f0" line="3175"/>
  <Field id="_2561" name="length" type="_1398" offset="16" context="_386" access="public" location="f0:3176" file="f0" line="3176"/>
  <Field id="_2562" name="src_gc" type="_1801" offset="32" context="_386" access="public" location="f0:3177" file="f0" line="3177"/>
  <Field id="_2563" name="dst_gc" type="_1801" offset="64" context="_386" access="public" location="f0:3178" file="f0" line="3178"/>
  <Field id="_2564" name="value_mask" type="_705" offset="96" context="_386" access="public" location="f0:3179" file="f0" line="3179"/>
  <Destructor id="_2565" name="xcb_copy_gc_request_t" artificial="1" throw="" context="_386" access="public" mangled="_ZN21xcb_copy_gc_request_tD1Ev *INTERNAL* " demangled="xcb_copy_gc_request_t::~xcb_copy_gc_request_t()" location="f0:3173" file="f0" line="3173" endline="3173" inline="1">
  </Destructor>
  <OperatorMethod id="_2566" name="=" returns="_5328" artificial="1" throw="" context="_386" access="public" mangled="_ZN21xcb_copy_gc_request_taSERKS_" demangled="xcb_copy_gc_request_t::operator=(xcb_copy_gc_request_t const&amp;)" location="f0:3173" file="f0" line="3173" endline="3173" inline="1">
    <Argument type="_5329" location="f0:3173" file="f0" line="3173"/>
  </OperatorMethod>
  <Constructor id="_2567" name="xcb_copy_gc_request_t" artificial="1" throw="" context="_386" access="public" mangled="_ZN21xcb_copy_gc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_copy_gc_request_t::xcb_copy_gc_request_t(xcb_copy_gc_request_t const&amp;)" location="f0:3173" file="f0" line="3173" endline="3173" inline="1">
    <Argument type="_5329" location="f0:3173" file="f0" line="3173"/>
  </Constructor>
  <Constructor id="_2568" name="xcb_copy_gc_request_t" artificial="1" throw="" context="_386" access="public" mangled="_ZN21xcb_copy_gc_request_tC1Ev *INTERNAL* " demangled="xcb_copy_gc_request_t::xcb_copy_gc_request_t()" location="f0:3173" file="f0" line="3173" inline="1"/>
  <Field id="_2569" name="iov_base" type="_507" offset="0" context="_389" access="public" location="f17:45" file="f17" line="45"/>
  <Field id="_2570" name="iov_len" type="_1192" offset="32" context="_389" access="public" location="f17:46" file="f17" line="46"/>
  <Destructor id="_2571" name="iovec" artificial="1" throw="" context="_389" access="public" mangled="_ZN5iovecD1Ev *INTERNAL* " demangled="iovec::~iovec()" location="f17:44" file="f17" line="44" endline="44" inline="1">
  </Destructor>
  <OperatorMethod id="_2572" name="=" returns="_5330" artificial="1" throw="" context="_389" access="public" mangled="_ZN5iovecaSERKS_" demangled="iovec::operator=(iovec const&amp;)" location="f17:44" file="f17" line="44" endline="44" inline="1">
    <Argument type="_5331" location="f17:44" file="f17" line="44"/>
  </OperatorMethod>
  <Constructor id="_2573" name="iovec" artificial="1" throw="" context="_389" access="public" mangled="_ZN5iovecC1ERKS_ *INTERNAL* " demangled="iovec::iovec(iovec const&amp;)" location="f17:44" file="f17" line="44" endline="44" inline="1">
    <Argument type="_5331" location="f17:44" file="f17" line="44"/>
  </Constructor>
  <Constructor id="_2574" name="iovec" artificial="1" throw="" context="_389" access="public" mangled="_ZN5iovecC1Ev *INTERNAL* " demangled="iovec::iovec()" location="f17:44" file="f17" line="44" inline="1"/>
  <Field id="_2575" name="major_opcode" type="_1473" offset="0" context="_390" access="public" location="f0:4161" file="f0" line="4161"/>
  <Field id="_2576" name="pad0" type="_1473" offset="8" context="_390" access="public" location="f0:4162" file="f0" line="4162"/>
  <Field id="_2577" name="length" type="_1398" offset="16" context="_390" access="public" location="f0:4163" file="f0" line="4163"/>
  <Destructor id="_2578" name="xcb_list_extensions_request_t" artificial="1" throw="" context="_390" access="public" mangled="_ZN29xcb_list_extensions_request_tD1Ev *INTERNAL* " demangled="xcb_list_extensions_request_t::~xcb_list_extensions_request_t()" location="f0:4160" file="f0" line="4160" endline="4160" inline="1">
  </Destructor>
  <OperatorMethod id="_2579" name="=" returns="_5332" artificial="1" throw="" context="_390" access="public" mangled="_ZN29xcb_list_extensions_request_taSERKS_" demangled="xcb_list_extensions_request_t::operator=(xcb_list_extensions_request_t const&amp;)" location="f0:4160" file="f0" line="4160" endline="4160" inline="1">
    <Argument type="_5333" location="f0:4160" file="f0" line="4160"/>
  </OperatorMethod>
  <Constructor id="_2580" name="xcb_list_extensions_request_t" artificial="1" throw="" context="_390" access="public" mangled="_ZN29xcb_list_extensions_request_tC1ERKS_ *INTERNAL* " demangled="xcb_list_extensions_request_t::xcb_list_extensions_request_t(xcb_list_extensions_request_t const&amp;)" location="f0:4160" file="f0" line="4160" endline="4160" inline="1">
    <Argument type="_5333" location="f0:4160" file="f0" line="4160"/>
  </Constructor>
  <Constructor id="_2581" name="xcb_list_extensions_request_t" artificial="1" throw="" context="_390" access="public" mangled="_ZN29xcb_list_extensions_request_tC1Ev *INTERNAL* " demangled="xcb_list_extensions_request_t::xcb_list_extensions_request_t()" location="f0:4160" file="f0" line="4160" inline="1"/>
  <CvQualifiedType id="_2251r" type="_2251" restrict="1"/>
  <PointerType id="_2583" type="_651c" size="32" align="32"/>
  <CvQualifiedType id="_2583r" type="_2583" restrict="1"/>
  <Field id="_2585" name="depth" type="_1473" offset="0" context="_393" access="public" location="f0:304" file="f0" line="304"/>
  <Field id="_2586" name="pad0" type="_1473" offset="8" context="_393" access="public" location="f0:305" file="f0" line="305"/>
  <Field id="_2587" name="visuals_len" type="_1398" offset="16" context="_393" access="public" location="f0:306" file="f0" line="306"/>
  <Field id="_2588" name="pad1" type="_5283" offset="32" context="_393" access="public" location="f0:307" file="f0" line="307"/>
  <Destructor id="_2589" name="xcb_depth_t" artificial="1" throw="" context="_393" access="public" mangled="_ZN11xcb_depth_tD1Ev *INTERNAL* " demangled="xcb_depth_t::~xcb_depth_t()" location="f0:303" file="f0" line="303" endline="303" inline="1">
  </Destructor>
  <OperatorMethod id="_2590" name="=" returns="_5335" artificial="1" throw="" context="_393" access="public" mangled="_ZN11xcb_depth_taSERKS_" demangled="xcb_depth_t::operator=(xcb_depth_t const&amp;)" location="f0:303" file="f0" line="303" endline="303" inline="1">
    <Argument type="_5336" location="f0:303" file="f0" line="303"/>
  </OperatorMethod>
  <Constructor id="_2591" name="xcb_depth_t" artificial="1" throw="" context="_393" access="public" mangled="_ZN11xcb_depth_tC1ERKS_ *INTERNAL* " demangled="xcb_depth_t::xcb_depth_t(xcb_depth_t const&amp;)" location="f0:303" file="f0" line="303" endline="303" inline="1">
    <Argument type="_5336" location="f0:303" file="f0" line="303"/>
  </Constructor>
  <Constructor id="_2592" name="xcb_depth_t" artificial="1" throw="" context="_393" access="public" mangled="_ZN11xcb_depth_tC1Ev *INTERNAL* " demangled="xcb_depth_t::xcb_depth_t()" location="f0:303" file="f0" line="303" inline="1"/>
  <Field id="_2593" name="__locales" type="_5337" offset="0" context="_395" access="public" location="f19:30" file="f19" line="30"/>
  <Field id="_2594" name="__ctype_b" type="_5338" offset="416" context="_395" access="public" location="f19:33" file="f19" line="33"/>
  <Field id="_2595" name="__ctype_tolower" type="_5339" offset="448" context="_395" access="public" location="f19:34" file="f19" line="34"/>
  <Field id="_2596" name="__ctype_toupper" type="_5339" offset="480" context="_395" access="public" location="f19:35" file="f19" line="35"/>
  <Field id="_2597" name="__names" type="_5340" offset="512" context="_395" access="public" location="f19:38" file="f19" line="38"/>
  <Destructor id="_2598" name="__locale_struct" artificial="1" throw="" context="_395" access="public" mangled="_ZN15__locale_structD1Ev *INTERNAL* " demangled="__locale_struct::~__locale_struct()" location="f19:28" file="f19" line="28" endline="28" inline="1">
  </Destructor>
  <OperatorMethod id="_2599" name="=" returns="_5341" artificial="1" throw="" context="_395" access="public" mangled="_ZN15__locale_structaSERKS_" demangled="__locale_struct::operator=(__locale_struct const&amp;)" location="f19:28" file="f19" line="28" endline="28" inline="1">
    <Argument type="_5342" location="f19:28" file="f19" line="28"/>
  </OperatorMethod>
  <Constructor id="_2600" name="__locale_struct" artificial="1" throw="" context="_395" access="public" mangled="_ZN15__locale_structC1ERKS_ *INTERNAL* " demangled="__locale_struct::__locale_struct(__locale_struct const&amp;)" location="f19:28" file="f19" line="28" endline="28" inline="1">
    <Argument type="_5342" location="f19:28" file="f19" line="28"/>
  </Constructor>
  <Constructor id="_2601" name="__locale_struct" artificial="1" throw="" context="_395" access="public" mangled="_ZN15__locale_structC1Ev *INTERNAL* " demangled="__locale_struct::__locale_struct()" location="f19:28" file="f19" line="28" inline="1"/>
  <PointerType id="_2602" type="_911" size="32" align="32"/>
  <PointerType id="_2603" type="_1048c" size="32" align="32"/>
  <Field id="_2604" name="response_type" type="_1473" offset="0" context="_403" access="public" location="f0:981" file="f0" line="981"/>
  <Field id="_2605" name="pad0" type="_1473" offset="8" context="_403" access="public" location="f0:982" file="f0" line="982"/>
  <Field id="_2606" name="sequence" type="_1398" offset="16" context="_403" access="public" location="f0:983" file="f0" line="983"/>
  <Field id="_2607" name="window" type="_684" offset="32" context="_403" access="public" location="f0:984" file="f0" line="984"/>
  <Field id="_2608" name="atom" type="_1688" offset="64" context="_403" access="public" location="f0:985" file="f0" line="985"/>
  <Field id="_2609" name="time" type="_1254" offset="96" context="_403" access="public" location="f0:986" file="f0" line="986"/>
  <Field id="_2610" name="state" type="_1473" offset="128" context="_403" access="public" location="f0:987" file="f0" line="987"/>
  <Field id="_2611" name="pad1" type="_5171" offset="136" context="_403" access="public" location="f0:988" file="f0" line="988"/>
  <Destructor id="_2612" name="xcb_property_notify_event_t" artificial="1" throw="" context="_403" access="public" mangled="_ZN27xcb_property_notify_event_tD1Ev *INTERNAL* " demangled="xcb_property_notify_event_t::~xcb_property_notify_event_t()" location="f0:980" file="f0" line="980" endline="980" inline="1">
  </Destructor>
  <OperatorMethod id="_2613" name="=" returns="_5344" artificial="1" throw="" context="_403" access="public" mangled="_ZN27xcb_property_notify_event_taSERKS_" demangled="xcb_property_notify_event_t::operator=(xcb_property_notify_event_t const&amp;)" location="f0:980" file="f0" line="980" endline="980" inline="1">
    <Argument type="_5345" location="f0:980" file="f0" line="980"/>
  </OperatorMethod>
  <Constructor id="_2614" name="xcb_property_notify_event_t" artificial="1" throw="" context="_403" access="public" mangled="_ZN27xcb_property_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_property_notify_event_t::xcb_property_notify_event_t(xcb_property_notify_event_t const&amp;)" location="f0:980" file="f0" line="980" endline="980" inline="1">
    <Argument type="_5345" location="f0:980" file="f0" line="980"/>
  </Constructor>
  <Constructor id="_2615" name="xcb_property_notify_event_t" artificial="1" throw="" context="_403" access="public" mangled="_ZN27xcb_property_notify_event_tC1Ev *INTERNAL* " demangled="xcb_property_notify_event_t::xcb_property_notify_event_t()" location="f0:980" file="f0" line="980" inline="1"/>
  <CvQualifiedType id="_1928r" type="_1928" restrict="1"/>
  <CvQualifiedType id="_2358r" type="_2358" restrict="1"/>
  <PointerType id="_2618" type="_775" size="32" align="32"/>
  <PointerType id="_2619" type="_787c" size="32" align="32"/>
  <Field id="_2620" name="response_type" type="_1473" offset="0" context="_416" access="public" location="f0:561" file="f0" line="561"/>
  <Field id="_2621" name="detail" type="_596" offset="8" context="_416" access="public" location="f0:562" file="f0" line="562"/>
  <Field id="_2622" name="sequence" type="_1398" offset="16" context="_416" access="public" location="f0:563" file="f0" line="563"/>
  <Field id="_2623" name="time" type="_1254" offset="32" context="_416" access="public" location="f0:564" file="f0" line="564"/>
  <Field id="_2624" name="root" type="_684" offset="64" context="_416" access="public" location="f0:565" file="f0" line="565"/>
  <Field id="_2625" name="event" type="_684" offset="96" context="_416" access="public" location="f0:566" file="f0" line="566"/>
  <Field id="_2626" name="child" type="_684" offset="128" context="_416" access="public" location="f0:567" file="f0" line="567"/>
  <Field id="_2627" name="root_x" type="_887" offset="160" context="_416" access="public" location="f0:568" file="f0" line="568"/>
  <Field id="_2628" name="root_y" type="_887" offset="176" context="_416" access="public" location="f0:569" file="f0" line="569"/>
  <Field id="_2629" name="event_x" type="_887" offset="192" context="_416" access="public" location="f0:570" file="f0" line="570"/>
  <Field id="_2630" name="event_y" type="_887" offset="208" context="_416" access="public" location="f0:571" file="f0" line="571"/>
  <Field id="_2631" name="state" type="_1398" offset="224" context="_416" access="public" location="f0:572" file="f0" line="572"/>
  <Field id="_2632" name="same_screen" type="_1473" offset="240" context="_416" access="public" location="f0:573" file="f0" line="573"/>
  <Field id="_2633" name="pad0" type="_1473" offset="248" context="_416" access="public" location="f0:574" file="f0" line="574"/>
  <Destructor id="_2634" name="xcb_button_press_event_t" artificial="1" throw="" context="_416" access="public" mangled="_ZN24xcb_button_press_event_tD1Ev *INTERNAL* " demangled="xcb_button_press_event_t::~xcb_button_press_event_t()" location="f0:560" file="f0" line="560" endline="560" inline="1">
  </Destructor>
  <OperatorMethod id="_2635" name="=" returns="_5347" artificial="1" throw="" context="_416" access="public" mangled="_ZN24xcb_button_press_event_taSERKS_" demangled="xcb_button_press_event_t::operator=(xcb_button_press_event_t const&amp;)" location="f0:560" file="f0" line="560" endline="560" inline="1">
    <Argument type="_5348" location="f0:560" file="f0" line="560"/>
  </OperatorMethod>
  <Constructor id="_2636" name="xcb_button_press_event_t" artificial="1" throw="" context="_416" access="public" mangled="_ZN24xcb_button_press_event_tC1ERKS_ *INTERNAL* " demangled="xcb_button_press_event_t::xcb_button_press_event_t(xcb_button_press_event_t const&amp;)" location="f0:560" file="f0" line="560" endline="560" inline="1">
    <Argument type="_5348" location="f0:560" file="f0" line="560"/>
  </Constructor>
  <Constructor id="_2637" name="xcb_button_press_event_t" artificial="1" throw="" context="_416" access="public" mangled="_ZN24xcb_button_press_event_tC1Ev *INTERNAL* " demangled="xcb_button_press_event_t::xcb_button_press_event_t()" location="f0:560" file="f0" line="560" inline="1"/>
  <PointerType id="_2638" type="_865c" size="32" align="32"/>
  <CvQualifiedType id="_2638r" type="_2638" restrict="1"/>
  <PointerType id="_2640" type="_1828" size="32" align="32"/>
  <PointerType id="_2641" type="_1501" size="32" align="32"/>
  <PointerType id="_2642" type="_5350" size="32" align="32"/>
  <Field id="_2643" name="left_side_bearing" type="_887" offset="0" context="_431" access="public" location="f0:2661" file="f0" line="2661"/>
  <Field id="_2644" name="right_side_bearing" type="_887" offset="16" context="_431" access="public" location="f0:2662" file="f0" line="2662"/>
  <Field id="_2645" name="character_width" type="_887" offset="32" context="_431" access="public" location="f0:2663" file="f0" line="2663"/>
  <Field id="_2646" name="ascent" type="_887" offset="48" context="_431" access="public" location="f0:2664" file="f0" line="2664"/>
  <Field id="_2647" name="descent" type="_887" offset="64" context="_431" access="public" location="f0:2665" file="f0" line="2665"/>
  <Field id="_2648" name="attributes" type="_1398" offset="80" context="_431" access="public" location="f0:2666" file="f0" line="2666"/>
  <Destructor id="_2649" name="xcb_charinfo_t" artificial="1" throw="" context="_431" access="public" mangled="_ZN14xcb_charinfo_tD1Ev *INTERNAL* " demangled="xcb_charinfo_t::~xcb_charinfo_t()" location="f0:2660" file="f0" line="2660" endline="2660" inline="1">
  </Destructor>
  <OperatorMethod id="_2650" name="=" returns="_5351" artificial="1" throw="" context="_431" access="public" mangled="_ZN14xcb_charinfo_taSERKS_" demangled="xcb_charinfo_t::operator=(xcb_charinfo_t const&amp;)" location="f0:2660" file="f0" line="2660" endline="2660" inline="1">
    <Argument type="_5352" location="f0:2660" file="f0" line="2660"/>
  </OperatorMethod>
  <Constructor id="_2651" name="xcb_charinfo_t" artificial="1" throw="" context="_431" access="public" mangled="_ZN14xcb_charinfo_tC1ERKS_ *INTERNAL* " demangled="xcb_charinfo_t::xcb_charinfo_t(xcb_charinfo_t const&amp;)" location="f0:2660" file="f0" line="2660" endline="2660" inline="1">
    <Argument type="_5352" location="f0:2660" file="f0" line="2660"/>
  </Constructor>
  <Constructor id="_2652" name="xcb_charinfo_t" artificial="1" throw="" context="_431" access="public" mangled="_ZN14xcb_charinfo_tC1Ev *INTERNAL* " demangled="xcb_charinfo_t::xcb_charinfo_t()" location="f0:2660" file="f0" line="2660" inline="1"/>
  <Field id="_2653" name="major_opcode" type="_1473" offset="0" context="_434" access="public" location="f0:4629" file="f0" line="4629"/>
  <Field id="_2654" name="pad0" type="_1473" offset="8" context="_434" access="public" location="f0:4630" file="f0" line="4630"/>
  <Field id="_2655" name="length" type="_1398" offset="16" context="_434" access="public" location="f0:4631" file="f0" line="4631"/>
  <Destructor id="_2656" name="xcb_get_pointer_mapping_request_t" artificial="1" throw="" context="_434" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_tD1Ev *INTERNAL* " demangled="xcb_get_pointer_mapping_request_t::~xcb_get_pointer_mapping_request_t()" location="f0:4628" file="f0" line="4628" endline="4628" inline="1">
  </Destructor>
  <OperatorMethod id="_2657" name="=" returns="_5353" artificial="1" throw="" context="_434" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_taSERKS_" demangled="xcb_get_pointer_mapping_request_t::operator=(xcb_get_pointer_mapping_request_t const&amp;)" location="f0:4628" file="f0" line="4628" endline="4628" inline="1">
    <Argument type="_5354" location="f0:4628" file="f0" line="4628"/>
  </OperatorMethod>
  <Constructor id="_2658" name="xcb_get_pointer_mapping_request_t" artificial="1" throw="" context="_434" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_tC1ERKS_ *INTERNAL* " demangled="xcb_get_pointer_mapping_request_t::xcb_get_pointer_mapping_request_t(xcb_get_pointer_mapping_request_t const&amp;)" location="f0:4628" file="f0" line="4628" endline="4628" inline="1">
    <Argument type="_5354" location="f0:4628" file="f0" line="4628"/>
  </Constructor>
  <Constructor id="_2659" name="xcb_get_pointer_mapping_request_t" artificial="1" throw="" context="_434" access="public" mangled="_ZN33xcb_get_pointer_mapping_request_tC1Ev *INTERNAL* " demangled="xcb_get_pointer_mapping_request_t::xcb_get_pointer_mapping_request_t()" location="f0:4628" file="f0" line="4628" inline="1"/>
  <Field id="_2660" name="response_type" type="_1473" offset="0" context="_436" access="public" location="f0:2702" file="f0" line="2702"/>
  <Field id="_2661" name="pad0" type="_1473" offset="8" context="_436" access="public" location="f0:2703" file="f0" line="2703"/>
  <Field id="_2662" name="sequence" type="_1398" offset="16" context="_436" access="public" location="f0:2704" file="f0" line="2704"/>
  <Field id="_2663" name="length" type="_705" offset="32" context="_436" access="public" location="f0:2705" file="f0" line="2705"/>
  <Field id="_2664" name="min_bounds" type="_432" offset="64" context="_436" access="public" location="f0:2706" file="f0" line="2706"/>
  <Field id="_2665" name="pad1" type="_5283" offset="160" context="_436" access="public" location="f0:2707" file="f0" line="2707"/>
  <Field id="_2666" name="max_bounds" type="_432" offset="192" context="_436" access="public" location="f0:2708" file="f0" line="2708"/>
  <Field id="_2667" name="pad2" type="_5283" offset="288" context="_436" access="public" location="f0:2709" file="f0" line="2709"/>
  <Field id="_2668" name="min_char_or_byte2" type="_1398" offset="320" context="_436" access="public" location="f0:2710" file="f0" line="2710"/>
  <Field id="_2669" name="max_char_or_byte2" type="_1398" offset="336" context="_436" access="public" location="f0:2711" file="f0" line="2711"/>
  <Field id="_2670" name="default_char" type="_1398" offset="352" context="_436" access="public" location="f0:2712" file="f0" line="2712"/>
  <Field id="_2671" name="properties_len" type="_1398" offset="368" context="_436" access="public" location="f0:2713" file="f0" line="2713"/>
  <Field id="_2672" name="draw_direction" type="_1473" offset="384" context="_436" access="public" location="f0:2714" file="f0" line="2714"/>
  <Field id="_2673" name="min_byte1" type="_1473" offset="392" context="_436" access="public" location="f0:2715" file="f0" line="2715"/>
  <Field id="_2674" name="max_byte1" type="_1473" offset="400" context="_436" access="public" location="f0:2716" file="f0" line="2716"/>
  <Field id="_2675" name="all_chars_exist" type="_1473" offset="408" context="_436" access="public" location="f0:2717" file="f0" line="2717"/>
  <Field id="_2676" name="font_ascent" type="_887" offset="416" context="_436" access="public" location="f0:2718" file="f0" line="2718"/>
  <Field id="_2677" name="font_descent" type="_887" offset="432" context="_436" access="public" location="f0:2719" file="f0" line="2719"/>
  <Field id="_2678" name="char_infos_len" type="_705" offset="448" context="_436" access="public" location="f0:2720" file="f0" line="2720"/>
  <Destructor id="_2679" name="xcb_query_font_reply_t" artificial="1" throw="" context="_436" access="public" mangled="_ZN22xcb_query_font_reply_tD1Ev *INTERNAL* " demangled="xcb_query_font_reply_t::~xcb_query_font_reply_t()" location="f0:2701" file="f0" line="2701" endline="2701" inline="1">
  </Destructor>
  <OperatorMethod id="_2680" name="=" returns="_5355" artificial="1" throw="" context="_436" access="public" mangled="_ZN22xcb_query_font_reply_taSERKS_" demangled="xcb_query_font_reply_t::operator=(xcb_query_font_reply_t const&amp;)" location="f0:2701" file="f0" line="2701" endline="2701" inline="1">
    <Argument type="_5356" location="f0:2701" file="f0" line="2701"/>
  </OperatorMethod>
  <Constructor id="_2681" name="xcb_query_font_reply_t" artificial="1" throw="" context="_436" access="public" mangled="_ZN22xcb_query_font_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_font_reply_t::xcb_query_font_reply_t(xcb_query_font_reply_t const&amp;)" location="f0:2701" file="f0" line="2701" endline="2701" inline="1">
    <Argument type="_5356" location="f0:2701" file="f0" line="2701"/>
  </Constructor>
  <Constructor id="_2682" name="xcb_query_font_reply_t" artificial="1" throw="" context="_436" access="public" mangled="_ZN22xcb_query_font_reply_tC1Ev *INTERNAL* " demangled="xcb_query_font_reply_t::xcb_query_font_reply_t()" location="f0:2701" file="f0" line="2701" inline="1"/>
  <PointerType id="_2683" type="_1080" size="32" align="32"/>
  <Field id="_2684" name="major_opcode" type="_1473" offset="0" context="_446" access="public" location="f0:1604" file="f0" line="1604"/>
  <Field id="_2685" name="pad0" type="_1473" offset="8" context="_446" access="public" location="f0:1605" file="f0" line="1605"/>
  <Field id="_2686" name="length" type="_1398" offset="16" context="_446" access="public" location="f0:1606" file="f0" line="1606"/>
  <Field id="_2687" name="window" type="_684" offset="32" context="_446" access="public" location="f0:1607" file="f0" line="1607"/>
  <Destructor id="_2688" name="xcb_map_subwindows_request_t" artificial="1" throw="" context="_446" access="public" mangled="_ZN28xcb_map_subwindows_request_tD1Ev *INTERNAL* " demangled="xcb_map_subwindows_request_t::~xcb_map_subwindows_request_t()" location="f0:1603" file="f0" line="1603" endline="1603" inline="1">
  </Destructor>
  <OperatorMethod id="_2689" name="=" returns="_5357" artificial="1" throw="" context="_446" access="public" mangled="_ZN28xcb_map_subwindows_request_taSERKS_" demangled="xcb_map_subwindows_request_t::operator=(xcb_map_subwindows_request_t const&amp;)" location="f0:1603" file="f0" line="1603" endline="1603" inline="1">
    <Argument type="_5358" location="f0:1603" file="f0" line="1603"/>
  </OperatorMethod>
  <Constructor id="_2690" name="xcb_map_subwindows_request_t" artificial="1" throw="" context="_446" access="public" mangled="_ZN28xcb_map_subwindows_request_tC1ERKS_ *INTERNAL* " demangled="xcb_map_subwindows_request_t::xcb_map_subwindows_request_t(xcb_map_subwindows_request_t const&amp;)" location="f0:1603" file="f0" line="1603" endline="1603" inline="1">
    <Argument type="_5358" location="f0:1603" file="f0" line="1603"/>
  </Constructor>
  <Constructor id="_2691" name="xcb_map_subwindows_request_t" artificial="1" throw="" context="_446" access="public" mangled="_ZN28xcb_map_subwindows_request_tC1Ev *INTERNAL* " demangled="xcb_map_subwindows_request_t::xcb_map_subwindows_request_t()" location="f0:1603" file="f0" line="1603" inline="1"/>
  <Field id="_2692" name="major_opcode" type="_1473" offset="0" context="_449" access="public" location="f0:1863" file="f0" line="1863"/>
  <Field id="_2693" name="pad0" type="_1473" offset="8" context="_449" access="public" location="f0:1864" file="f0" line="1864"/>
  <Field id="_2694" name="length" type="_1398" offset="16" context="_449" access="public" location="f0:1865" file="f0" line="1865"/>
  <Field id="_2695" name="window" type="_684" offset="32" context="_449" access="public" location="f0:1866" file="f0" line="1866"/>
  <Field id="_2696" name="property" type="_1688" offset="64" context="_449" access="public" location="f0:1867" file="f0" line="1867"/>
  <Destructor id="_2697" name="xcb_delete_property_request_t" artificial="1" throw="" context="_449" access="public" mangled="_ZN29xcb_delete_property_request_tD1Ev *INTERNAL* " demangled="xcb_delete_property_request_t::~xcb_delete_property_request_t()" location="f0:1862" file="f0" line="1862" endline="1862" inline="1">
  </Destructor>
  <OperatorMethod id="_2698" name="=" returns="_5359" artificial="1" throw="" context="_449" access="public" mangled="_ZN29xcb_delete_property_request_taSERKS_" demangled="xcb_delete_property_request_t::operator=(xcb_delete_property_request_t const&amp;)" location="f0:1862" file="f0" line="1862" endline="1862" inline="1">
    <Argument type="_5360" location="f0:1862" file="f0" line="1862"/>
  </OperatorMethod>
  <Constructor id="_2699" name="xcb_delete_property_request_t" artificial="1" throw="" context="_449" access="public" mangled="_ZN29xcb_delete_property_request_tC1ERKS_ *INTERNAL* " demangled="xcb_delete_property_request_t::xcb_delete_property_request_t(xcb_delete_property_request_t const&amp;)" location="f0:1862" file="f0" line="1862" endline="1862" inline="1">
    <Argument type="_5360" location="f0:1862" file="f0" line="1862"/>
  </Constructor>
  <Constructor id="_2700" name="xcb_delete_property_request_t" artificial="1" throw="" context="_449" access="public" mangled="_ZN29xcb_delete_property_request_tC1Ev *INTERNAL* " demangled="xcb_delete_property_request_t::xcb_delete_property_request_t()" location="f0:1862" file="f0" line="1862" inline="1"/>
  <PointerType id="_2701" type="_1244" size="32" align="32"/>
  <Field id="_2702" name="data" type="_5361" offset="0" context="_459" access="public" location="f0:314" file="f0" line="314"/>
  <Field id="_2703" name="rem" type="_188" offset="32" context="_459" access="public" location="f0:315" file="f0" line="315"/>
  <Field id="_2704" name="index" type="_188" offset="64" context="_459" access="public" location="f0:316" file="f0" line="316"/>
  <Destructor id="_2705" name="xcb_depth_iterator_t" artificial="1" throw="" context="_459" access="public" mangled="_ZN20xcb_depth_iterator_tD1Ev *INTERNAL* " demangled="xcb_depth_iterator_t::~xcb_depth_iterator_t()" location="f0:313" file="f0" line="313" endline="313" inline="1">
  </Destructor>
  <OperatorMethod id="_2706" name="=" returns="_5362" artificial="1" throw="" context="_459" access="public" mangled="_ZN20xcb_depth_iterator_taSERKS_" demangled="xcb_depth_iterator_t::operator=(xcb_depth_iterator_t const&amp;)" location="f0:313" file="f0" line="313" endline="313" inline="1">
    <Argument type="_5363" location="f0:313" file="f0" line="313"/>
  </OperatorMethod>
  <Constructor id="_2707" name="xcb_depth_iterator_t" artificial="1" throw="" context="_459" access="public" mangled="_ZN20xcb_depth_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_depth_iterator_t::xcb_depth_iterator_t(xcb_depth_iterator_t const&amp;)" location="f0:313" file="f0" line="313" endline="313" inline="1">
    <Argument type="_5363" location="f0:313" file="f0" line="313"/>
  </Constructor>
  <Constructor id="_2708" name="xcb_depth_iterator_t" artificial="1" throw="" context="_459" access="public" mangled="_ZN20xcb_depth_iterator_tC1Ev *INTERNAL* " demangled="xcb_depth_iterator_t::xcb_depth_iterator_t()" location="f0:313" file="f0" line="313" inline="1"/>
  <Field id="_2709" name="major_opcode" type="_1473" offset="0" context="_463" access="public" location="f0:3512" file="f0" line="3512"/>
  <Field id="_2710" name="pad0" type="_1473" offset="8" context="_463" access="public" location="f0:3513" file="f0" line="3513"/>
  <Field id="_2711" name="length" type="_1398" offset="16" context="_463" access="public" location="f0:3514" file="f0" line="3514"/>
  <Field id="_2712" name="drawable" type="_882" offset="32" context="_463" access="public" location="f0:3515" file="f0" line="3515"/>
  <Field id="_2713" name="gc" type="_1801" offset="64" context="_463" access="public" location="f0:3516" file="f0" line="3516"/>
  <Field id="_2714" name="x" type="_887" offset="96" context="_463" access="public" location="f0:3517" file="f0" line="3517"/>
  <Field id="_2715" name="y" type="_887" offset="112" context="_463" access="public" location="f0:3518" file="f0" line="3518"/>
  <Destructor id="_2716" name="xcb_poly_text_8_request_t" artificial="1" throw="" context="_463" access="public" mangled="_ZN25xcb_poly_text_8_request_tD1Ev *INTERNAL* " demangled="xcb_poly_text_8_request_t::~xcb_poly_text_8_request_t()" location="f0:3511" file="f0" line="3511" endline="3511" inline="1">
  </Destructor>
  <OperatorMethod id="_2717" name="=" returns="_5364" artificial="1" throw="" context="_463" access="public" mangled="_ZN25xcb_poly_text_8_request_taSERKS_" demangled="xcb_poly_text_8_request_t::operator=(xcb_poly_text_8_request_t const&amp;)" location="f0:3511" file="f0" line="3511" endline="3511" inline="1">
    <Argument type="_5365" location="f0:3511" file="f0" line="3511"/>
  </OperatorMethod>
  <Constructor id="_2718" name="xcb_poly_text_8_request_t" artificial="1" throw="" context="_463" access="public" mangled="_ZN25xcb_poly_text_8_request_tC1ERKS_ *INTERNAL* " demangled="xcb_poly_text_8_request_t::xcb_poly_text_8_request_t(xcb_poly_text_8_request_t const&amp;)" location="f0:3511" file="f0" line="3511" endline="3511" inline="1">
    <Argument type="_5365" location="f0:3511" file="f0" line="3511"/>
  </Constructor>
  <Constructor id="_2719" name="xcb_poly_text_8_request_t" artificial="1" throw="" context="_463" access="public" mangled="_ZN25xcb_poly_text_8_request_tC1Ev *INTERNAL* " demangled="xcb_poly_text_8_request_t::xcb_poly_text_8_request_t()" location="f0:3511" file="f0" line="3511" inline="1"/>
  <PointerType id="_2720" type="_1088" size="32" align="32"/>
  <CvQualifiedType id="_2545r" type="_2545" restrict="1"/>
  <CvQualifiedType id="_1590r" type="_1590" restrict="1"/>
  <CvQualifiedType id="_188v" type="_188" volatile="1"/>
  <PointerType id="_2724" type="_1583" size="32" align="32"/>
  <PointerType id="_2725" type="_1742" size="32" align="32"/>
  <PointerType id="_2726" type="_103c" size="32" align="32"/>
  <Field id="_2727" name="response_type" type="_1473" offset="0" context="_477" access="public" location="f0:1173" file="f0" line="1173"/>
  <Field id="_2728" name="format" type="_1473" offset="8" context="_477" access="public" location="f0:1174" file="f0" line="1174"/>
  <Field id="_2729" name="sequence" type="_1398" offset="16" context="_477" access="public" location="f0:1175" file="f0" line="1175"/>
  <Field id="_2730" name="window" type="_684" offset="32" context="_477" access="public" location="f0:1176" file="f0" line="1176"/>
  <Field id="_2731" name="type" type="_1688" offset="64" context="_477" access="public" location="f0:1177" file="f0" line="1177"/>
  <Field id="_2732" name="data" type="_339" offset="96" context="_477" access="public" location="f0:1178" file="f0" line="1178"/>
  <Destructor id="_2733" name="xcb_client_message_event_t" artificial="1" throw="" context="_477" access="public" mangled="_ZN26xcb_client_message_event_tD1Ev *INTERNAL* " demangled="xcb_client_message_event_t::~xcb_client_message_event_t()" location="f0:1172" file="f0" line="1172" endline="1172" inline="1">
  </Destructor>
  <OperatorMethod id="_2734" name="=" returns="_5367" artificial="1" throw="" context="_477" access="public" mangled="_ZN26xcb_client_message_event_taSERKS_" demangled="xcb_client_message_event_t::operator=(xcb_client_message_event_t const&amp;)" location="f0:1172" file="f0" line="1172" endline="1172" inline="1">
    <Argument type="_5368" location="f0:1172" file="f0" line="1172"/>
  </OperatorMethod>
  <Constructor id="_2735" name="xcb_client_message_event_t" artificial="1" throw="" context="_477" access="public" mangled="_ZN26xcb_client_message_event_tC1ERKS_ *INTERNAL* " demangled="xcb_client_message_event_t::xcb_client_message_event_t(xcb_client_message_event_t const&amp;)" location="f0:1172" file="f0" line="1172" endline="1172" inline="1">
    <Argument type="_5368" location="f0:1172" file="f0" line="1172"/>
  </Constructor>
  <Constructor id="_2736" name="xcb_client_message_event_t" artificial="1" throw="" context="_477" access="public" mangled="_ZN26xcb_client_message_event_tC1Ev *INTERNAL* " demangled="xcb_client_message_event_t::xcb_client_message_event_t()" location="f0:1172" file="f0" line="1172" inline="1"/>
  <Field id="_2737" name="major_opcode" type="_1473" offset="0" context="_479" access="public" location="f0:4314" file="f0" line="4314"/>
  <Field id="_2738" name="pad0" type="_1473" offset="8" context="_479" access="public" location="f0:4315" file="f0" line="4315"/>
  <Field id="_2739" name="length" type="_1398" offset="16" context="_479" access="public" location="f0:4316" file="f0" line="4316"/>
  <Field id="_2740" name="acceleration_numerator" type="_887" offset="32" context="_479" access="public" location="f0:4317" file="f0" line="4317"/>
  <Field id="_2741" name="acceleration_denominator" type="_887" offset="48" context="_479" access="public" location="f0:4318" file="f0" line="4318"/>
  <Field id="_2742" name="threshold" type="_887" offset="64" context="_479" access="public" location="f0:4319" file="f0" line="4319"/>
  <Field id="_2743" name="do_acceleration" type="_1473" offset="80" context="_479" access="public" location="f0:4320" file="f0" line="4320"/>
  <Field id="_2744" name="do_threshold" type="_1473" offset="88" context="_479" access="public" location="f0:4321" file="f0" line="4321"/>
  <Destructor id="_2745" name="xcb_change_pointer_control_request_t" artificial="1" throw="" context="_479" access="public" mangled="_ZN36xcb_change_pointer_control_request_tD1Ev *INTERNAL* " demangled="xcb_change_pointer_control_request_t::~xcb_change_pointer_control_request_t()" location="f0:4313" file="f0" line="4313" endline="4313" inline="1">
  </Destructor>
  <OperatorMethod id="_2746" name="=" returns="_5369" artificial="1" throw="" context="_479" access="public" mangled="_ZN36xcb_change_pointer_control_request_taSERKS_" demangled="xcb_change_pointer_control_request_t::operator=(xcb_change_pointer_control_request_t const&amp;)" location="f0:4313" file="f0" line="4313" endline="4313" inline="1">
    <Argument type="_5370" location="f0:4313" file="f0" line="4313"/>
  </OperatorMethod>
  <Constructor id="_2747" name="xcb_change_pointer_control_request_t" artificial="1" throw="" context="_479" access="public" mangled="_ZN36xcb_change_pointer_control_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_pointer_control_request_t::xcb_change_pointer_control_request_t(xcb_change_pointer_control_request_t const&amp;)" location="f0:4313" file="f0" line="4313" endline="4313" inline="1">
    <Argument type="_5370" location="f0:4313" file="f0" line="4313"/>
  </Constructor>
  <Constructor id="_2748" name="xcb_change_pointer_control_request_t" artificial="1" throw="" context="_479" access="public" mangled="_ZN36xcb_change_pointer_control_request_tC1Ev *INTERNAL* " demangled="xcb_change_pointer_control_request_t::xcb_change_pointer_control_request_t()" location="f0:4313" file="f0" line="4313" inline="1"/>
  <Field id="_2749" name="response_type" type="_1473" offset="0" context="_488" access="public" location="f0:4347" file="f0" line="4347"/>
  <Field id="_2750" name="pad0" type="_1473" offset="8" context="_488" access="public" location="f0:4348" file="f0" line="4348"/>
  <Field id="_2751" name="sequence" type="_1398" offset="16" context="_488" access="public" location="f0:4349" file="f0" line="4349"/>
  <Field id="_2752" name="length" type="_705" offset="32" context="_488" access="public" location="f0:4350" file="f0" line="4350"/>
  <Field id="_2753" name="acceleration_numerator" type="_1398" offset="64" context="_488" access="public" location="f0:4351" file="f0" line="4351"/>
  <Field id="_2754" name="acceleration_denominator" type="_1398" offset="80" context="_488" access="public" location="f0:4352" file="f0" line="4352"/>
  <Field id="_2755" name="threshold" type="_1398" offset="96" context="_488" access="public" location="f0:4353" file="f0" line="4353"/>
  <Field id="_2756" name="pad1" type="_5371" offset="112" context="_488" access="public" location="f0:4354" file="f0" line="4354"/>
  <Destructor id="_2757" name="xcb_get_pointer_control_reply_t" artificial="1" throw="" context="_488" access="public" mangled="_ZN31xcb_get_pointer_control_reply_tD1Ev *INTERNAL* " demangled="xcb_get_pointer_control_reply_t::~xcb_get_pointer_control_reply_t()" location="f0:4346" file="f0" line="4346" endline="4346" inline="1">
  </Destructor>
  <OperatorMethod id="_2758" name="=" returns="_5372" artificial="1" throw="" context="_488" access="public" mangled="_ZN31xcb_get_pointer_control_reply_taSERKS_" demangled="xcb_get_pointer_control_reply_t::operator=(xcb_get_pointer_control_reply_t const&amp;)" location="f0:4346" file="f0" line="4346" endline="4346" inline="1">
    <Argument type="_5373" location="f0:4346" file="f0" line="4346"/>
  </OperatorMethod>
  <Constructor id="_2759" name="xcb_get_pointer_control_reply_t" artificial="1" throw="" context="_488" access="public" mangled="_ZN31xcb_get_pointer_control_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_pointer_control_reply_t::xcb_get_pointer_control_reply_t(xcb_get_pointer_control_reply_t const&amp;)" location="f0:4346" file="f0" line="4346" endline="4346" inline="1">
    <Argument type="_5373" location="f0:4346" file="f0" line="4346"/>
  </Constructor>
  <Constructor id="_2760" name="xcb_get_pointer_control_reply_t" artificial="1" throw="" context="_488" access="public" mangled="_ZN31xcb_get_pointer_control_reply_tC1Ev *INTERNAL* " demangled="xcb_get_pointer_control_reply_t::xcb_get_pointer_control_reply_t()" location="f0:4346" file="f0" line="4346" inline="1"/>
  <Field id="_2761" name="__cancel_routine" type="_2642" offset="0" context="_491" access="public" location="f3:533" file="f3" line="533"/>
  <Field id="_2762" name="__cancel_arg" type="_507" offset="32" context="_491" access="public" location="f3:534" file="f3" line="534"/>
  <Field id="_2763" name="__do_it" type="_188" offset="64" context="_491" access="public" location="f3:535" file="f3" line="535"/>
  <Field id="_2764" name="__cancel_type" type="_188" offset="96" context="_491" access="public" location="f3:536" file="f3" line="536"/>
  <Destructor id="_2765" name="__pthread_cleanup_frame" artificial="1" throw="" context="_491" access="public" mangled="_ZN23__pthread_cleanup_frameD1Ev *INTERNAL* " demangled="__pthread_cleanup_frame::~__pthread_cleanup_frame()" location="f3:532" file="f3" line="532" endline="532" inline="1">
  </Destructor>
  <OperatorMethod id="_2766" name="=" returns="_5374" artificial="1" throw="" context="_491" access="public" mangled="_ZN23__pthread_cleanup_frameaSERKS_" demangled="__pthread_cleanup_frame::operator=(__pthread_cleanup_frame const&amp;)" location="f3:532" file="f3" line="532" endline="532" inline="1">
    <Argument type="_5375" location="f3:532" file="f3" line="532"/>
  </OperatorMethod>
  <Constructor id="_2767" name="__pthread_cleanup_frame" artificial="1" throw="" context="_491" access="public" mangled="_ZN23__pthread_cleanup_frameC1ERKS_ *INTERNAL* " demangled="__pthread_cleanup_frame::__pthread_cleanup_frame(__pthread_cleanup_frame const&amp;)" location="f3:532" file="f3" line="532" endline="532" inline="1">
    <Argument type="_5375" location="f3:532" file="f3" line="532"/>
  </Constructor>
  <Constructor id="_2768" name="__pthread_cleanup_frame" artificial="1" throw="" context="_491" access="public" mangled="_ZN23__pthread_cleanup_frameC1Ev *INTERNAL* " demangled="__pthread_cleanup_frame::__pthread_cleanup_frame()" location="f3:532" file="f3" line="532" inline="1"/>
  <Field id="_2769" name="response_type" type="_1473" offset="0" context="_495" access="public" location="f0:1983" file="f0" line="1983"/>
  <Field id="_2770" name="pad0" type="_1473" offset="8" context="_495" access="public" location="f0:1984" file="f0" line="1984"/>
  <Field id="_2771" name="sequence" type="_1398" offset="16" context="_495" access="public" location="f0:1985" file="f0" line="1985"/>
  <Field id="_2772" name="length" type="_705" offset="32" context="_495" access="public" location="f0:1986" file="f0" line="1986"/>
  <Field id="_2773" name="owner" type="_684" offset="64" context="_495" access="public" location="f0:1987" file="f0" line="1987"/>
  <Destructor id="_2774" name="xcb_get_selection_owner_reply_t" artificial="1" throw="" context="_495" access="public" mangled="_ZN31xcb_get_selection_owner_reply_tD1Ev *INTERNAL* " demangled="xcb_get_selection_owner_reply_t::~xcb_get_selection_owner_reply_t()" location="f0:1982" file="f0" line="1982" endline="1982" inline="1">
  </Destructor>
  <OperatorMethod id="_2775" name="=" returns="_5376" artificial="1" throw="" context="_495" access="public" mangled="_ZN31xcb_get_selection_owner_reply_taSERKS_" demangled="xcb_get_selection_owner_reply_t::operator=(xcb_get_selection_owner_reply_t const&amp;)" location="f0:1982" file="f0" line="1982" endline="1982" inline="1">
    <Argument type="_5377" location="f0:1982" file="f0" line="1982"/>
  </OperatorMethod>
  <Constructor id="_2776" name="xcb_get_selection_owner_reply_t" artificial="1" throw="" context="_495" access="public" mangled="_ZN31xcb_get_selection_owner_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_selection_owner_reply_t::xcb_get_selection_owner_reply_t(xcb_get_selection_owner_reply_t const&amp;)" location="f0:1982" file="f0" line="1982" endline="1982" inline="1">
    <Argument type="_5377" location="f0:1982" file="f0" line="1982"/>
  </Constructor>
  <Constructor id="_2777" name="xcb_get_selection_owner_reply_t" artificial="1" throw="" context="_495" access="public" mangled="_ZN31xcb_get_selection_owner_reply_tC1Ev *INTERNAL* " demangled="xcb_get_selection_owner_reply_t::xcb_get_selection_owner_reply_t()" location="f0:1982" file="f0" line="1982" inline="1"/>
  <PointerType id="_2778" type="_27c" size="32" align="32"/>
  <Field id="_2779" name="major_opcode" type="_1473" offset="0" context="_500" access="public" location="f0:4092" file="f0" line="4092"/>
  <Field id="_2780" name="_class" type="_1473" offset="8" context="_500" access="public" location="f0:4093" file="f0" line="4093"/>
  <Field id="_2781" name="length" type="_1398" offset="16" context="_500" access="public" location="f0:4094" file="f0" line="4094"/>
  <Field id="_2782" name="drawable" type="_882" offset="32" context="_500" access="public" location="f0:4095" file="f0" line="4095"/>
  <Field id="_2783" name="width" type="_1398" offset="64" context="_500" access="public" location="f0:4096" file="f0" line="4096"/>
  <Field id="_2784" name="height" type="_1398" offset="80" context="_500" access="public" location="f0:4097" file="f0" line="4097"/>
  <Destructor id="_2785" name="xcb_query_best_size_request_t" artificial="1" throw="" context="_500" access="public" mangled="_ZN29xcb_query_best_size_request_tD1Ev *INTERNAL* " demangled="xcb_query_best_size_request_t::~xcb_query_best_size_request_t()" location="f0:4091" file="f0" line="4091" endline="4091" inline="1">
  </Destructor>
  <OperatorMethod id="_2786" name="=" returns="_5379" artificial="1" throw="" context="_500" access="public" mangled="_ZN29xcb_query_best_size_request_taSERKS_" demangled="xcb_query_best_size_request_t::operator=(xcb_query_best_size_request_t const&amp;)" location="f0:4091" file="f0" line="4091" endline="4091" inline="1">
    <Argument type="_5380" location="f0:4091" file="f0" line="4091"/>
  </OperatorMethod>
  <Constructor id="_2787" name="xcb_query_best_size_request_t" artificial="1" throw="" context="_500" access="public" mangled="_ZN29xcb_query_best_size_request_tC1ERKS_ *INTERNAL* " demangled="xcb_query_best_size_request_t::xcb_query_best_size_request_t(xcb_query_best_size_request_t const&amp;)" location="f0:4091" file="f0" line="4091" endline="4091" inline="1">
    <Argument type="_5380" location="f0:4091" file="f0" line="4091"/>
  </Constructor>
  <Constructor id="_2788" name="xcb_query_best_size_request_t" artificial="1" throw="" context="_500" access="public" mangled="_ZN29xcb_query_best_size_request_tC1Ev *INTERNAL* " demangled="xcb_query_best_size_request_t::xcb_query_best_size_request_t()" location="f0:4091" file="f0" line="4091" inline="1"/>
  <CvQualifiedType id="_2087r" type="_2087" restrict="1"/>
  <PointerType id="_2790" type="_1132c" size="32" align="32"/>
  <PointerType id="_2791" type="_1896" size="32" align="32"/>
  <PointerType id="_2792" type="_551" size="32" align="32"/>
  <Field id="_2793" name="major_opcode" type="_1473" offset="0" context="_512" access="public" location="f0:2540" file="f0" line="2540"/>
  <Field id="_2794" name="revert_to" type="_1473" offset="8" context="_512" access="public" location="f0:2541" file="f0" line="2541"/>
  <Field id="_2795" name="length" type="_1398" offset="16" context="_512" access="public" location="f0:2542" file="f0" line="2542"/>
  <Field id="_2796" name="focus" type="_684" offset="32" context="_512" access="public" location="f0:2543" file="f0" line="2543"/>
  <Field id="_2797" name="time" type="_1254" offset="64" context="_512" access="public" location="f0:2544" file="f0" line="2544"/>
  <Destructor id="_2798" name="xcb_set_input_focus_request_t" artificial="1" throw="" context="_512" access="public" mangled="_ZN29xcb_set_input_focus_request_tD1Ev *INTERNAL* " demangled="xcb_set_input_focus_request_t::~xcb_set_input_focus_request_t()" location="f0:2539" file="f0" line="2539" endline="2539" inline="1">
  </Destructor>
  <OperatorMethod id="_2799" name="=" returns="_5382" artificial="1" throw="" context="_512" access="public" mangled="_ZN29xcb_set_input_focus_request_taSERKS_" demangled="xcb_set_input_focus_request_t::operator=(xcb_set_input_focus_request_t const&amp;)" location="f0:2539" file="f0" line="2539" endline="2539" inline="1">
    <Argument type="_5383" location="f0:2539" file="f0" line="2539"/>
  </OperatorMethod>
  <Constructor id="_2800" name="xcb_set_input_focus_request_t" artificial="1" throw="" context="_512" access="public" mangled="_ZN29xcb_set_input_focus_request_tC1ERKS_ *INTERNAL* " demangled="xcb_set_input_focus_request_t::xcb_set_input_focus_request_t(xcb_set_input_focus_request_t const&amp;)" location="f0:2539" file="f0" line="2539" endline="2539" inline="1">
    <Argument type="_5383" location="f0:2539" file="f0" line="2539"/>
  </Constructor>
  <Constructor id="_2801" name="xcb_set_input_focus_request_t" artificial="1" throw="" context="_512" access="public" mangled="_ZN29xcb_set_input_focus_request_tC1Ev *INTERNAL* " demangled="xcb_set_input_focus_request_t::xcb_set_input_focus_request_t()" location="f0:2539" file="f0" line="2539" inline="1"/>
  <PointerType id="_2802" type="_1065c" size="32" align="32"/>
  <Field id="_2803" name="response_type" type="_1473" offset="0" context="_515" access="public" location="f0:1503" file="f0" line="1503"/>
  <Field id="_2804" name="backing_store" type="_1473" offset="8" context="_515" access="public" location="f0:1504" file="f0" line="1504"/>
  <Field id="_2805" name="sequence" type="_1398" offset="16" context="_515" access="public" location="f0:1505" file="f0" line="1505"/>
  <Field id="_2806" name="length" type="_705" offset="32" context="_515" access="public" location="f0:1506" file="f0" line="1506"/>
  <Field id="_2807" name="visual" type="_1789" offset="64" context="_515" access="public" location="f0:1507" file="f0" line="1507"/>
  <Field id="_2808" name="_class" type="_1398" offset="96" context="_515" access="public" location="f0:1508" file="f0" line="1508"/>
  <Field id="_2809" name="bit_gravity" type="_1473" offset="112" context="_515" access="public" location="f0:1509" file="f0" line="1509"/>
  <Field id="_2810" name="win_gravity" type="_1473" offset="120" context="_515" access="public" location="f0:1510" file="f0" line="1510"/>
  <Field id="_2811" name="backing_planes" type="_705" offset="128" context="_515" access="public" location="f0:1511" file="f0" line="1511"/>
  <Field id="_2812" name="backing_pixel" type="_705" offset="160" context="_515" access="public" location="f0:1512" file="f0" line="1512"/>
  <Field id="_2813" name="save_under" type="_1473" offset="192" context="_515" access="public" location="f0:1513" file="f0" line="1513"/>
  <Field id="_2814" name="map_is_installed" type="_1473" offset="200" context="_515" access="public" location="f0:1514" file="f0" line="1514"/>
  <Field id="_2815" name="map_state" type="_1473" offset="208" context="_515" access="public" location="f0:1515" file="f0" line="1515"/>
  <Field id="_2816" name="override_redirect" type="_1473" offset="216" context="_515" access="public" location="f0:1516" file="f0" line="1516"/>
  <Field id="_2817" name="colormap" type="_724" offset="224" context="_515" access="public" location="f0:1517" file="f0" line="1517"/>
  <Field id="_2818" name="all_event_masks" type="_705" offset="256" context="_515" access="public" location="f0:1518" file="f0" line="1518"/>
  <Field id="_2819" name="your_event_mask" type="_705" offset="288" context="_515" access="public" location="f0:1519" file="f0" line="1519"/>
  <Field id="_2820" name="do_not_propagate_mask" type="_1398" offset="320" context="_515" access="public" location="f0:1520" file="f0" line="1520"/>
  <Field id="_2821" name="pad0" type="_5165" offset="336" context="_515" access="public" location="f0:1521" file="f0" line="1521"/>
  <Destructor id="_2822" name="xcb_get_window_attributes_reply_t" artificial="1" throw="" context="_515" access="public" mangled="_ZN33xcb_get_window_attributes_reply_tD1Ev *INTERNAL* " demangled="xcb_get_window_attributes_reply_t::~xcb_get_window_attributes_reply_t()" location="f0:1502" file="f0" line="1502" endline="1502" inline="1">
  </Destructor>
  <OperatorMethod id="_2823" name="=" returns="_5385" artificial="1" throw="" context="_515" access="public" mangled="_ZN33xcb_get_window_attributes_reply_taSERKS_" demangled="xcb_get_window_attributes_reply_t::operator=(xcb_get_window_attributes_reply_t const&amp;)" location="f0:1502" file="f0" line="1502" endline="1502" inline="1">
    <Argument type="_5386" location="f0:1502" file="f0" line="1502"/>
  </OperatorMethod>
  <Constructor id="_2824" name="xcb_get_window_attributes_reply_t" artificial="1" throw="" context="_515" access="public" mangled="_ZN33xcb_get_window_attributes_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_window_attributes_reply_t::xcb_get_window_attributes_reply_t(xcb_get_window_attributes_reply_t const&amp;)" location="f0:1502" file="f0" line="1502" endline="1502" inline="1">
    <Argument type="_5386" location="f0:1502" file="f0" line="1502"/>
  </Constructor>
  <Constructor id="_2825" name="xcb_get_window_attributes_reply_t" artificial="1" throw="" context="_515" access="public" mangled="_ZN33xcb_get_window_attributes_reply_tC1Ev *INTERNAL* " demangled="xcb_get_window_attributes_reply_t::xcb_get_window_attributes_reply_t()" location="f0:1502" file="f0" line="1502" inline="1"/>
  <PointerType id="_2826" type="_1010" size="32" align="32"/>
  <Field id="_2827" name="__data" type="_2830" offset="0" context="_532" access="public" location="f9:141" file="f9" line="141"/>
  <Field id="_2828" name="__size" type="_5387" offset="0" context="_532" access="public" location="f9:142" file="f9" line="142"/>
  <Field id="_2829" name="__align" type="_137" offset="0" context="_532" access="public" location="f9:143" file="f9" line="143"/>
  <Struct id="_2830" context="_532" access="public" mangled="N14pthread_cond_t3._7E" demangled="pthread_cond_t::._7" location="f9:132" file="f9" line="132" artificial="1" size="352" align="32" members="_5388 _5389 _5390 _5391 _5392 _5393 _5394 _5395 _5396 _5397 _5398 _5399 " bases=""/>
  <Destructor id="_2831" name="._6" artificial="1" throw="" context="_532" access="public" mangled="_ZN14pthread_cond_tD1Ev *INTERNAL* " demangled="pthread_cond_t::~pthread_cond_t()" location="f9:144" file="f9" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_2832" name="=" returns="_5400" artificial="1" throw="" context="_532" access="public" mangled="_ZN14pthread_cond_taSERKS_" demangled="pthread_cond_t::operator=(pthread_cond_t const&amp;)" location="f9:144" file="f9" line="144" endline="144" inline="1">
    <Argument type="_5401" location="f9:130" file="f9" line="130"/>
  </OperatorMethod>
  <Constructor id="_2833" name="._6" artificial="1" throw="" context="_532" access="public" mangled="_ZN14pthread_cond_tC1ERKS_ *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t(pthread_cond_t const&amp;)" location="f9:144" file="f9" line="144" endline="144" inline="1">
    <Argument type="_5401" location="f9:130" file="f9" line="130"/>
  </Constructor>
  <Constructor id="_2834" name="._6" artificial="1" throw="" context="_532" access="public" mangled="_ZN14pthread_cond_tC1Ev *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t()" location="f9:144" file="f9" line="144" inline="1"/>
  <Field id="_2835" name="response_type" type="_1473" offset="0" context="_542" access="public" location="f0:4104" file="f0" line="4104"/>
  <Field id="_2836" name="pad0" type="_1473" offset="8" context="_542" access="public" location="f0:4105" file="f0" line="4105"/>
  <Field id="_2837" name="sequence" type="_1398" offset="16" context="_542" access="public" location="f0:4106" file="f0" line="4106"/>
  <Field id="_2838" name="length" type="_705" offset="32" context="_542" access="public" location="f0:4107" file="f0" line="4107"/>
  <Field id="_2839" name="width" type="_1398" offset="64" context="_542" access="public" location="f0:4108" file="f0" line="4108"/>
  <Field id="_2840" name="height" type="_1398" offset="80" context="_542" access="public" location="f0:4109" file="f0" line="4109"/>
  <Destructor id="_2841" name="xcb_query_best_size_reply_t" artificial="1" throw="" context="_542" access="public" mangled="_ZN27xcb_query_best_size_reply_tD1Ev *INTERNAL* " demangled="xcb_query_best_size_reply_t::~xcb_query_best_size_reply_t()" location="f0:4103" file="f0" line="4103" endline="4103" inline="1">
  </Destructor>
  <OperatorMethod id="_2842" name="=" returns="_5402" artificial="1" throw="" context="_542" access="public" mangled="_ZN27xcb_query_best_size_reply_taSERKS_" demangled="xcb_query_best_size_reply_t::operator=(xcb_query_best_size_reply_t const&amp;)" location="f0:4103" file="f0" line="4103" endline="4103" inline="1">
    <Argument type="_5403" location="f0:4103" file="f0" line="4103"/>
  </OperatorMethod>
  <Constructor id="_2843" name="xcb_query_best_size_reply_t" artificial="1" throw="" context="_542" access="public" mangled="_ZN27xcb_query_best_size_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_best_size_reply_t::xcb_query_best_size_reply_t(xcb_query_best_size_reply_t const&amp;)" location="f0:4103" file="f0" line="4103" endline="4103" inline="1">
    <Argument type="_5403" location="f0:4103" file="f0" line="4103"/>
  </Constructor>
  <Constructor id="_2844" name="xcb_query_best_size_reply_t" artificial="1" throw="" context="_542" access="public" mangled="_ZN27xcb_query_best_size_reply_tC1Ev *INTERNAL* " demangled="xcb_query_best_size_reply_t::xcb_query_best_size_reply_t()" location="f0:4103" file="f0" line="4103" inline="1"/>
  <Field id="_2845" name="data" type="_5404" offset="0" context="_547" access="public" location="f0:55" file="f0" line="55"/>
  <Field id="_2846" name="rem" type="_188" offset="32" context="_547" access="public" location="f0:56" file="f0" line="56"/>
  <Field id="_2847" name="index" type="_188" offset="64" context="_547" access="public" location="f0:57" file="f0" line="57"/>
  <Destructor id="_2848" name="xcb_pixmap_iterator_t" artificial="1" throw="" context="_547" access="public" mangled="_ZN21xcb_pixmap_iterator_tD1Ev *INTERNAL* " demangled="xcb_pixmap_iterator_t::~xcb_pixmap_iterator_t()" location="f0:54" file="f0" line="54" endline="54" inline="1">
  </Destructor>
  <OperatorMethod id="_2849" name="=" returns="_5405" artificial="1" throw="" context="_547" access="public" mangled="_ZN21xcb_pixmap_iterator_taSERKS_" demangled="xcb_pixmap_iterator_t::operator=(xcb_pixmap_iterator_t const&amp;)" location="f0:54" file="f0" line="54" endline="54" inline="1">
    <Argument type="_5406" location="f0:54" file="f0" line="54"/>
  </OperatorMethod>
  <Constructor id="_2850" name="xcb_pixmap_iterator_t" artificial="1" throw="" context="_547" access="public" mangled="_ZN21xcb_pixmap_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_pixmap_iterator_t::xcb_pixmap_iterator_t(xcb_pixmap_iterator_t const&amp;)" location="f0:54" file="f0" line="54" endline="54" inline="1">
    <Argument type="_5406" location="f0:54" file="f0" line="54"/>
  </Constructor>
  <Constructor id="_2851" name="xcb_pixmap_iterator_t" artificial="1" throw="" context="_547" access="public" mangled="_ZN21xcb_pixmap_iterator_tC1Ev *INTERNAL* " demangled="xcb_pixmap_iterator_t::xcb_pixmap_iterator_t()" location="f0:54" file="f0" line="54" inline="1"/>
  <PointerType id="_2852" type="_1590" size="32" align="32"/>
  <Field id="_2853" name="modes" type="_100" offset="0" context="_550" access="public" location="f21:27" file="f21" line="27"/>
  <Field id="_2854" name="offset" type="_1830" offset="32" context="_550" access="public" location="f21:28" file="f21" line="28"/>
  <Field id="_2855" name="freq" type="_1830" offset="64" context="_550" access="public" location="f21:29" file="f21" line="29"/>
  <Field id="_2856" name="maxerror" type="_1830" offset="96" context="_550" access="public" location="f21:30" file="f21" line="30"/>
  <Field id="_2857" name="esterror" type="_1830" offset="128" context="_550" access="public" location="f21:31" file="f21" line="31"/>
  <Field id="_2858" name="status" type="_188" offset="160" context="_550" access="public" location="f21:32" file="f21" line="32"/>
  <Field id="_2859" name="constant" type="_1830" offset="192" context="_550" access="public" location="f21:33" file="f21" line="33"/>
  <Field id="_2860" name="precision" type="_1830" offset="224" context="_550" access="public" location="f21:34" file="f21" line="34"/>
  <Field id="_2861" name="tolerance" type="_1830" offset="256" context="_550" access="public" location="f21:35" file="f21" line="35"/>
  <Field id="_2862" name="time" type="_18" offset="288" context="_550" access="public" location="f21:36" file="f21" line="36"/>
  <Field id="_2863" name="tick" type="_1830" offset="352" context="_550" access="public" location="f21:37" file="f21" line="37"/>
  <Field id="_2864" name="ppsfreq" type="_1830" offset="384" context="_550" access="public" location="f21:38" file="f21" line="38"/>
  <Field id="_2865" name="jitter" type="_1830" offset="416" context="_550" access="public" location="f21:39" file="f21" line="39"/>
  <Field id="_2866" name="shift" type="_188" offset="448" context="_550" access="public" location="f21:40" file="f21" line="40"/>
  <Field id="_2867" name="stabil" type="_1830" offset="480" context="_550" access="public" location="f21:41" file="f21" line="41"/>
  <Field id="_2868" name="jitcnt" type="_1830" offset="512" context="_550" access="public" location="f21:42" file="f21" line="42"/>
  <Field id="_2869" name="calcnt" type="_1830" offset="544" context="_550" access="public" location="f21:43" file="f21" line="43"/>
  <Field id="_2870" name="errcnt" type="_1830" offset="576" context="_550" access="public" location="f21:44" file="f21" line="44"/>
  <Field id="_2871" name="stbcnt" type="_1830" offset="608" context="_550" access="public" location="f21:45" file="f21" line="45"/>
  <Field id="_2872" name="tai" type="_188" offset="640" context="_550" access="public" location="f21:47" file="f21" line="47"/>
  <Field id="_2873" name="" bits="32" type="_188" offset="672" context="_550" access="public" location="f21:50" file="f21" line="50"/>
  <Field id="_2874" name="" bits="32" type="_188" offset="704" context="_550" access="public" location="f21:50" file="f21" line="50"/>
  <Field id="_2875" name="" bits="32" type="_188" offset="736" context="_550" access="public" location="f21:50" file="f21" line="50"/>
  <Field id="_2876" name="" bits="32" type="_188" offset="768" context="_550" access="public" location="f21:50" file="f21" line="50"/>
  <Field id="_2877" name="" bits="32" type="_188" offset="800" context="_550" access="public" location="f21:51" file="f21" line="51"/>
  <Field id="_2878" name="" bits="32" type="_188" offset="832" context="_550" access="public" location="f21:51" file="f21" line="51"/>
  <Field id="_2879" name="" bits="32" type="_188" offset="864" context="_550" access="public" location="f21:51" file="f21" line="51"/>
  <Field id="_2880" name="" bits="32" type="_188" offset="896" context="_550" access="public" location="f21:51" file="f21" line="51"/>
  <Field id="_2881" name="" bits="32" type="_188" offset="928" context="_550" access="public" location="f21:52" file="f21" line="52"/>
  <Field id="_2882" name="" bits="32" type="_188" offset="960" context="_550" access="public" location="f21:52" file="f21" line="52"/>
  <Field id="_2883" name="" bits="32" type="_188" offset="992" context="_550" access="public" location="f21:52" file="f21" line="52"/>
  <Destructor id="_2884" name="timex" artificial="1" throw="" context="_550" access="public" mangled="_ZN5timexD1Ev *INTERNAL* " demangled="timex::~timex()" location="f21:26" file="f21" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_2885" name="=" returns="_5407" artificial="1" throw="" context="_550" access="public" mangled="_ZN5timexaSERKS_" demangled="timex::operator=(timex const&amp;)" location="f21:26" file="f21" line="26" endline="26" inline="1">
    <Argument type="_5408" location="f21:26" file="f21" line="26"/>
  </OperatorMethod>
  <Constructor id="_2886" name="timex" artificial="1" throw="" context="_550" access="public" mangled="_ZN5timexC1ERKS_ *INTERNAL* " demangled="timex::timex(timex const&amp;)" location="f21:26" file="f21" line="26" endline="26" inline="1">
    <Argument type="_5408" location="f21:26" file="f21" line="26"/>
  </Constructor>
  <Constructor id="_2887" name="timex" artificial="1" throw="" context="_550" access="public" mangled="_ZN5timexC1Ev *INTERNAL* " demangled="timex::timex()" location="f21:26" file="f21" line="26" inline="1"/>
  <Field id="_2888" name="__size" type="_5409" offset="0" context="_551" access="public" location="f9:223" file="f9" line="223"/>
  <Field id="_2889" name="__align" type="_31" offset="0" context="_551" access="public" location="f9:224" file="f9" line="224"/>
  <Destructor id="_2890" name="._12" artificial="1" throw="" context="_551" access="public" mangled="_ZN17pthread_barrier_tD1Ev *INTERNAL* " demangled="pthread_barrier_t::~pthread_barrier_t()" location="f9:225" file="f9" line="225" endline="225" inline="1">
  </Destructor>
  <OperatorMethod id="_2891" name="=" returns="_5410" artificial="1" throw="" context="_551" access="public" mangled="_ZN17pthread_barrier_taSERKS_" demangled="pthread_barrier_t::operator=(pthread_barrier_t const&amp;)" location="f9:225" file="f9" line="225" endline="225" inline="1">
    <Argument type="_5411" location="f9:222" file="f9" line="222"/>
  </OperatorMethod>
  <Constructor id="_2892" name="._12" artificial="1" throw="" context="_551" access="public" mangled="_ZN17pthread_barrier_tC1ERKS_ *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t(pthread_barrier_t const&amp;)" location="f9:225" file="f9" line="225" endline="225" inline="1">
    <Argument type="_5411" location="f9:222" file="f9" line="222"/>
  </Constructor>
  <Constructor id="_2893" name="._12" artificial="1" throw="" context="_551" access="public" mangled="_ZN17pthread_barrier_tC1Ev *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t()" location="f9:225" file="f9" line="225" inline="1"/>
  <Field id="_2894" name="major_opcode" type="_1473" offset="0" context="_553" access="public" location="f0:1926" file="f0" line="1926"/>
  <Field id="_2895" name="pad0" type="_1473" offset="8" context="_553" access="public" location="f0:1927" file="f0" line="1927"/>
  <Field id="_2896" name="length" type="_1398" offset="16" context="_553" access="public" location="f0:1928" file="f0" line="1928"/>
  <Field id="_2897" name="window" type="_684" offset="32" context="_553" access="public" location="f0:1929" file="f0" line="1929"/>
  <Destructor id="_2898" name="xcb_list_properties_request_t" artificial="1" throw="" context="_553" access="public" mangled="_ZN29xcb_list_properties_request_tD1Ev *INTERNAL* " demangled="xcb_list_properties_request_t::~xcb_list_properties_request_t()" location="f0:1925" file="f0" line="1925" endline="1925" inline="1">
  </Destructor>
  <OperatorMethod id="_2899" name="=" returns="_5412" artificial="1" throw="" context="_553" access="public" mangled="_ZN29xcb_list_properties_request_taSERKS_" demangled="xcb_list_properties_request_t::operator=(xcb_list_properties_request_t const&amp;)" location="f0:1925" file="f0" line="1925" endline="1925" inline="1">
    <Argument type="_5413" location="f0:1925" file="f0" line="1925"/>
  </OperatorMethod>
  <Constructor id="_2900" name="xcb_list_properties_request_t" artificial="1" throw="" context="_553" access="public" mangled="_ZN29xcb_list_properties_request_tC1ERKS_ *INTERNAL* " demangled="xcb_list_properties_request_t::xcb_list_properties_request_t(xcb_list_properties_request_t const&amp;)" location="f0:1925" file="f0" line="1925" endline="1925" inline="1">
    <Argument type="_5413" location="f0:1925" file="f0" line="1925"/>
  </Constructor>
  <Constructor id="_2901" name="xcb_list_properties_request_t" artificial="1" throw="" context="_553" access="public" mangled="_ZN29xcb_list_properties_request_tC1Ev *INTERNAL* " demangled="xcb_list_properties_request_t::xcb_list_properties_request_t()" location="f0:1925" file="f0" line="1925" inline="1"/>
  <PointerType id="_2902" type="_608" size="32" align="32"/>
  <Field id="_2903" name="status" type="_1473" offset="0" context="_567" access="public" location="f0:431" file="f0" line="431"/>
  <Field id="_2904" name="pad0" type="_5414" offset="8" context="_567" access="public" location="f0:432" file="f0" line="432"/>
  <Field id="_2905" name="length" type="_1398" offset="48" context="_567" access="public" location="f0:433" file="f0" line="433"/>
  <Destructor id="_2906" name="xcb_setup_authenticate_t" artificial="1" throw="" context="_567" access="public" mangled="_ZN24xcb_setup_authenticate_tD1Ev *INTERNAL* " demangled="xcb_setup_authenticate_t::~xcb_setup_authenticate_t()" location="f0:430" file="f0" line="430" endline="430" inline="1">
  </Destructor>
  <OperatorMethod id="_2907" name="=" returns="_5415" artificial="1" throw="" context="_567" access="public" mangled="_ZN24xcb_setup_authenticate_taSERKS_" demangled="xcb_setup_authenticate_t::operator=(xcb_setup_authenticate_t const&amp;)" location="f0:430" file="f0" line="430" endline="430" inline="1">
    <Argument type="_5416" location="f0:430" file="f0" line="430"/>
  </OperatorMethod>
  <Constructor id="_2908" name="xcb_setup_authenticate_t" artificial="1" throw="" context="_567" access="public" mangled="_ZN24xcb_setup_authenticate_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_authenticate_t::xcb_setup_authenticate_t(xcb_setup_authenticate_t const&amp;)" location="f0:430" file="f0" line="430" endline="430" inline="1">
    <Argument type="_5416" location="f0:430" file="f0" line="430"/>
  </Constructor>
  <Constructor id="_2909" name="xcb_setup_authenticate_t" artificial="1" throw="" context="_567" access="public" mangled="_ZN24xcb_setup_authenticate_tC1Ev *INTERNAL* " demangled="xcb_setup_authenticate_t::xcb_setup_authenticate_t()" location="f0:430" file="f0" line="430" inline="1"/>
  <Field id="_2910" name="response_type" type="_1473" offset="0" context="_569" access="public" location="f0:734" file="f0" line="734"/>
  <Field id="_2911" name="pad0" type="_1473" offset="8" context="_569" access="public" location="f0:735" file="f0" line="735"/>
  <Field id="_2912" name="sequence" type="_1398" offset="16" context="_569" access="public" location="f0:736" file="f0" line="736"/>
  <Field id="_2913" name="drawable" type="_882" offset="32" context="_569" access="public" location="f0:737" file="f0" line="737"/>
  <Field id="_2914" name="minor_opcode" type="_1398" offset="64" context="_569" access="public" location="f0:738" file="f0" line="738"/>
  <Field id="_2915" name="major_opcode" type="_1473" offset="80" context="_569" access="public" location="f0:739" file="f0" line="739"/>
  <Field id="_2916" name="pad1" type="_1473" offset="88" context="_569" access="public" location="f0:740" file="f0" line="740"/>
  <Destructor id="_2917" name="xcb_no_exposure_event_t" artificial="1" throw="" context="_569" access="public" mangled="_ZN23xcb_no_exposure_event_tD1Ev *INTERNAL* " demangled="xcb_no_exposure_event_t::~xcb_no_exposure_event_t()" location="f0:733" file="f0" line="733" endline="733" inline="1">
  </Destructor>
  <OperatorMethod id="_2918" name="=" returns="_5417" artificial="1" throw="" context="_569" access="public" mangled="_ZN23xcb_no_exposure_event_taSERKS_" demangled="xcb_no_exposure_event_t::operator=(xcb_no_exposure_event_t const&amp;)" location="f0:733" file="f0" line="733" endline="733" inline="1">
    <Argument type="_5418" location="f0:733" file="f0" line="733"/>
  </OperatorMethod>
  <Constructor id="_2919" name="xcb_no_exposure_event_t" artificial="1" throw="" context="_569" access="public" mangled="_ZN23xcb_no_exposure_event_tC1ERKS_ *INTERNAL* " demangled="xcb_no_exposure_event_t::xcb_no_exposure_event_t(xcb_no_exposure_event_t const&amp;)" location="f0:733" file="f0" line="733" endline="733" inline="1">
    <Argument type="_5418" location="f0:733" file="f0" line="733"/>
  </Constructor>
  <Constructor id="_2920" name="xcb_no_exposure_event_t" artificial="1" throw="" context="_569" access="public" mangled="_ZN23xcb_no_exposure_event_tC1Ev *INTERNAL* " demangled="xcb_no_exposure_event_t::xcb_no_exposure_event_t()" location="f0:733" file="f0" line="733" inline="1"/>
  <Field id="_2921" name="response_type" type="_1473" offset="0" context="_576" access="public" location="f0:914" file="f0" line="914"/>
  <Field id="_2922" name="pad0" type="_1473" offset="8" context="_576" access="public" location="f0:915" file="f0" line="915"/>
  <Field id="_2923" name="sequence" type="_1398" offset="16" context="_576" access="public" location="f0:916" file="f0" line="916"/>
  <Field id="_2924" name="event" type="_684" offset="32" context="_576" access="public" location="f0:917" file="f0" line="917"/>
  <Field id="_2925" name="window" type="_684" offset="64" context="_576" access="public" location="f0:918" file="f0" line="918"/>
  <Field id="_2926" name="x" type="_887" offset="96" context="_576" access="public" location="f0:919" file="f0" line="919"/>
  <Field id="_2927" name="y" type="_887" offset="112" context="_576" access="public" location="f0:920" file="f0" line="920"/>
  <Destructor id="_2928" name="xcb_gravity_notify_event_t" artificial="1" throw="" context="_576" access="public" mangled="_ZN26xcb_gravity_notify_event_tD1Ev *INTERNAL* " demangled="xcb_gravity_notify_event_t::~xcb_gravity_notify_event_t()" location="f0:913" file="f0" line="913" endline="913" inline="1">
  </Destructor>
  <OperatorMethod id="_2929" name="=" returns="_5419" artificial="1" throw="" context="_576" access="public" mangled="_ZN26xcb_gravity_notify_event_taSERKS_" demangled="xcb_gravity_notify_event_t::operator=(xcb_gravity_notify_event_t const&amp;)" location="f0:913" file="f0" line="913" endline="913" inline="1">
    <Argument type="_5420" location="f0:913" file="f0" line="913"/>
  </OperatorMethod>
  <Constructor id="_2930" name="xcb_gravity_notify_event_t" artificial="1" throw="" context="_576" access="public" mangled="_ZN26xcb_gravity_notify_event_tC1ERKS_ *INTERNAL* " demangled="xcb_gravity_notify_event_t::xcb_gravity_notify_event_t(xcb_gravity_notify_event_t const&amp;)" location="f0:913" file="f0" line="913" endline="913" inline="1">
    <Argument type="_5420" location="f0:913" file="f0" line="913"/>
  </Constructor>
  <Constructor id="_2931" name="xcb_gravity_notify_event_t" artificial="1" throw="" context="_576" access="public" mangled="_ZN26xcb_gravity_notify_event_tC1Ev *INTERNAL* " demangled="xcb_gravity_notify_event_t::xcb_gravity_notify_event_t()" location="f0:913" file="f0" line="913" inline="1"/>
  <PointerType id="_2932" type="_865" size="32" align="32"/>
  <Field id="_2933" name="response_type" type="_1473" offset="0" context="_579" access="public" location="f0:1711" file="f0" line="1711"/>
  <Field id="_2934" name="depth" type="_1473" offset="8" context="_579" access="public" location="f0:1712" file="f0" line="1712"/>
  <Field id="_2935" name="sequence" type="_1398" offset="16" context="_579" access="public" location="f0:1713" file="f0" line="1713"/>
  <Field id="_2936" name="length" type="_705" offset="32" context="_579" access="public" location="f0:1714" file="f0" line="1714"/>
  <Field id="_2937" name="root" type="_684" offset="64" context="_579" access="public" location="f0:1715" file="f0" line="1715"/>
  <Field id="_2938" name="x" type="_887" offset="96" context="_579" access="public" location="f0:1716" file="f0" line="1716"/>
  <Field id="_2939" name="y" type="_887" offset="112" context="_579" access="public" location="f0:1717" file="f0" line="1717"/>
  <Field id="_2940" name="width" type="_1398" offset="128" context="_579" access="public" location="f0:1718" file="f0" line="1718"/>
  <Field id="_2941" name="height" type="_1398" offset="144" context="_579" access="public" location="f0:1719" file="f0" line="1719"/>
  <Field id="_2942" name="border_width" type="_1398" offset="160" context="_579" access="public" location="f0:1720" file="f0" line="1720"/>
  <Field id="_2943" name="pad0" type="_5165" offset="176" context="_579" access="public" location="f0:1721" file="f0" line="1721"/>
  <Destructor id="_2944" name="xcb_get_geometry_reply_t" artificial="1" throw="" context="_579" access="public" mangled="_ZN24xcb_get_geometry_reply_tD1Ev *INTERNAL* " demangled="xcb_get_geometry_reply_t::~xcb_get_geometry_reply_t()" location="f0:1710" file="f0" line="1710" endline="1710" inline="1">
  </Destructor>
  <OperatorMethod id="_2945" name="=" returns="_5421" artificial="1" throw="" context="_579" access="public" mangled="_ZN24xcb_get_geometry_reply_taSERKS_" demangled="xcb_get_geometry_reply_t::operator=(xcb_get_geometry_reply_t const&amp;)" location="f0:1710" file="f0" line="1710" endline="1710" inline="1">
    <Argument type="_5422" location="f0:1710" file="f0" line="1710"/>
  </OperatorMethod>
  <Constructor id="_2946" name="xcb_get_geometry_reply_t" artificial="1" throw="" context="_579" access="public" mangled="_ZN24xcb_get_geometry_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_geometry_reply_t::xcb_get_geometry_reply_t(xcb_get_geometry_reply_t const&amp;)" location="f0:1710" file="f0" line="1710" endline="1710" inline="1">
    <Argument type="_5422" location="f0:1710" file="f0" line="1710"/>
  </Constructor>
  <Constructor id="_2947" name="xcb_get_geometry_reply_t" artificial="1" throw="" context="_579" access="public" mangled="_ZN24xcb_get_geometry_reply_tC1Ev *INTERNAL* " demangled="xcb_get_geometry_reply_t::xcb_get_geometry_reply_t()" location="f0:1710" file="f0" line="1710" inline="1"/>
  <Field id="_2948" name="__val" type="_5423" offset="0" context="_581" access="public" location="f14:143" file="f14" line="143"/>
  <Destructor id="_2949" name="._0" artificial="1" throw="" context="_581" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f14:143" file="f14" line="143" endline="143" inline="1">
  </Destructor>
  <OperatorMethod id="_2950" name="=" returns="_5424" artificial="1" throw="" context="_581" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f14:143" file="f14" line="143" endline="143" inline="1">
    <Argument type="_5425" location="f14:143" file="f14" line="143"/>
  </OperatorMethod>
  <Constructor id="_2951" name="._0" artificial="1" throw="" context="_581" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f14:143" file="f14" line="143" endline="143" inline="1">
    <Argument type="_5425" location="f14:143" file="f14" line="143"/>
  </Constructor>
  <Constructor id="_2952" name="._0" artificial="1" throw="" context="_581" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f14:143" file="f14" line="143" inline="1"/>
  <Field id="_2953" name="__bits" type="_5426" offset="0" context="_584" access="public" location="f13:128" file="f13" line="128"/>
  <Destructor id="_2954" name="._14" artificial="1" throw="" context="_584" access="public" mangled="_ZN9cpu_set_tD1Ev *INTERNAL* " demangled="cpu_set_t::~cpu_set_t()" location="f13:129" file="f13" line="129" endline="129" inline="1">
  </Destructor>
  <OperatorMethod id="_2955" name="=" returns="_5427" artificial="1" throw="" context="_584" access="public" mangled="_ZN9cpu_set_taSERKS_" demangled="cpu_set_t::operator=(cpu_set_t const&amp;)" location="f13:129" file="f13" line="129" endline="129" inline="1">
    <Argument type="_5428" location="f13:127" file="f13" line="127"/>
  </OperatorMethod>
  <Constructor id="_2956" name="._14" artificial="1" throw="" context="_584" access="public" mangled="_ZN9cpu_set_tC1ERKS_ *INTERNAL* " demangled="cpu_set_t::cpu_set_t(cpu_set_t const&amp;)" location="f13:129" file="f13" line="129" endline="129" inline="1">
    <Argument type="_5428" location="f13:127" file="f13" line="127"/>
  </Constructor>
  <Constructor id="_2957" name="._14" artificial="1" throw="" context="_584" access="public" mangled="_ZN9cpu_set_tC1Ev *INTERNAL* " demangled="cpu_set_t::cpu_set_t()" location="f13:129" file="f13" line="129" inline="1"/>
  <Field id="_2958" name="major_opcode" type="_1473" offset="0" context="_589" access="public" location="f0:4575" file="f0" line="4575"/>
  <Field id="_2959" name="mode" type="_1473" offset="8" context="_589" access="public" location="f0:4576" file="f0" line="4576"/>
  <Field id="_2960" name="length" type="_1398" offset="16" context="_589" access="public" location="f0:4577" file="f0" line="4577"/>
  <Destructor id="_2961" name="xcb_force_screen_saver_request_t" artificial="1" throw="" context="_589" access="public" mangled="_ZN32xcb_force_screen_saver_request_tD1Ev *INTERNAL* " demangled="xcb_force_screen_saver_request_t::~xcb_force_screen_saver_request_t()" location="f0:4574" file="f0" line="4574" endline="4574" inline="1">
  </Destructor>
  <OperatorMethod id="_2962" name="=" returns="_5429" artificial="1" throw="" context="_589" access="public" mangled="_ZN32xcb_force_screen_saver_request_taSERKS_" demangled="xcb_force_screen_saver_request_t::operator=(xcb_force_screen_saver_request_t const&amp;)" location="f0:4574" file="f0" line="4574" endline="4574" inline="1">
    <Argument type="_5430" location="f0:4574" file="f0" line="4574"/>
  </OperatorMethod>
  <Constructor id="_2963" name="xcb_force_screen_saver_request_t" artificial="1" throw="" context="_589" access="public" mangled="_ZN32xcb_force_screen_saver_request_tC1ERKS_ *INTERNAL* " demangled="xcb_force_screen_saver_request_t::xcb_force_screen_saver_request_t(xcb_force_screen_saver_request_t const&amp;)" location="f0:4574" file="f0" line="4574" endline="4574" inline="1">
    <Argument type="_5430" location="f0:4574" file="f0" line="4574"/>
  </Constructor>
  <Constructor id="_2964" name="xcb_force_screen_saver_request_t" artificial="1" throw="" context="_589" access="public" mangled="_ZN32xcb_force_screen_saver_request_tC1Ev *INTERNAL* " demangled="xcb_force_screen_saver_request_t::xcb_force_screen_saver_request_t()" location="f0:4574" file="f0" line="4574" inline="1"/>
  <Field id="_2965" name="response_type" type="_1473" offset="0" context="_593" access="public" location="f15:133" file="f15" line="133"/>
  <Field id="_2966" name="pad0" type="_1473" offset="8" context="_593" access="public" location="f15:134" file="f15" line="134"/>
  <Field id="_2967" name="sequence" type="_1398" offset="16" context="_593" access="public" location="f15:135" file="f15" line="135"/>
  <Field id="_2968" name="pad" type="_5431" offset="32" context="_593" access="public" location="f15:136" file="f15" line="136"/>
  <Field id="_2969" name="full_sequence" type="_705" offset="256" context="_593" access="public" location="f15:137" file="f15" line="137"/>
  <Destructor id="_2970" name="._29" artificial="1" throw="" context="_593" access="public" mangled="_ZN19xcb_generic_event_tD1Ev *INTERNAL* " demangled="xcb_generic_event_t::~xcb_generic_event_t()" location="f15:138" file="f15" line="138" endline="138" inline="1">
  </Destructor>
  <OperatorMethod id="_2971" name="=" returns="_5432" artificial="1" throw="" context="_593" access="public" mangled="_ZN19xcb_generic_event_taSERKS_" demangled="xcb_generic_event_t::operator=(xcb_generic_event_t const&amp;)" location="f15:138" file="f15" line="138" endline="138" inline="1">
    <Argument type="_5433" location="f15:132" file="f15" line="132"/>
  </OperatorMethod>
  <Constructor id="_2972" name="._29" artificial="1" throw="" context="_593" access="public" mangled="_ZN19xcb_generic_event_tC1ERKS_ *INTERNAL* " demangled="xcb_generic_event_t::xcb_generic_event_t(xcb_generic_event_t const&amp;)" location="f15:138" file="f15" line="138" endline="138" inline="1">
    <Argument type="_5433" location="f15:132" file="f15" line="132"/>
  </Constructor>
  <Constructor id="_2973" name="._29" artificial="1" throw="" context="_593" access="public" mangled="_ZN19xcb_generic_event_tC1Ev *INTERNAL* " demangled="xcb_generic_event_t::xcb_generic_event_t()" location="f15:138" file="f15" line="138" inline="1"/>
  <PointerType id="_2974" type="_460" size="32" align="32"/>
  <Field id="_2975" name="major_opcode" type="_1473" offset="0" context="_598" access="public" location="f0:3383" file="f0" line="3383"/>
  <Field id="_2976" name="pad0" type="_1473" offset="8" context="_598" access="public" location="f0:3384" file="f0" line="3384"/>
  <Field id="_2977" name="length" type="_1398" offset="16" context="_598" access="public" location="f0:3385" file="f0" line="3385"/>
  <Field id="_2978" name="drawable" type="_882" offset="32" context="_598" access="public" location="f0:3386" file="f0" line="3386"/>
  <Field id="_2979" name="gc" type="_1801" offset="64" context="_598" access="public" location="f0:3387" file="f0" line="3387"/>
  <Destructor id="_2980" name="xcb_poly_arc_request_t" artificial="1" throw="" context="_598" access="public" mangled="_ZN22xcb_poly_arc_request_tD1Ev *INTERNAL* " demangled="xcb_poly_arc_request_t::~xcb_poly_arc_request_t()" location="f0:3382" file="f0" line="3382" endline="3382" inline="1">
  </Destructor>
  <OperatorMethod id="_2981" name="=" returns="_5434" artificial="1" throw="" context="_598" access="public" mangled="_ZN22xcb_poly_arc_request_taSERKS_" demangled="xcb_poly_arc_request_t::operator=(xcb_poly_arc_request_t const&amp;)" location="f0:3382" file="f0" line="3382" endline="3382" inline="1">
    <Argument type="_5435" location="f0:3382" file="f0" line="3382"/>
  </OperatorMethod>
  <Constructor id="_2982" name="xcb_poly_arc_request_t" artificial="1" throw="" context="_598" access="public" mangled="_ZN22xcb_poly_arc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_poly_arc_request_t::xcb_poly_arc_request_t(xcb_poly_arc_request_t const&amp;)" location="f0:3382" file="f0" line="3382" endline="3382" inline="1">
    <Argument type="_5435" location="f0:3382" file="f0" line="3382"/>
  </Constructor>
  <Constructor id="_2983" name="xcb_poly_arc_request_t" artificial="1" throw="" context="_598" access="public" mangled="_ZN22xcb_poly_arc_request_tC1Ev *INTERNAL* " demangled="xcb_poly_arc_request_t::xcb_poly_arc_request_t()" location="f0:3382" file="f0" line="3382" inline="1"/>
  <PointerType id="_2984" type="_617" size="32" align="32"/>
  <PointerType id="_2985" type="_437c" size="32" align="32"/>
  <PointerType id="_2986" type="_1749" size="32" align="32"/>
  <Field id="_2987" name="data" type="_5437" offset="0" context="_607" access="public" location="f0:402" file="f0" line="402"/>
  <Field id="_2988" name="rem" type="_188" offset="32" context="_607" access="public" location="f0:403" file="f0" line="403"/>
  <Field id="_2989" name="index" type="_188" offset="64" context="_607" access="public" location="f0:404" file="f0" line="404"/>
  <Destructor id="_2990" name="xcb_setup_request_iterator_t" artificial="1" throw="" context="_607" access="public" mangled="_ZN28xcb_setup_request_iterator_tD1Ev *INTERNAL* " demangled="xcb_setup_request_iterator_t::~xcb_setup_request_iterator_t()" location="f0:401" file="f0" line="401" endline="401" inline="1">
  </Destructor>
  <OperatorMethod id="_2991" name="=" returns="_5438" artificial="1" throw="" context="_607" access="public" mangled="_ZN28xcb_setup_request_iterator_taSERKS_" demangled="xcb_setup_request_iterator_t::operator=(xcb_setup_request_iterator_t const&amp;)" location="f0:401" file="f0" line="401" endline="401" inline="1">
    <Argument type="_5439" location="f0:401" file="f0" line="401"/>
  </OperatorMethod>
  <Constructor id="_2992" name="xcb_setup_request_iterator_t" artificial="1" throw="" context="_607" access="public" mangled="_ZN28xcb_setup_request_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_request_iterator_t::xcb_setup_request_iterator_t(xcb_setup_request_iterator_t const&amp;)" location="f0:401" file="f0" line="401" endline="401" inline="1">
    <Argument type="_5439" location="f0:401" file="f0" line="401"/>
  </Constructor>
  <Constructor id="_2993" name="xcb_setup_request_iterator_t" artificial="1" throw="" context="_607" access="public" mangled="_ZN28xcb_setup_request_iterator_tC1Ev *INTERNAL* " demangled="xcb_setup_request_iterator_t::xcb_setup_request_iterator_t()" location="f0:401" file="f0" line="401" inline="1"/>
  <PointerType id="_2994" type="_584" size="32" align="32"/>
  <Field id="_2995" name="x1" type="_887" offset="0" context="_612" access="public" location="f0:3333" file="f0" line="3333"/>
  <Field id="_2996" name="y1" type="_887" offset="16" context="_612" access="public" location="f0:3334" file="f0" line="3334"/>
  <Field id="_2997" name="x2" type="_887" offset="32" context="_612" access="public" location="f0:3335" file="f0" line="3335"/>
  <Field id="_2998" name="y2" type="_887" offset="48" context="_612" access="public" location="f0:3336" file="f0" line="3336"/>
  <Destructor id="_2999" name="xcb_segment_t" artificial="1" throw="" context="_612" access="public" mangled="_ZN13xcb_segment_tD1Ev *INTERNAL* " demangled="xcb_segment_t::~xcb_segment_t()" location="f0:3332" file="f0" line="3332" endline="3332" inline="1">
  </Destructor>
  <OperatorMethod id="_3000" name="=" returns="_5440" artificial="1" throw="" context="_612" access="public" mangled="_ZN13xcb_segment_taSERKS_" demangled="xcb_segment_t::operator=(xcb_segment_t const&amp;)" location="f0:3332" file="f0" line="3332" endline="3332" inline="1">
    <Argument type="_5441" location="f0:3332" file="f0" line="3332"/>
  </OperatorMethod>
  <Constructor id="_3001" name="xcb_segment_t" artificial="1" throw="" context="_612" access="public" mangled="_ZN13xcb_segment_tC1ERKS_ *INTERNAL* " demangled="xcb_segment_t::xcb_segment_t(xcb_segment_t const&amp;)" location="f0:3332" file="f0" line="3332" endline="3332" inline="1">
    <Argument type="_5441" location="f0:3332" file="f0" line="3332"/>
  </Constructor>
  <Constructor id="_3002" name="xcb_segment_t" artificial="1" throw="" context="_612" access="public" mangled="_ZN13xcb_segment_tC1Ev *INTERNAL* " demangled="xcb_segment_t::xcb_segment_t()" location="f0:3332" file="f0" line="3332" inline="1"/>
  <Field id="_3003" name="depth" type="_1473" offset="0" context="_616" access="public" location="f0:253" file="f0" line="253"/>
  <Field id="_3004" name="bits_per_pixel" type="_1473" offset="8" context="_616" access="public" location="f0:254" file="f0" line="254"/>
  <Field id="_3005" name="scanline_pad" type="_1473" offset="16" context="_616" access="public" location="f0:255" file="f0" line="255"/>
  <Field id="_3006" name="pad0" type="_5414" offset="24" context="_616" access="public" location="f0:256" file="f0" line="256"/>
  <Destructor id="_3007" name="xcb_format_t" artificial="1" throw="" context="_616" access="public" mangled="_ZN12xcb_format_tD1Ev *INTERNAL* " demangled="xcb_format_t::~xcb_format_t()" location="f0:252" file="f0" line="252" endline="252" inline="1">
  </Destructor>
  <OperatorMethod id="_3008" name="=" returns="_5442" artificial="1" throw="" context="_616" access="public" mangled="_ZN12xcb_format_taSERKS_" demangled="xcb_format_t::operator=(xcb_format_t const&amp;)" location="f0:252" file="f0" line="252" endline="252" inline="1">
    <Argument type="_5443" location="f0:252" file="f0" line="252"/>
  </OperatorMethod>
  <Constructor id="_3009" name="xcb_format_t" artificial="1" throw="" context="_616" access="public" mangled="_ZN12xcb_format_tC1ERKS_ *INTERNAL* " demangled="xcb_format_t::xcb_format_t(xcb_format_t const&amp;)" location="f0:252" file="f0" line="252" endline="252" inline="1">
    <Argument type="_5443" location="f0:252" file="f0" line="252"/>
  </Constructor>
  <Constructor id="_3010" name="xcb_format_t" artificial="1" throw="" context="_616" access="public" mangled="_ZN12xcb_format_tC1Ev *INTERNAL* " demangled="xcb_format_t::xcb_format_t()" location="f0:252" file="f0" line="252" inline="1"/>
  <Field id="_3011" name="flags" type="_1361" offset="0" context="_619" access="public" location="f5:770" file="f5" line="770"/>
  <Field id="_3012" name="input" type="_705" offset="32" context="_619" access="public" location="f5:773" file="f5" line="773"/>
  <Field id="_3013" name="initial_state" type="_1361" offset="64" context="_619" access="public" location="f5:775" file="f5" line="775"/>
  <Field id="_3014" name="icon_pixmap" type="_1770" offset="96" context="_619" access="public" location="f5:777" file="f5" line="777"/>
  <Field id="_3015" name="icon_window" type="_684" offset="128" context="_619" access="public" location="f5:779" file="f5" line="779"/>
  <Field id="_3016" name="icon_x" type="_1361" offset="160" context="_619" access="public" location="f5:781" file="f5" line="781"/>
  <Field id="_3017" name="icon_y" type="_1361" offset="192" context="_619" access="public" location="f5:781" file="f5" line="781"/>
  <Field id="_3018" name="icon_mask" type="_1770" offset="224" context="_619" access="public" location="f5:783" file="f5" line="783"/>
  <Field id="_3019" name="window_group" type="_684" offset="256" context="_619" access="public" location="f5:785" file="f5" line="785"/>
  <Destructor id="_3020" name="._38" artificial="1" throw="" context="_619" access="public" mangled="_ZN20xcb_icccm_wm_hints_tD1Ev *INTERNAL* " demangled="xcb_icccm_wm_hints_t::~xcb_icccm_wm_hints_t()" location="f5:786" file="f5" line="786" endline="786" inline="1">
  </Destructor>
  <OperatorMethod id="_3021" name="=" returns="_5444" artificial="1" throw="" context="_619" access="public" mangled="_ZN20xcb_icccm_wm_hints_taSERKS_" demangled="xcb_icccm_wm_hints_t::operator=(xcb_icccm_wm_hints_t const&amp;)" location="f5:786" file="f5" line="786" endline="786" inline="1">
    <Argument type="_5445" location="f5:768" file="f5" line="768"/>
  </OperatorMethod>
  <Constructor id="_3022" name="._38" artificial="1" throw="" context="_619" access="public" mangled="_ZN20xcb_icccm_wm_hints_tC1ERKS_ *INTERNAL* " demangled="xcb_icccm_wm_hints_t::xcb_icccm_wm_hints_t(xcb_icccm_wm_hints_t const&amp;)" location="f5:786" file="f5" line="786" endline="786" inline="1">
    <Argument type="_5445" location="f5:768" file="f5" line="768"/>
  </Constructor>
  <Constructor id="_3023" name="._38" artificial="1" throw="" context="_619" access="public" mangled="_ZN20xcb_icccm_wm_hints_tC1Ev *INTERNAL* " demangled="xcb_icccm_wm_hints_t::xcb_icccm_wm_hints_t()" location="f5:786" file="f5" line="786" inline="1"/>
  <PointerType id="_3024" type="_394c" size="32" align="32"/>
  <PointerType id="_3025" type="_432" size="32" align="32"/>
  <Field id="_3026" name="major_opcode" type="_1473" offset="0" context="_636" access="public" location="f0:1617" file="f0" line="1617"/>
  <Field id="_3027" name="pad0" type="_1473" offset="8" context="_636" access="public" location="f0:1618" file="f0" line="1618"/>
  <Field id="_3028" name="length" type="_1398" offset="16" context="_636" access="public" location="f0:1619" file="f0" line="1619"/>
  <Field id="_3029" name="window" type="_684" offset="32" context="_636" access="public" location="f0:1620" file="f0" line="1620"/>
  <Destructor id="_3030" name="xcb_unmap_window_request_t" artificial="1" throw="" context="_636" access="public" mangled="_ZN26xcb_unmap_window_request_tD1Ev *INTERNAL* " demangled="xcb_unmap_window_request_t::~xcb_unmap_window_request_t()" location="f0:1616" file="f0" line="1616" endline="1616" inline="1">
  </Destructor>
  <OperatorMethod id="_3031" name="=" returns="_5447" artificial="1" throw="" context="_636" access="public" mangled="_ZN26xcb_unmap_window_request_taSERKS_" demangled="xcb_unmap_window_request_t::operator=(xcb_unmap_window_request_t const&amp;)" location="f0:1616" file="f0" line="1616" endline="1616" inline="1">
    <Argument type="_5448" location="f0:1616" file="f0" line="1616"/>
  </OperatorMethod>
  <Constructor id="_3032" name="xcb_unmap_window_request_t" artificial="1" throw="" context="_636" access="public" mangled="_ZN26xcb_unmap_window_request_tC1ERKS_ *INTERNAL* " demangled="xcb_unmap_window_request_t::xcb_unmap_window_request_t(xcb_unmap_window_request_t const&amp;)" location="f0:1616" file="f0" line="1616" endline="1616" inline="1">
    <Argument type="_5448" location="f0:1616" file="f0" line="1616"/>
  </Constructor>
  <Constructor id="_3033" name="xcb_unmap_window_request_t" artificial="1" throw="" context="_636" access="public" mangled="_ZN26xcb_unmap_window_request_tC1Ev *INTERNAL* " demangled="xcb_unmap_window_request_t::xcb_unmap_window_request_t()" location="f0:1616" file="f0" line="1616" inline="1"/>
  <PointerType id="_3034" type="_1130" size="32" align="32"/>
  <Field id="_3035" name="response_type" type="_1473" offset="0" context="_648" access="public" location="f0:4170" file="f0" line="4170"/>
  <Field id="_3036" name="names_len" type="_1473" offset="8" context="_648" access="public" location="f0:4171" file="f0" line="4171"/>
  <Field id="_3037" name="sequence" type="_1398" offset="16" context="_648" access="public" location="f0:4172" file="f0" line="4172"/>
  <Field id="_3038" name="length" type="_705" offset="32" context="_648" access="public" location="f0:4173" file="f0" line="4173"/>
  <Field id="_3039" name="pad0" type="_5449" offset="64" context="_648" access="public" location="f0:4174" file="f0" line="4174"/>
  <Destructor id="_3040" name="xcb_list_extensions_reply_t" artificial="1" throw="" context="_648" access="public" mangled="_ZN27xcb_list_extensions_reply_tD1Ev *INTERNAL* " demangled="xcb_list_extensions_reply_t::~xcb_list_extensions_reply_t()" location="f0:4169" file="f0" line="4169" endline="4169" inline="1">
  </Destructor>
  <OperatorMethod id="_3041" name="=" returns="_5450" artificial="1" throw="" context="_648" access="public" mangled="_ZN27xcb_list_extensions_reply_taSERKS_" demangled="xcb_list_extensions_reply_t::operator=(xcb_list_extensions_reply_t const&amp;)" location="f0:4169" file="f0" line="4169" endline="4169" inline="1">
    <Argument type="_5451" location="f0:4169" file="f0" line="4169"/>
  </OperatorMethod>
  <Constructor id="_3042" name="xcb_list_extensions_reply_t" artificial="1" throw="" context="_648" access="public" mangled="_ZN27xcb_list_extensions_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_list_extensions_reply_t::xcb_list_extensions_reply_t(xcb_list_extensions_reply_t const&amp;)" location="f0:4169" file="f0" line="4169" endline="4169" inline="1">
    <Argument type="_5451" location="f0:4169" file="f0" line="4169"/>
  </Constructor>
  <Constructor id="_3043" name="xcb_list_extensions_reply_t" artificial="1" throw="" context="_648" access="public" mangled="_ZN27xcb_list_extensions_reply_tC1Ev *INTERNAL* " demangled="xcb_list_extensions_reply_t::xcb_list_extensions_reply_t()" location="f0:4169" file="f0" line="4169" inline="1"/>
  <Field id="_3044" name="__sched_priority" type="_188" offset="0" context="_651" access="public" location="f13:75" file="f13" line="75"/>
  <Destructor id="_3045" name="sched_param" artificial="1" throw="" context="_651" access="public" mangled="_ZN11sched_paramD1Ev *INTERNAL* " demangled="sched_param::~sched_param()" location="f13:74" file="f13" line="74" endline="74" inline="1">
  </Destructor>
  <OperatorMethod id="_3046" name="=" returns="_5452" artificial="1" throw="" context="_651" access="public" mangled="_ZN11sched_paramaSERKS_" demangled="sched_param::operator=(sched_param const&amp;)" location="f13:74" file="f13" line="74" endline="74" inline="1">
    <Argument type="_5453" location="f13:74" file="f13" line="74"/>
  </OperatorMethod>
  <Constructor id="_3047" name="sched_param" artificial="1" throw="" context="_651" access="public" mangled="_ZN11sched_paramC1ERKS_ *INTERNAL* " demangled="sched_param::sched_param(sched_param const&amp;)" location="f13:74" file="f13" line="74" endline="74" inline="1">
    <Argument type="_5453" location="f13:74" file="f13" line="74"/>
  </Constructor>
  <Constructor id="_3048" name="sched_param" artificial="1" throw="" context="_651" access="public" mangled="_ZN11sched_paramC1Ev *INTERNAL* " demangled="sched_param::sched_param()" location="f13:74" file="f13" line="74" inline="1"/>
  <Field id="_3049" name="status" type="_1473" offset="0" context="_657" access="public" location="f0:454" file="f0" line="454"/>
  <Field id="_3050" name="pad0" type="_1473" offset="8" context="_657" access="public" location="f0:455" file="f0" line="455"/>
  <Field id="_3051" name="protocol_major_version" type="_1398" offset="16" context="_657" access="public" location="f0:456" file="f0" line="456"/>
  <Field id="_3052" name="protocol_minor_version" type="_1398" offset="32" context="_657" access="public" location="f0:457" file="f0" line="457"/>
  <Field id="_3053" name="length" type="_1398" offset="48" context="_657" access="public" location="f0:458" file="f0" line="458"/>
  <Field id="_3054" name="release_number" type="_705" offset="64" context="_657" access="public" location="f0:459" file="f0" line="459"/>
  <Field id="_3055" name="resource_id_base" type="_705" offset="96" context="_657" access="public" location="f0:460" file="f0" line="460"/>
  <Field id="_3056" name="resource_id_mask" type="_705" offset="128" context="_657" access="public" location="f0:461" file="f0" line="461"/>
  <Field id="_3057" name="motion_buffer_size" type="_705" offset="160" context="_657" access="public" location="f0:462" file="f0" line="462"/>
  <Field id="_3058" name="vendor_len" type="_1398" offset="192" context="_657" access="public" location="f0:463" file="f0" line="463"/>
  <Field id="_3059" name="maximum_request_length" type="_1398" offset="208" context="_657" access="public" location="f0:464" file="f0" line="464"/>
  <Field id="_3060" name="roots_len" type="_1473" offset="224" context="_657" access="public" location="f0:465" file="f0" line="465"/>
  <Field id="_3061" name="pixmap_formats_len" type="_1473" offset="232" context="_657" access="public" location="f0:466" file="f0" line="466"/>
  <Field id="_3062" name="image_byte_order" type="_1473" offset="240" context="_657" access="public" location="f0:467" file="f0" line="467"/>
  <Field id="_3063" name="bitmap_format_bit_order" type="_1473" offset="248" context="_657" access="public" location="f0:468" file="f0" line="468"/>
  <Field id="_3064" name="bitmap_format_scanline_unit" type="_1473" offset="256" context="_657" access="public" location="f0:469" file="f0" line="469"/>
  <Field id="_3065" name="bitmap_format_scanline_pad" type="_1473" offset="264" context="_657" access="public" location="f0:470" file="f0" line="470"/>
  <Field id="_3066" name="min_keycode" type="_911" offset="272" context="_657" access="public" location="f0:471" file="f0" line="471"/>
  <Field id="_3067" name="max_keycode" type="_911" offset="280" context="_657" access="public" location="f0:472" file="f0" line="472"/>
  <Field id="_3068" name="pad1" type="_5283" offset="288" context="_657" access="public" location="f0:473" file="f0" line="473"/>
  <Destructor id="_3069" name="xcb_setup_t" artificial="1" throw="" context="_657" access="public" mangled="_ZN11xcb_setup_tD1Ev *INTERNAL* " demangled="xcb_setup_t::~xcb_setup_t()" location="f0:453" file="f0" line="453" endline="453" inline="1">
  </Destructor>
  <OperatorMethod id="_3070" name="=" returns="_5454" artificial="1" throw="" context="_657" access="public" mangled="_ZN11xcb_setup_taSERKS_" demangled="xcb_setup_t::operator=(xcb_setup_t const&amp;)" location="f0:453" file="f0" line="453" endline="453" inline="1">
    <Argument type="_5455" location="f0:453" file="f0" line="453"/>
  </OperatorMethod>
  <Constructor id="_3071" name="xcb_setup_t" artificial="1" throw="" context="_657" access="public" mangled="_ZN11xcb_setup_tC1ERKS_ *INTERNAL* " demangled="xcb_setup_t::xcb_setup_t(xcb_setup_t const&amp;)" location="f0:453" file="f0" line="453" endline="453" inline="1">
    <Argument type="_5455" location="f0:453" file="f0" line="453"/>
  </Constructor>
  <Constructor id="_3072" name="xcb_setup_t" artificial="1" throw="" context="_657" access="public" mangled="_ZN11xcb_setup_tC1Ev *INTERNAL* " demangled="xcb_setup_t::xcb_setup_t()" location="f0:453" file="f0" line="453" inline="1"/>
  <PointerType id="_3073" type="_1730" size="32" align="32"/>
  <Field id="_3074" name="sequence" type="_100" offset="0" context="_660" access="public" location="f0:3717" file="f0" line="3717"/>
  <Destructor id="_3075" name="xcb_alloc_named_color_cookie_t" artificial="1" throw="" context="_660" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_tD1Ev *INTERNAL* " demangled="xcb_alloc_named_color_cookie_t::~xcb_alloc_named_color_cookie_t()" location="f0:3716" file="f0" line="3716" endline="3716" inline="1">
  </Destructor>
  <OperatorMethod id="_3076" name="=" returns="_5456" artificial="1" throw="" context="_660" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_taSERKS_" demangled="xcb_alloc_named_color_cookie_t::operator=(xcb_alloc_named_color_cookie_t const&amp;)" location="f0:3716" file="f0" line="3716" endline="3716" inline="1">
    <Argument type="_5457" location="f0:3716" file="f0" line="3716"/>
  </OperatorMethod>
  <Constructor id="_3077" name="xcb_alloc_named_color_cookie_t" artificial="1" throw="" context="_660" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_alloc_named_color_cookie_t::xcb_alloc_named_color_cookie_t(xcb_alloc_named_color_cookie_t const&amp;)" location="f0:3716" file="f0" line="3716" endline="3716" inline="1">
    <Argument type="_5457" location="f0:3716" file="f0" line="3716"/>
  </Constructor>
  <Constructor id="_3078" name="xcb_alloc_named_color_cookie_t" artificial="1" throw="" context="_660" access="public" mangled="_ZN30xcb_alloc_named_color_cookie_tC1Ev *INTERNAL* " demangled="xcb_alloc_named_color_cookie_t::xcb_alloc_named_color_cookie_t()" location="f0:3716" file="f0" line="3716" inline="1"/>
  <PointerType id="_3079" type="_1946" size="32" align="32"/>
  <PointerType id="_3080" type="_1948" size="32" align="32"/>
  <PointerType id="_3081" type="_1685c" size="32" align="32"/>
  <Field id="_3082" name="data" type="_5459" offset="0" context="_674" access="public" location="f0:154" file="f0" line="154"/>
  <Field id="_3083" name="rem" type="_188" offset="32" context="_674" access="public" location="f0:155" file="f0" line="155"/>
  <Field id="_3084" name="index" type="_188" offset="64" context="_674" access="public" location="f0:156" file="f0" line="156"/>
  <Destructor id="_3085" name="xcb_timestamp_iterator_t" artificial="1" throw="" context="_674" access="public" mangled="_ZN24xcb_timestamp_iterator_tD1Ev *INTERNAL* " demangled="xcb_timestamp_iterator_t::~xcb_timestamp_iterator_t()" location="f0:153" file="f0" line="153" endline="153" inline="1">
  </Destructor>
  <OperatorMethod id="_3086" name="=" returns="_5460" artificial="1" throw="" context="_674" access="public" mangled="_ZN24xcb_timestamp_iterator_taSERKS_" demangled="xcb_timestamp_iterator_t::operator=(xcb_timestamp_iterator_t const&amp;)" location="f0:153" file="f0" line="153" endline="153" inline="1">
    <Argument type="_5461" location="f0:153" file="f0" line="153"/>
  </OperatorMethod>
  <Constructor id="_3087" name="xcb_timestamp_iterator_t" artificial="1" throw="" context="_674" access="public" mangled="_ZN24xcb_timestamp_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_timestamp_iterator_t::xcb_timestamp_iterator_t(xcb_timestamp_iterator_t const&amp;)" location="f0:153" file="f0" line="153" endline="153" inline="1">
    <Argument type="_5461" location="f0:153" file="f0" line="153"/>
  </Constructor>
  <Constructor id="_3088" name="xcb_timestamp_iterator_t" artificial="1" throw="" context="_674" access="public" mangled="_ZN24xcb_timestamp_iterator_tC1Ev *INTERNAL* " demangled="xcb_timestamp_iterator_t::xcb_timestamp_iterator_t()" location="f0:153" file="f0" line="153" inline="1"/>
  <Field id="_3089" name="response_type" type="_1473" offset="0" context="_678" access="public" location="f0:694" file="f0" line="694"/>
  <Field id="_3090" name="pad0" type="_1473" offset="8" context="_678" access="public" location="f0:695" file="f0" line="695"/>
  <Field id="_3091" name="sequence" type="_1398" offset="16" context="_678" access="public" location="f0:696" file="f0" line="696"/>
  <Field id="_3092" name="window" type="_684" offset="32" context="_678" access="public" location="f0:697" file="f0" line="697"/>
  <Field id="_3093" name="x" type="_1398" offset="64" context="_678" access="public" location="f0:698" file="f0" line="698"/>
  <Field id="_3094" name="y" type="_1398" offset="80" context="_678" access="public" location="f0:699" file="f0" line="699"/>
  <Field id="_3095" name="width" type="_1398" offset="96" context="_678" access="public" location="f0:700" file="f0" line="700"/>
  <Field id="_3096" name="height" type="_1398" offset="112" context="_678" access="public" location="f0:701" file="f0" line="701"/>
  <Field id="_3097" name="count" type="_1398" offset="128" context="_678" access="public" location="f0:702" file="f0" line="702"/>
  <Field id="_3098" name="pad1" type="_5165" offset="144" context="_678" access="public" location="f0:703" file="f0" line="703"/>
  <Destructor id="_3099" name="xcb_expose_event_t" artificial="1" throw="" context="_678" access="public" mangled="_ZN18xcb_expose_event_tD1Ev *INTERNAL* " demangled="xcb_expose_event_t::~xcb_expose_event_t()" location="f0:693" file="f0" line="693" endline="693" inline="1">
  </Destructor>
  <OperatorMethod id="_3100" name="=" returns="_5462" artificial="1" throw="" context="_678" access="public" mangled="_ZN18xcb_expose_event_taSERKS_" demangled="xcb_expose_event_t::operator=(xcb_expose_event_t const&amp;)" location="f0:693" file="f0" line="693" endline="693" inline="1">
    <Argument type="_5463" location="f0:693" file="f0" line="693"/>
  </OperatorMethod>
  <Constructor id="_3101" name="xcb_expose_event_t" artificial="1" throw="" context="_678" access="public" mangled="_ZN18xcb_expose_event_tC1ERKS_ *INTERNAL* " demangled="xcb_expose_event_t::xcb_expose_event_t(xcb_expose_event_t const&amp;)" location="f0:693" file="f0" line="693" endline="693" inline="1">
    <Argument type="_5463" location="f0:693" file="f0" line="693"/>
  </Constructor>
  <Constructor id="_3102" name="xcb_expose_event_t" artificial="1" throw="" context="_678" access="public" mangled="_ZN18xcb_expose_event_tC1Ev *INTERNAL* " demangled="xcb_expose_event_t::xcb_expose_event_t()" location="f0:693" file="f0" line="693" inline="1"/>
  <Field id="_3103" name="major_opcode" type="_1473" offset="0" context="_680" access="public" location="f0:2907" file="f0" line="2907"/>
  <Field id="_3104" name="depth" type="_1473" offset="8" context="_680" access="public" location="f0:2908" file="f0" line="2908"/>
  <Field id="_3105" name="length" type="_1398" offset="16" context="_680" access="public" location="f0:2909" file="f0" line="2909"/>
  <Field id="_3106" name="pid" type="_1770" offset="32" context="_680" access="public" location="f0:2910" file="f0" line="2910"/>
  <Field id="_3107" name="drawable" type="_882" offset="64" context="_680" access="public" location="f0:2911" file="f0" line="2911"/>
  <Field id="_3108" name="width" type="_1398" offset="96" context="_680" access="public" location="f0:2912" file="f0" line="2912"/>
  <Field id="_3109" name="height" type="_1398" offset="112" context="_680" access="public" location="f0:2913" file="f0" line="2913"/>
  <Destructor id="_3110" name="xcb_create_pixmap_request_t" artificial="1" throw="" context="_680" access="public" mangled="_ZN27xcb_create_pixmap_request_tD1Ev *INTERNAL* " demangled="xcb_create_pixmap_request_t::~xcb_create_pixmap_request_t()" location="f0:2906" file="f0" line="2906" endline="2906" inline="1">
  </Destructor>
  <OperatorMethod id="_3111" name="=" returns="_5464" artificial="1" throw="" context="_680" access="public" mangled="_ZN27xcb_create_pixmap_request_taSERKS_" demangled="xcb_create_pixmap_request_t::operator=(xcb_create_pixmap_request_t const&amp;)" location="f0:2906" file="f0" line="2906" endline="2906" inline="1">
    <Argument type="_5465" location="f0:2906" file="f0" line="2906"/>
  </OperatorMethod>
  <Constructor id="_3112" name="xcb_create_pixmap_request_t" artificial="1" throw="" context="_680" access="public" mangled="_ZN27xcb_create_pixmap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_create_pixmap_request_t::xcb_create_pixmap_request_t(xcb_create_pixmap_request_t const&amp;)" location="f0:2906" file="f0" line="2906" endline="2906" inline="1">
    <Argument type="_5465" location="f0:2906" file="f0" line="2906"/>
  </Constructor>
  <Constructor id="_3113" name="xcb_create_pixmap_request_t" artificial="1" throw="" context="_680" access="public" mangled="_ZN27xcb_create_pixmap_request_tC1Ev *INTERNAL* " demangled="xcb_create_pixmap_request_t::xcb_create_pixmap_request_t()" location="f0:2906" file="f0" line="2906" inline="1"/>
  <Field id="_3114" name="response_type" type="_1473" offset="0" context="_682" access="public" location="f0:2747" file="f0" line="2747"/>
  <Field id="_3115" name="draw_direction" type="_1473" offset="8" context="_682" access="public" location="f0:2748" file="f0" line="2748"/>
  <Field id="_3116" name="sequence" type="_1398" offset="16" context="_682" access="public" location="f0:2749" file="f0" line="2749"/>
  <Field id="_3117" name="length" type="_705" offset="32" context="_682" access="public" location="f0:2750" file="f0" line="2750"/>
  <Field id="_3118" name="font_ascent" type="_887" offset="64" context="_682" access="public" location="f0:2751" file="f0" line="2751"/>
  <Field id="_3119" name="font_descent" type="_887" offset="80" context="_682" access="public" location="f0:2752" file="f0" line="2752"/>
  <Field id="_3120" name="overall_ascent" type="_887" offset="96" context="_682" access="public" location="f0:2753" file="f0" line="2753"/>
  <Field id="_3121" name="overall_descent" type="_887" offset="112" context="_682" access="public" location="f0:2754" file="f0" line="2754"/>
  <Field id="_3122" name="overall_width" type="_1361" offset="128" context="_682" access="public" location="f0:2755" file="f0" line="2755"/>
  <Field id="_3123" name="overall_left" type="_1361" offset="160" context="_682" access="public" location="f0:2756" file="f0" line="2756"/>
  <Field id="_3124" name="overall_right" type="_1361" offset="192" context="_682" access="public" location="f0:2757" file="f0" line="2757"/>
  <Destructor id="_3125" name="xcb_query_text_extents_reply_t" artificial="1" throw="" context="_682" access="public" mangled="_ZN30xcb_query_text_extents_reply_tD1Ev *INTERNAL* " demangled="xcb_query_text_extents_reply_t::~xcb_query_text_extents_reply_t()" location="f0:2746" file="f0" line="2746" endline="2746" inline="1">
  </Destructor>
  <OperatorMethod id="_3126" name="=" returns="_5466" artificial="1" throw="" context="_682" access="public" mangled="_ZN30xcb_query_text_extents_reply_taSERKS_" demangled="xcb_query_text_extents_reply_t::operator=(xcb_query_text_extents_reply_t const&amp;)" location="f0:2746" file="f0" line="2746" endline="2746" inline="1">
    <Argument type="_5467" location="f0:2746" file="f0" line="2746"/>
  </OperatorMethod>
  <Constructor id="_3127" name="xcb_query_text_extents_reply_t" artificial="1" throw="" context="_682" access="public" mangled="_ZN30xcb_query_text_extents_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_query_text_extents_reply_t::xcb_query_text_extents_reply_t(xcb_query_text_extents_reply_t const&amp;)" location="f0:2746" file="f0" line="2746" endline="2746" inline="1">
    <Argument type="_5467" location="f0:2746" file="f0" line="2746"/>
  </Constructor>
  <Constructor id="_3128" name="xcb_query_text_extents_reply_t" artificial="1" throw="" context="_682" access="public" mangled="_ZN30xcb_query_text_extents_reply_tC1Ev *INTERNAL* " demangled="xcb_query_text_extents_reply_t::xcb_query_text_extents_reply_t()" location="f0:2746" file="f0" line="2746" inline="1"/>
  <Field id="_3129" name="major_opcode" type="_1473" offset="0" context="_685" access="public" location="f0:2502" file="f0" line="2502"/>
  <Field id="_3130" name="pad0" type="_1473" offset="8" context="_685" access="public" location="f0:2503" file="f0" line="2503"/>
  <Field id="_3131" name="length" type="_1398" offset="16" context="_685" access="public" location="f0:2504" file="f0" line="2504"/>
  <Field id="_3132" name="src_window" type="_684" offset="32" context="_685" access="public" location="f0:2505" file="f0" line="2505"/>
  <Field id="_3133" name="dst_window" type="_684" offset="64" context="_685" access="public" location="f0:2506" file="f0" line="2506"/>
  <Field id="_3134" name="src_x" type="_887" offset="96" context="_685" access="public" location="f0:2507" file="f0" line="2507"/>
  <Field id="_3135" name="src_y" type="_887" offset="112" context="_685" access="public" location="f0:2508" file="f0" line="2508"/>
  <Field id="_3136" name="src_width" type="_1398" offset="128" context="_685" access="public" location="f0:2509" file="f0" line="2509"/>
  <Field id="_3137" name="src_height" type="_1398" offset="144" context="_685" access="public" location="f0:2510" file="f0" line="2510"/>
  <Field id="_3138" name="dst_x" type="_887" offset="160" context="_685" access="public" location="f0:2511" file="f0" line="2511"/>
  <Field id="_3139" name="dst_y" type="_887" offset="176" context="_685" access="public" location="f0:2512" file="f0" line="2512"/>
  <Destructor id="_3140" name="xcb_warp_pointer_request_t" artificial="1" throw="" context="_685" access="public" mangled="_ZN26xcb_warp_pointer_request_tD1Ev *INTERNAL* " demangled="xcb_warp_pointer_request_t::~xcb_warp_pointer_request_t()" location="f0:2501" file="f0" line="2501" endline="2501" inline="1">
  </Destructor>
  <OperatorMethod id="_3141" name="=" returns="_5468" artificial="1" throw="" context="_685" access="public" mangled="_ZN26xcb_warp_pointer_request_taSERKS_" demangled="xcb_warp_pointer_request_t::operator=(xcb_warp_pointer_request_t const&amp;)" location="f0:2501" file="f0" line="2501" endline="2501" inline="1">
    <Argument type="_5469" location="f0:2501" file="f0" line="2501"/>
  </OperatorMethod>
  <Constructor id="_3142" name="xcb_warp_pointer_request_t" artificial="1" throw="" context="_685" access="public" mangled="_ZN26xcb_warp_pointer_request_tC1ERKS_ *INTERNAL* " demangled="xcb_warp_pointer_request_t::xcb_warp_pointer_request_t(xcb_warp_pointer_request_t const&amp;)" location="f0:2501" file="f0" line="2501" endline="2501" inline="1">
    <Argument type="_5469" location="f0:2501" file="f0" line="2501"/>
  </Constructor>
  <Constructor id="_3143" name="xcb_warp_pointer_request_t" artificial="1" throw="" context="_685" access="public" mangled="_ZN26xcb_warp_pointer_request_tC1Ev *INTERNAL* " demangled="xcb_warp_pointer_request_t::xcb_warp_pointer_request_t()" location="f0:2501" file="f0" line="2501" inline="1"/>
  <Field id="_3144" name="sequence" type="_100" offset="0" context="_687" access="public" location="f0:3646" file="f0" line="3646"/>
  <Destructor id="_3145" name="xcb_list_installed_colormaps_cookie_t" artificial="1" throw="" context="_687" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_tD1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_cookie_t::~xcb_list_installed_colormaps_cookie_t()" location="f0:3645" file="f0" line="3645" endline="3645" inline="1">
  </Destructor>
  <OperatorMethod id="_3146" name="=" returns="_5470" artificial="1" throw="" context="_687" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_taSERKS_" demangled="xcb_list_installed_colormaps_cookie_t::operator=(xcb_list_installed_colormaps_cookie_t const&amp;)" location="f0:3645" file="f0" line="3645" endline="3645" inline="1">
    <Argument type="_5471" location="f0:3645" file="f0" line="3645"/>
  </OperatorMethod>
  <Constructor id="_3147" name="xcb_list_installed_colormaps_cookie_t" artificial="1" throw="" context="_687" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_list_installed_colormaps_cookie_t::xcb_list_installed_colormaps_cookie_t(xcb_list_installed_colormaps_cookie_t const&amp;)" location="f0:3645" file="f0" line="3645" endline="3645" inline="1">
    <Argument type="_5471" location="f0:3645" file="f0" line="3645"/>
  </Constructor>
  <Constructor id="_3148" name="xcb_list_installed_colormaps_cookie_t" artificial="1" throw="" context="_687" access="public" mangled="_ZN37xcb_list_installed_colormaps_cookie_tC1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_cookie_t::xcb_list_installed_colormaps_cookie_t()" location="f0:3645" file="f0" line="3645" inline="1"/>
  <Field id="_3149" name="namelen" type="_188" offset="0" context="_689" access="public" location="f15:209" file="f15" line="209"/>
  <Field id="_3150" name="name" type="_1590" offset="32" context="_689" access="public" location="f15:210" file="f15" line="210"/>
  <Field id="_3151" name="datalen" type="_188" offset="64" context="_689" access="public" location="f15:211" file="f15" line="211"/>
  <Field id="_3152" name="data" type="_1590" offset="96" context="_689" access="public" location="f15:212" file="f15" line="212"/>
  <Destructor id="_3153" name="xcb_auth_info_t" artificial="1" throw="" context="_689" access="public" mangled="_ZN15xcb_auth_info_tD1Ev *INTERNAL* " demangled="xcb_auth_info_t::~xcb_auth_info_t()" location="f15:208" file="f15" line="208" endline="208" inline="1">
  </Destructor>
  <OperatorMethod id="_3154" name="=" returns="_5472" artificial="1" throw="" context="_689" access="public" mangled="_ZN15xcb_auth_info_taSERKS_" demangled="xcb_auth_info_t::operator=(xcb_auth_info_t const&amp;)" location="f15:208" file="f15" line="208" endline="208" inline="1">
    <Argument type="_5473" location="f15:208" file="f15" line="208"/>
  </OperatorMethod>
  <Constructor id="_3155" name="xcb_auth_info_t" artificial="1" throw="" context="_689" access="public" mangled="_ZN15xcb_auth_info_tC1ERKS_ *INTERNAL* " demangled="xcb_auth_info_t::xcb_auth_info_t(xcb_auth_info_t const&amp;)" location="f15:208" file="f15" line="208" endline="208" inline="1">
    <Argument type="_5473" location="f15:208" file="f15" line="208"/>
  </Constructor>
  <Constructor id="_3156" name="xcb_auth_info_t" artificial="1" throw="" context="_689" access="public" mangled="_ZN15xcb_auth_info_tC1Ev *INTERNAL* " demangled="xcb_auth_info_t::xcb_auth_info_t()" location="f15:208" file="f15" line="208" inline="1"/>
  <Field id="_3157" name="response_type" type="_1473" offset="0" context="_692" access="public" location="f0:1814" file="f0" line="1814"/>
  <Field id="_3158" name="pad0" type="_1473" offset="8" context="_692" access="public" location="f0:1815" file="f0" line="1815"/>
  <Field id="_3159" name="sequence" type="_1398" offset="16" context="_692" access="public" location="f0:1816" file="f0" line="1816"/>
  <Field id="_3160" name="length" type="_705" offset="32" context="_692" access="public" location="f0:1817" file="f0" line="1817"/>
  <Field id="_3161" name="name_len" type="_1398" offset="64" context="_692" access="public" location="f0:1818" file="f0" line="1818"/>
  <Field id="_3162" name="pad1" type="_5182" offset="80" context="_692" access="public" location="f0:1819" file="f0" line="1819"/>
  <Destructor id="_3163" name="xcb_get_atom_name_reply_t" artificial="1" throw="" context="_692" access="public" mangled="_ZN25xcb_get_atom_name_reply_tD1Ev *INTERNAL* " demangled="xcb_get_atom_name_reply_t::~xcb_get_atom_name_reply_t()" location="f0:1813" file="f0" line="1813" endline="1813" inline="1">
  </Destructor>
  <OperatorMethod id="_3164" name="=" returns="_5474" artificial="1" throw="" context="_692" access="public" mangled="_ZN25xcb_get_atom_name_reply_taSERKS_" demangled="xcb_get_atom_name_reply_t::operator=(xcb_get_atom_name_reply_t const&amp;)" location="f0:1813" file="f0" line="1813" endline="1813" inline="1">
    <Argument type="_5475" location="f0:1813" file="f0" line="1813"/>
  </OperatorMethod>
  <Constructor id="_3165" name="xcb_get_atom_name_reply_t" artificial="1" throw="" context="_692" access="public" mangled="_ZN25xcb_get_atom_name_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_atom_name_reply_t::xcb_get_atom_name_reply_t(xcb_get_atom_name_reply_t const&amp;)" location="f0:1813" file="f0" line="1813" endline="1813" inline="1">
    <Argument type="_5475" location="f0:1813" file="f0" line="1813"/>
  </Constructor>
  <Constructor id="_3166" name="xcb_get_atom_name_reply_t" artificial="1" throw="" context="_692" access="public" mangled="_ZN25xcb_get_atom_name_reply_tC1Ev *INTERNAL* " demangled="xcb_get_atom_name_reply_t::xcb_get_atom_name_reply_t()" location="f0:1813" file="f0" line="1813" inline="1"/>
  <Field id="_3167" name="pixel" type="_705" offset="0" context="_694" access="public" location="f0:3851" file="f0" line="3851"/>
  <Field id="_3168" name="red" type="_1398" offset="32" context="_694" access="public" location="f0:3852" file="f0" line="3852"/>
  <Field id="_3169" name="green" type="_1398" offset="48" context="_694" access="public" location="f0:3853" file="f0" line="3853"/>
  <Field id="_3170" name="blue" type="_1398" offset="64" context="_694" access="public" location="f0:3854" file="f0" line="3854"/>
  <Field id="_3171" name="flags" type="_1473" offset="80" context="_694" access="public" location="f0:3855" file="f0" line="3855"/>
  <Field id="_3172" name="pad0" type="_1473" offset="88" context="_694" access="public" location="f0:3856" file="f0" line="3856"/>
  <Destructor id="_3173" name="xcb_coloritem_t" artificial="1" throw="" context="_694" access="public" mangled="_ZN15xcb_coloritem_tD1Ev *INTERNAL* " demangled="xcb_coloritem_t::~xcb_coloritem_t()" location="f0:3850" file="f0" line="3850" endline="3850" inline="1">
  </Destructor>
  <OperatorMethod id="_3174" name="=" returns="_5476" artificial="1" throw="" context="_694" access="public" mangled="_ZN15xcb_coloritem_taSERKS_" demangled="xcb_coloritem_t::operator=(xcb_coloritem_t const&amp;)" location="f0:3850" file="f0" line="3850" endline="3850" inline="1">
    <Argument type="_5477" location="f0:3850" file="f0" line="3850"/>
  </OperatorMethod>
  <Constructor id="_3175" name="xcb_coloritem_t" artificial="1" throw="" context="_694" access="public" mangled="_ZN15xcb_coloritem_tC1ERKS_ *INTERNAL* " demangled="xcb_coloritem_t::xcb_coloritem_t(xcb_coloritem_t const&amp;)" location="f0:3850" file="f0" line="3850" endline="3850" inline="1">
    <Argument type="_5477" location="f0:3850" file="f0" line="3850"/>
  </Constructor>
  <Constructor id="_3176" name="xcb_coloritem_t" artificial="1" throw="" context="_694" access="public" mangled="_ZN15xcb_coloritem_tC1Ev *INTERNAL* " demangled="xcb_coloritem_t::xcb_coloritem_t()" location="f0:3850" file="f0" line="3850" inline="1"/>
  <Field id="_3177" name="major_opcode" type="_1473" offset="0" context="_699" access="public" location="f0:3875" file="f0" line="3875"/>
  <Field id="_3178" name="pad0" type="_1473" offset="8" context="_699" access="public" location="f0:3876" file="f0" line="3876"/>
  <Field id="_3179" name="length" type="_1398" offset="16" context="_699" access="public" location="f0:3877" file="f0" line="3877"/>
  <Field id="_3180" name="cmap" type="_724" offset="32" context="_699" access="public" location="f0:3878" file="f0" line="3878"/>
  <Destructor id="_3181" name="xcb_store_colors_request_t" artificial="1" throw="" context="_699" access="public" mangled="_ZN26xcb_store_colors_request_tD1Ev *INTERNAL* " demangled="xcb_store_colors_request_t::~xcb_store_colors_request_t()" location="f0:3874" file="f0" line="3874" endline="3874" inline="1">
  </Destructor>
  <OperatorMethod id="_3182" name="=" returns="_5478" artificial="1" throw="" context="_699" access="public" mangled="_ZN26xcb_store_colors_request_taSERKS_" demangled="xcb_store_colors_request_t::operator=(xcb_store_colors_request_t const&amp;)" location="f0:3874" file="f0" line="3874" endline="3874" inline="1">
    <Argument type="_5479" location="f0:3874" file="f0" line="3874"/>
  </OperatorMethod>
  <Constructor id="_3183" name="xcb_store_colors_request_t" artificial="1" throw="" context="_699" access="public" mangled="_ZN26xcb_store_colors_request_tC1ERKS_ *INTERNAL* " demangled="xcb_store_colors_request_t::xcb_store_colors_request_t(xcb_store_colors_request_t const&amp;)" location="f0:3874" file="f0" line="3874" endline="3874" inline="1">
    <Argument type="_5479" location="f0:3874" file="f0" line="3874"/>
  </Constructor>
  <Constructor id="_3184" name="xcb_store_colors_request_t" artificial="1" throw="" context="_699" access="public" mangled="_ZN26xcb_store_colors_request_tC1Ev *INTERNAL* " demangled="xcb_store_colors_request_t::xcb_store_colors_request_t()" location="f0:3874" file="f0" line="3874" inline="1"/>
  <PointerType id="_3185" type="_1416" size="32" align="32"/>
  <Field id="_3186" name="major_opcode" type="_1473" offset="0" context="_707" access="public" location="f0:3145" file="f0" line="3145"/>
  <Field id="_3187" name="pad0" type="_1473" offset="8" context="_707" access="public" location="f0:3146" file="f0" line="3146"/>
  <Field id="_3188" name="length" type="_1398" offset="16" context="_707" access="public" location="f0:3147" file="f0" line="3147"/>
  <Field id="_3189" name="cid" type="_1801" offset="32" context="_707" access="public" location="f0:3148" file="f0" line="3148"/>
  <Field id="_3190" name="drawable" type="_882" offset="64" context="_707" access="public" location="f0:3149" file="f0" line="3149"/>
  <Field id="_3191" name="value_mask" type="_705" offset="96" context="_707" access="public" location="f0:3150" file="f0" line="3150"/>
  <Destructor id="_3192" name="xcb_create_gc_request_t" artificial="1" throw="" context="_707" access="public" mangled="_ZN23xcb_create_gc_request_tD1Ev *INTERNAL* " demangled="xcb_create_gc_request_t::~xcb_create_gc_request_t()" location="f0:3144" file="f0" line="3144" endline="3144" inline="1">
  </Destructor>
  <OperatorMethod id="_3193" name="=" returns="_5480" artificial="1" throw="" context="_707" access="public" mangled="_ZN23xcb_create_gc_request_taSERKS_" demangled="xcb_create_gc_request_t::operator=(xcb_create_gc_request_t const&amp;)" location="f0:3144" file="f0" line="3144" endline="3144" inline="1">
    <Argument type="_5481" location="f0:3144" file="f0" line="3144"/>
  </OperatorMethod>
  <Constructor id="_3194" name="xcb_create_gc_request_t" artificial="1" throw="" context="_707" access="public" mangled="_ZN23xcb_create_gc_request_tC1ERKS_ *INTERNAL* " demangled="xcb_create_gc_request_t::xcb_create_gc_request_t(xcb_create_gc_request_t const&amp;)" location="f0:3144" file="f0" line="3144" endline="3144" inline="1">
    <Argument type="_5481" location="f0:3144" file="f0" line="3144"/>
  </Constructor>
  <Constructor id="_3195" name="xcb_create_gc_request_t" artificial="1" throw="" context="_707" access="public" mangled="_ZN23xcb_create_gc_request_tC1Ev *INTERNAL* " demangled="xcb_create_gc_request_t::xcb_create_gc_request_t()" location="f0:3144" file="f0" line="3144" inline="1"/>
  <Field id="_3196" name="x" type="_887" offset="0" context="_710" access="public" location="f0:213" file="f0" line="213"/>
  <Field id="_3197" name="y" type="_887" offset="16" context="_710" access="public" location="f0:214" file="f0" line="214"/>
  <Field id="_3198" name="width" type="_1398" offset="32" context="_710" access="public" location="f0:215" file="f0" line="215"/>
  <Field id="_3199" name="height" type="_1398" offset="48" context="_710" access="public" location="f0:216" file="f0" line="216"/>
  <Destructor id="_3200" name="xcb_rectangle_t" artificial="1" throw="" context="_710" access="public" mangled="_ZN15xcb_rectangle_tD1Ev *INTERNAL* " demangled="xcb_rectangle_t::~xcb_rectangle_t()" location="f0:212" file="f0" line="212" endline="212" inline="1">
  </Destructor>
  <OperatorMethod id="_3201" name="=" returns="_5482" artificial="1" throw="" context="_710" access="public" mangled="_ZN15xcb_rectangle_taSERKS_" demangled="xcb_rectangle_t::operator=(xcb_rectangle_t const&amp;)" location="f0:212" file="f0" line="212" endline="212" inline="1">
    <Argument type="_5483" location="f0:212" file="f0" line="212"/>
  </OperatorMethod>
  <Constructor id="_3202" name="xcb_rectangle_t" artificial="1" throw="" context="_710" access="public" mangled="_ZN15xcb_rectangle_tC1ERKS_ *INTERNAL* " demangled="xcb_rectangle_t::xcb_rectangle_t(xcb_rectangle_t const&amp;)" location="f0:212" file="f0" line="212" endline="212" inline="1">
    <Argument type="_5483" location="f0:212" file="f0" line="212"/>
  </Constructor>
  <Constructor id="_3203" name="xcb_rectangle_t" artificial="1" throw="" context="_710" access="public" mangled="_ZN15xcb_rectangle_tC1Ev *INTERNAL* " demangled="xcb_rectangle_t::xcb_rectangle_t()" location="f0:212" file="f0" line="212" inline="1"/>
  <PointerType id="_3204" type="_1508" size="32" align="32"/>
  <PointerType id="_3205" type="_1745c" size="32" align="32"/>
  <PointerType id="_3206" type="_437" size="32" align="32"/>
  <Field id="_3207" name="sequence" type="_100" offset="0" context="_719" access="public" location="f0:4082" file="f0" line="4082"/>
  <Destructor id="_3208" name="xcb_query_best_size_cookie_t" artificial="1" throw="" context="_719" access="public" mangled="_ZN28xcb_query_best_size_cookie_tD1Ev *INTERNAL* " demangled="xcb_query_best_size_cookie_t::~xcb_query_best_size_cookie_t()" location="f0:4081" file="f0" line="4081" endline="4081" inline="1">
  </Destructor>
  <OperatorMethod id="_3209" name="=" returns="_5485" artificial="1" throw="" context="_719" access="public" mangled="_ZN28xcb_query_best_size_cookie_taSERKS_" demangled="xcb_query_best_size_cookie_t::operator=(xcb_query_best_size_cookie_t const&amp;)" location="f0:4081" file="f0" line="4081" endline="4081" inline="1">
    <Argument type="_5486" location="f0:4081" file="f0" line="4081"/>
  </OperatorMethod>
  <Constructor id="_3210" name="xcb_query_best_size_cookie_t" artificial="1" throw="" context="_719" access="public" mangled="_ZN28xcb_query_best_size_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_query_best_size_cookie_t::xcb_query_best_size_cookie_t(xcb_query_best_size_cookie_t const&amp;)" location="f0:4081" file="f0" line="4081" endline="4081" inline="1">
    <Argument type="_5486" location="f0:4081" file="f0" line="4081"/>
  </Constructor>
  <Constructor id="_3211" name="xcb_query_best_size_cookie_t" artificial="1" throw="" context="_719" access="public" mangled="_ZN28xcb_query_best_size_cookie_tC1Ev *INTERNAL* " demangled="xcb_query_best_size_cookie_t::xcb_query_best_size_cookie_t()" location="f0:4081" file="f0" line="4081" inline="1"/>
  <Field id="_3212" name="response_type" type="_1473" offset="0" context="_726" access="public" location="f0:4217" file="f0" line="4217"/>
  <Field id="_3213" name="keysyms_per_keycode" type="_1473" offset="8" context="_726" access="public" location="f0:4218" file="f0" line="4218"/>
  <Field id="_3214" name="sequence" type="_1398" offset="16" context="_726" access="public" location="f0:4219" file="f0" line="4219"/>
  <Field id="_3215" name="length" type="_705" offset="32" context="_726" access="public" location="f0:4220" file="f0" line="4220"/>
  <Field id="_3216" name="pad0" type="_5449" offset="64" context="_726" access="public" location="f0:4221" file="f0" line="4221"/>
  <Destructor id="_3217" name="xcb_get_keyboard_mapping_reply_t" artificial="1" throw="" context="_726" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_tD1Ev *INTERNAL* " demangled="xcb_get_keyboard_mapping_reply_t::~xcb_get_keyboard_mapping_reply_t()" location="f0:4216" file="f0" line="4216" endline="4216" inline="1">
  </Destructor>
  <OperatorMethod id="_3218" name="=" returns="_5487" artificial="1" throw="" context="_726" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_taSERKS_" demangled="xcb_get_keyboard_mapping_reply_t::operator=(xcb_get_keyboard_mapping_reply_t const&amp;)" location="f0:4216" file="f0" line="4216" endline="4216" inline="1">
    <Argument type="_5488" location="f0:4216" file="f0" line="4216"/>
  </OperatorMethod>
  <Constructor id="_3219" name="xcb_get_keyboard_mapping_reply_t" artificial="1" throw="" context="_726" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_get_keyboard_mapping_reply_t::xcb_get_keyboard_mapping_reply_t(xcb_get_keyboard_mapping_reply_t const&amp;)" location="f0:4216" file="f0" line="4216" endline="4216" inline="1">
    <Argument type="_5488" location="f0:4216" file="f0" line="4216"/>
  </Constructor>
  <Constructor id="_3220" name="xcb_get_keyboard_mapping_reply_t" artificial="1" throw="" context="_726" access="public" mangled="_ZN32xcb_get_keyboard_mapping_reply_tC1Ev *INTERNAL* " demangled="xcb_get_keyboard_mapping_reply_t::xcb_get_keyboard_mapping_reply_t()" location="f0:4216" file="f0" line="4216" inline="1"/>
  <PointerType id="_3221" type="_40" size="32" align="32"/>
  <PointerType id="_3222" type="_256" size="32" align="32"/>
  <Field id="_3223" name="x" type="_887" offset="0" context="_733" access="public" location="f0:232" file="f0" line="232"/>
  <Field id="_3224" name="y" type="_887" offset="16" context="_733" access="public" location="f0:233" file="f0" line="233"/>
  <Field id="_3225" name="width" type="_1398" offset="32" context="_733" access="public" location="f0:234" file="f0" line="234"/>
  <Field id="_3226" name="height" type="_1398" offset="48" context="_733" access="public" location="f0:235" file="f0" line="235"/>
  <Field id="_3227" name="angle1" type="_887" offset="64" context="_733" access="public" location="f0:236" file="f0" line="236"/>
  <Field id="_3228" name="angle2" type="_887" offset="80" context="_733" access="public" location="f0:237" file="f0" line="237"/>
  <Destructor id="_3229" name="xcb_arc_t" artificial="1" throw="" context="_733" access="public" mangled="_ZN9xcb_arc_tD1Ev *INTERNAL* " demangled="xcb_arc_t::~xcb_arc_t()" location="f0:231" file="f0" line="231" endline="231" inline="1">
  </Destructor>
  <OperatorMethod id="_3230" name="=" returns="_5489" artificial="1" throw="" context="_733" access="public" mangled="_ZN9xcb_arc_taSERKS_" demangled="xcb_arc_t::operator=(xcb_arc_t const&amp;)" location="f0:231" file="f0" line="231" endline="231" inline="1">
    <Argument type="_5490" location="f0:231" file="f0" line="231"/>
  </OperatorMethod>
  <Constructor id="_3231" name="xcb_arc_t" artificial="1" throw="" context="_733" access="public" mangled="_ZN9xcb_arc_tC1ERKS_ *INTERNAL* " demangled="xcb_arc_t::xcb_arc_t(xcb_arc_t const&amp;)" location="f0:231" file="f0" line="231" endline="231" inline="1">
    <Argument type="_5490" location="f0:231" file="f0" line="231"/>
  </Constructor>
  <Constructor id="_3232" name="xcb_arc_t" artificial="1" throw="" context="_733" access="public" mangled="_ZN9xcb_arc_tC1Ev *INTERNAL* " demangled="xcb_arc_t::xcb_arc_t()" location="f0:231" file="f0" line="231" inline="1"/>
  <Field id="_3233" name="major_opcode" type="_1473" offset="0" context="_737" access="public" location="f0:3656" file="f0" line="3656"/>
  <Field id="_3234" name="pad0" type="_1473" offset="8" context="_737" access="public" location="f0:3657" file="f0" line="3657"/>
  <Field id="_3235" name="length" type="_1398" offset="16" context="_737" access="public" location="f0:3658" file="f0" line="3658"/>
  <Field id="_3236" name="window" type="_684" offset="32" context="_737" access="public" location="f0:3659" file="f0" line="3659"/>
  <Destructor id="_3237" name="xcb_list_installed_colormaps_request_t" artificial="1" throw="" context="_737" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_tD1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_request_t::~xcb_list_installed_colormaps_request_t()" location="f0:3655" file="f0" line="3655" endline="3655" inline="1">
  </Destructor>
  <OperatorMethod id="_3238" name="=" returns="_5491" artificial="1" throw="" context="_737" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_taSERKS_" demangled="xcb_list_installed_colormaps_request_t::operator=(xcb_list_installed_colormaps_request_t const&amp;)" location="f0:3655" file="f0" line="3655" endline="3655" inline="1">
    <Argument type="_5492" location="f0:3655" file="f0" line="3655"/>
  </OperatorMethod>
  <Constructor id="_3239" name="xcb_list_installed_colormaps_request_t" artificial="1" throw="" context="_737" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_tC1ERKS_ *INTERNAL* " demangled="xcb_list_installed_colormaps_request_t::xcb_list_installed_colormaps_request_t(xcb_list_installed_colormaps_request_t const&amp;)" location="f0:3655" file="f0" line="3655" endline="3655" inline="1">
    <Argument type="_5492" location="f0:3655" file="f0" line="3655"/>
  </Constructor>
  <Constructor id="_3240" name="xcb_list_installed_colormaps_request_t" artificial="1" throw="" context="_737" access="public" mangled="_ZN38xcb_list_installed_colormaps_request_tC1Ev *INTERNAL* " demangled="xcb_list_installed_colormaps_request_t::xcb_list_installed_colormaps_request_t()" location="f0:3655" file="f0" line="3655" inline="1"/>
  <Field id="_3241" name="sequence" type="_100" offset="0" context="_741" access="public" location="f0:2054" file="f0" line="2054"/>
  <Destructor id="_3242" name="xcb_grab_pointer_cookie_t" artificial="1" throw="" context="_741" access="public" mangled="_ZN25xcb_grab_pointer_cookie_tD1Ev *INTERNAL* " demangled="xcb_grab_pointer_cookie_t::~xcb_grab_pointer_cookie_t()" location="f0:2053" file="f0" line="2053" endline="2053" inline="1">
  </Destructor>
  <OperatorMethod id="_3243" name="=" returns="_5493" artificial="1" throw="" context="_741" access="public" mangled="_ZN25xcb_grab_pointer_cookie_taSERKS_" demangled="xcb_grab_pointer_cookie_t::operator=(xcb_grab_pointer_cookie_t const&amp;)" location="f0:2053" file="f0" line="2053" endline="2053" inline="1">
    <Argument type="_5494" location="f0:2053" file="f0" line="2053"/>
  </OperatorMethod>
  <Constructor id="_3244" name="xcb_grab_pointer_cookie_t" artificial="1" throw="" context="_741" access="public" mangled="_ZN25xcb_grab_pointer_cookie_tC1ERKS_ *INTERNAL* " demangled="xcb_grab_pointer_cookie_t::xcb_grab_pointer_cookie_t(xcb_grab_pointer_cookie_t const&amp;)" location="f0:2053" file="f0" line="2053" endline="2053" inline="1">
    <Argument type="_5494" location="f0:2053" file="f0" line="2053"/>
  </Constructor>
  <Constructor id="_3245" name="xcb_grab_pointer_cookie_t" artificial="1" throw="" context="_741" access="public" mangled="_ZN25xcb_grab_pointer_cookie_tC1Ev *INTERNAL* " demangled="xcb_grab_pointer_cookie_t::xcb_grab_pointer_cookie_t()" location="f0:2053" file="f0" line="2053" inline="1"/>
  <PointerType id="_3246" type="_1503" size="32" align="32"/>
  <Field id="_3247" name="major_opcode" type="_1473" offset="0" context="_749" access="public" location="f0:3596" file="f0" line="3596"/>
  <Field id="_3248" name="pad0" type="_1473" offset="8" context="_749" access="public" location="f0:3597" file="f0" line="3597"/>
  <Field id="_3249" name="length" type="_1398" offset="16" context="_749" access="public" location="f0:3598" file="f0" line="3598"/>
  <Field id="_3250" name="cmap" type="_724" offset="32" context="_749" access="public" location="f0:3599" file="f0" line="3599"/>
  <Destructor id="_3251" name="xcb_free_colormap_request_t" artificial="1" throw="" context="_749" access="public" mangled="_ZN27xcb_free_colormap_request_tD1Ev *INTERNAL* " demangled="xcb_free_colormap_request_t::~xcb_free_colormap_request_t()" location="f0:3595" file="f0" line="3595" endline="3595" inline="1">
  </Destructor>
  <OperatorMethod id="_3252" name="=" returns="_5495" artificial="1" throw="" context="_749" access="public" mangled="_ZN27xcb_free_colormap_request_taSERKS_" demangled="xcb_free_colormap_request_t::operator=(xcb_free_colormap_request_t const&amp;)" location="f0:3595" file="f0" line="3595" endline="3595" inline="1">
    <Argument type="_5496" location="f0:3595" file="f0" line="3595"/>
  </OperatorMethod>
  <Constructor id="_3253" name="xcb_free_colormap_request_t" artificial="1" throw="" context="_749" access="public" mangled="_ZN27xcb_free_colormap_request_tC1ERKS_ *INTERNAL* " demangled="xcb_free_colormap_request_t::xcb_free_colormap_request_t(xcb_free_colormap_request_t const&amp;)" location="f0:3595" file="f0" line="3595" endline="3595" inline="1">
    <Argument type="_5496" location="f0:3595" file="f0" line="3595"/>
  </Constructor>
  <Constructor id="_3254" name="xcb_free_colormap_request_t" artificial="1" throw="" context="_749" access="public" mangled="_ZN27xcb_free_colormap_request_tC1Ev *INTERNAL* " demangled="xcb_free_colormap_request_t::xcb_free_colormap_request_t()" location="f0:3595" file="f0" line="3595" inline="1"/>
  <Field id="_3255" name="response_type" type="_1473" offset="0" context="_752" access="public" location="f0:663" file="f0" line="663"/>
  <Field id="_3256" name="detail" type="_1473" offset="8" context="_752" access="public" location="f0:664" file="f0" line="664"/>
  <Field id="_3257" name="sequence" type="_1398" offset="16" context="_752" access="public" location="f0:665" file="f0" line="665"/>
  <Field id="_3258" name="event" type="_684" offset="32" context="_752" access="public" location="f0:666" file="f0" line="666"/>
  <Field id="_3259" name="mode" type="_1473" offset="64" context="_752" access="public" location="f0:667" file="f0" line="667"/>
  <Field id="_3260" name="pad0" type="_5171" offset="72" context="_752" access="public" location="f0:668" file="f0" line="668"/>
  <Destructor id="_3261" name="xcb_focus_in_event_t" artificial="1" throw="" context="_752" access="public" mangled="_ZN20xcb_focus_in_event_tD1Ev *INTERNAL* " demangled="xcb_focus_in_event_t::~xcb_focus_in_event_t()" location="f0:662" file="f0" line="662" endline="662" inline="1">
  </Destructor>
  <OperatorMethod id="_3262" name="=" returns="_5497" artificial="1" throw="" context="_752" access="public" mangled="_ZN20xcb_focus_in_event_taSERKS_" demangled="xcb_focus_in_event_t::operator=(xcb_focus_in_event_t const&amp;)" location="f0:662" file="f0" line="662" endline="662" inline="1">
    <Argument type="_5498" location="f0:662" file="f0" line="662"/>
  </OperatorMethod>
  <Constructor id="_3263" name="xcb_focus_in_event_t" artificial="1" throw="" context="_752" access="public" mangled="_ZN20xcb_focus_in_event_tC1ERKS_ *INTERNAL* " demangled="xcb_focus_in_event_t::xcb_focus_in_event_t(xcb_focus_in_event_t const&amp;)" location="f0:662" file="f0" line="662" endline="662" inline="1">
    <Argument type="_5498" location="f0:662" file="f0" line="662"/>
  </Constructor>
  <Constructor id="_3264" name="xcb_focus_in_event_t" artificial="1" throw="" context="_752" access="public" mangled="_ZN20xcb_focus_in_event_tC1Ev *INTERNAL* " demangled="xcb_focus_in_event_t::xcb_focus_in_event_t()" location="f0:662" file="f0" line="662" inline="1"/>
  <Field id="_3265" name="data" type="_507" offset="0" context="_754" access="public" location="f15:110" file="f15" line="110"/>
  <Field id="_3266" name="rem" type="_188" offset="32" context="_754" access="public" location="f15:111" file="f15" line="111"/>
  <Field id="_3267" name="index" type="_188" offset="64" context="_754" access="public" location="f15:112" file="f15" line="112"/>
  <Destructor id="_3268" name="._27" artificial="1" throw="" context="_754" access="public" mangled="_ZN22xcb_generic_iterator_tD1Ev *INTERNAL* " demangled="xcb_generic_iterator_t::~xcb_generic_iterator_t()" location="f15:113" file="f15" line="113" endline="113" inline="1">
  </Destructor>
  <OperatorMethod id="_3269" name="=" returns="_5499" artificial="1" throw="" context="_754" access="public" mangled="_ZN22xcb_generic_iterator_taSERKS_" demangled="xcb_generic_iterator_t::operator=(xcb_generic_iterator_t const&amp;)" location="f15:113" file="f15" line="113" endline="113" inline="1">
    <Argument type="_5500" location="f15:109" file="f15" line="109"/>
  </OperatorMethod>
  <Constructor id="_3270" name="._27" artificial="1" throw="" context="_754" access="public" mangled="_ZN22xcb_generic_iterator_tC1ERKS_ *INTERNAL* " demangled="xcb_generic_iterator_t::xcb_generic_iterator_t(xcb_generic_iterator_t const&amp;)" location="f15:113" file="f15" line="113" endline="113" inline="1">
    <Argument type="_5500" location="f15:109" file="f15" line="109"/>
  </Constructor>
  <Constructor id="_3271" name="._27" artificial="1" throw="" context="_754" access="public" mangled="_ZN22xcb_generic_iterator_tC1Ev *INTERNAL* " demangled="xcb_generic_iterator_t::xcb_generic_iterator_t()" location="f15:113" file="f15" line="113" inline="1"/>
  <Field id="_3272" name="response_type" type="_1473" offset="0" context="_760" access="public" location="f0:4679" file="f0" line="4679"/>
  <Field id="_3273" name="status" type="_1473" offset="8" context="_760" access="public" location="f0:4680" file="f0" line="4680"/>
  <Field id="_3274" name="sequence" type="_1398" offset="16" context="_760" access="public" location="f0:4681" file="f0" line="4681"/>
  <Field id="_3275" name="length" type="_705" offset="32" context="_760" access="public" location="f0:4682" file="f0" line="4682"/>
  <Destructor id="_3276" name="xcb_set_modifier_mapping_reply_t" artificial="1" throw="" context="_760" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_tD1Ev *INTERNAL* " demangled="xcb_set_modifier_mapping_reply_t::~xcb_set_modifier_mapping_reply_t()" location="f0:4678" file="f0" line="4678" endline="4678" inline="1">
  </Destructor>
  <OperatorMethod id="_3277" name="=" returns="_5501" artificial="1" throw="" context="_760" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_taSERKS_" demangled="xcb_set_modifier_mapping_reply_t::operator=(xcb_set_modifier_mapping_reply_t const&amp;)" location="f0:4678" file="f0" line="4678" endline="4678" inline="1">
    <Argument type="_5502" location="f0:4678" file="f0" line="4678"/>
  </OperatorMethod>
  <Constructor id="_3278" name="xcb_set_modifier_mapping_reply_t" artificial="1" throw="" context="_760" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_tC1ERKS_ *INTERNAL* " demangled="xcb_set_modifier_mapping_reply_t::xcb_set_modifier_mapping_reply_t(xcb_set_modifier_mapping_reply_t const&amp;)" location="f0:4678" file="f0" line="4678" endline="4678" inline="1">
    <Argument type="_5502" location="f0:4678" file="f0" line="4678"/>
  </Constructor>
  <Constructor id="_3279" name="xcb_set_modifier_mapping_reply_t" artificial="1" throw="" context="_760" access="public" mangled="_ZN32xcb_set_modifier_mapping_reply_tC1Ev *INTERNAL* " demangled="xcb_set_modifier_mapping_reply_t::xcb_set_modifier_mapping_reply_t()" location="f0:4678" file="f0" line="4678" inline="1"/>
  <Field id="_3280" name="major_opcode" type="_1473" offset="0" context="_762" access="public" location="f0:2163" file="f0" line="2163"/>
  <Field id="_3281" name="pad0" type="_1473" offset="8" context="_762" access="public" location="f0:2164" file="f0" line="2164"/>
  <Field id="_3282" name="length" type="_1398" offset="16" context="_762" access="public" location="f0:2165" file="f0" line="2165"/>
  <Field id="_3283" name="cursor" type="_1527" offset="32" context="_762" access="public" location="f0:2166" file="f0" line="2166"/>
  <Field id="_3284" name="time" type="_1254" offset="64" context="_762" access="public" location="f0:2167" file="f0" line="2167"/>
  <Field id="_3285" name="event_mask" type="_1398" offset="96" context="_762" access="public" location="f0:2168" file="f0" line="2168"/>
  <Field id="_3286" name="pad1" type="_5165" offset="112" context="_762" access="public" location="f0:2169" file="f0" line="2169"/>
  <Destructor id="_3287" name="xcb_change_active_pointer_grab_request_t" artificial="1" throw="" context="_762" access="public" mangled="_ZN40xcb_change_active_pointer_grab_request_tD1Ev *INTERNAL* " demangled="xcb_change_active_pointer_grab_request_t::~xcb_change_active_pointer_grab_request_t()" location="f0:2162" file="f0" line="2162" endline="2162" inline="1">
  </Destructor>
  <OperatorMethod id="_3288" name="=" returns="_5503" artificial="1" throw="" context="_762" access="public" mangled="_ZN40xcb_change_active_pointer_grab_request_taSERKS_" demangled="xcb_change_active_pointer_grab_request_t::operator=(xcb_change_active_pointer_grab_request_t const&amp;)" location="f0:2162" file="f0" line="2162" endline="2162" inline="1">
    <Argument type="_5504" location="f0:2162" file="f0" line="2162"/>
  </OperatorMethod>
  <Constructor id="_3289" name="xcb_change_active_pointer_grab_request_t" artificial="1" throw="" context="_762" access="public" mangled="_ZN40xcb_change_active_pointer_grab_request_tC1ERKS_ *INTERNAL* " demangled="xcb_change_active_pointer_grab_request_t::xcb_change_active_pointer_grab_request_t(xcb_change_active_pointer_grab_request_t const&amp;)" location="f0:2162" file="f0" line="2162" endline="2162" inline="1">
    <Argument type="_5504" location="f0:2162" file="f0" line="2162"/>
  </Constructor>
  <Constructor id="_3290" name="xcb_change_active_pointer_grab_request_t" artificial="1" throw="" context="_762" access="public" mangled="_ZN40xcb_change_active_pointer_grab_request_tC1Ev *INTERNAL* " demangled="xcb_change_active_pointer_grab_request_t::xcb_change_active_pointer_grab_request_t()" location="f0:2162" file="f0" line="2162" inline="1"/>
  <PointerType id="_3291" type="_945" size="32" align="32"/>
  <Field id="_3292" name="tv_sec" type="_1057" offset="0" context="_775" access="public" location="f1:122" file="f1" line="122"/>
  <Field id="_3293" name="tv_nsec" type="_1830" offset="32" context="_775" access="public" location="f1:123" file="f1" line="123"/>
  <Destructor id="_3294" name="timespec" artificial="1" throw="" context="_775" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f1:121" file="f1" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_3295" name="=" returns="_5505" artificial="1" throw="" context="_775" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f1:121" file="f1" line="121" endline="121" inline="1">
    <Argument type="_5506" location="f1:121" file="f1" line="121"/>
  </OperatorMethod>
  <Constructor id="_3296" name="timespec" artificial="1" throw="" context="_775" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f1:121" file="f1" line="121" endline="121" inline="1">
    <Argument type="_5506" location="f1:121" file="f1" line="121"/>
  </Constructor>
  <Constructor id="_3297" name="timespec" artificial="1" throw="" context="_775" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f1:121" file="f1" line="121" inline="1"/>
  <Field id="_3298" name="major_opcode" type="_1473" offset="0" context="_778" access="public" location="f0:2737" file="f0" line="2737"/>
  <Field id="_3299" name="odd_length" type="_1473" offset="8" context="_778" access="public" location="f0:2738" file="f0" line="2738"/>
  <Field id="_3300" name="length" type="_1398" offset="16" context="_778" access="public" location="f0:2739" file="f0" line="2739"/>
  <Field id="_3301" name="font" type="_240" offset="32" context="_778" access="public" location="f0:2740" file="f0" line="2740"/>
  <Destructor id="_3302" name="xcb_query_text_extents_request_t" artificial="1" throw="" context="_778" access="public" mangled="_ZN32xcb_query_text_extents_request_tD1Ev *INTERNAL* " demangled="xcb_query_text_extents_request_t::~xcb_query_text_extents_request_t()" location="f0:2736" file="f0" line="2736" endline="2736" inline="1">
  </Destructor>
